levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/**
 *******************************************************************************
 * @file  HC32M423.h
 * @brief Headerfile for HC32M423 series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-17       Levi          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file HC32M423.h
 **
 ** Auto generate.
 ** Header file for HC32M423 series MCU
 **
 ** History:
 **
 **   - 2020-02-17  1.0   First version for Device Driver Library of HC32M423 series MCU.
 **
 ******************************************************************************/

#ifndef __HC32M423_H__
#define __HC32M423_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M4 Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             1       /*!< HC32M423 provides MPU                            */
#define __VTOR_PRESENT            1       /*!< HC32M423 supported vector table registers            */
#define __NVIC_PRIO_BITS          4       /*!< HC32M423 uses 4 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used              */
#define __FPU_PRESENT             1       /*!< FPU present                                               */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum IRQn
{
        NMI_IRQn            = -14,  /* Non Maskable                             */
        HardFault_IRQn      = -13,  /* Hard Fault                               */
        MemManageFault_IRQn = -12,  /* MemManage Fault                          */
        BusFault_IRQn       = -11,  /* Bus Fault                                */
        UsageFault_IRQn     = -10,  /* Usage Fault                              */
        SVC_IRQn            = -5,   /* SVCall                                   */
        DebugMonitor_IRQn   = -4,   /* DebugMonitor                             */
        PendSV_IRQn         = -2,   /* Pend SV                                  */
        SysTick_IRQn        = -1,   /* System Tick                              */
        Int000_IRQn         = 0,
        Int001_IRQn         = 1,
        Int002_IRQn         = 2,
        Int003_IRQn         = 3,
        Int004_IRQn         = 4,
        Int005_IRQn         = 5,
        Int006_IRQn         = 6,
        Int007_IRQn         = 7,
        ExInt0_IRQn         = 8,
        ExInt1_IRQn         = 9,
        ExInt2_IRQn         = 10,
        ExInt3_IRQn         = 11,
        ExInt4_IRQn         = 12,
        ExInt5_IRQn         = 13,
        ExInt6_IRQn         = 14,
        ExInt7_IRQn         = 15,
        SwInt0_IRQn         = 0,
        SwInt1_IRQn         = 1,
        SwInt2_IRQn         = 2,
        SwInt3_IRQn         = 3,
        SwInt4_IRQn         = 4,
        SwInt5_IRQn         = 5,
        SwInt6_IRQn         = 6,
        SwInt7_IRQn         = 7,
        SwInt8_IRQn         = 8,
        SwInt9_IRQn         = 9,
        SwInt10_IRQn        = 10,
        SwInt11_IRQn        = 11,
        SwInt12_IRQn        = 12,
        SwInt13_IRQn        = 13,
        SwInt14_IRQn        = 14,
        SwInt15_IRQn        = 15,
        DmacTC0_IRQn        = 16,
        DmacTC1_IRQn        = 17,
        DmacTC2_IRQn        = 18,
        DmacTC3_IRQn        = 19,
        DmacBTC0_IRQn       = 20,
        DmacBTC1_IRQn       = 21,
        DmacBTC2_IRQn       = 22,
        DmacBTC3_IRQn       = 23,
        DmacErr_IRQn        = 24,
        EfmErr_IRQn         = 25,
        EfmReadCol_IRQn     = 26,
        EfmOpEnd_IRQn       = 27,
        Dcu_IRQn            = 28,
        Tmr01GCMA_IRQn      = 29,
        Tmr01GCMB_IRQn      = 30,
        Tmr02GCMA_IRQn      = 31,
        Tmr02GCMB_IRQn      = 32,
        XtalStop_IRQn       = 33,
        Swdt_IRQn           = 34,
        TmrA1OVF_IRQn       = 35,
        TmrA1UDF_IRQn       = 36,
        TmrA1CMP_IRQn       = 37,
        TmrA2OVF_IRQn       = 38,
        TmrA2UDF_IRQn       = 39,
        TmrA2CMP_IRQn       = 40,
        TmrA3OVF_IRQn       = 41,
        TmrA3UDF_IRQn       = 42,
        TmrA3CMP_IRQn       = 43,
        TmrA4OVF_IRQn       = 44,
        TmrA4UDF_IRQn       = 45,
        TmrA4CMP_IRQn       = 46,
        TmrBOVF_IRQn        = 47,
        TmrBUDF_IRQn        = 48,
        TmrBCMP_IRQn        = 49,
        Usart1EI_IRQn       = 50,
        Usart1RI_IRQn       = 51,
        Usart1TI_IRQn       = 52,
        Usart1TCI_IRQn      = 53,
        Usart2EI_IRQn       = 54,
        Usart2RI_IRQn       = 55,
        Usart2TI_IRQn       = 56,
        Usart2TCI_IRQn      = 57,
        Usart3EI_IRQn       = 58,
        Usart3RI_IRQn       = 59,
        Usart3TI_IRQn       = 60,
        Usart3TCI_IRQn      = 61,
        Usart4EI_IRQn       = 62,
        Usart4RI_IRQn       = 63,
        Usart4TI_IRQn       = 64,
        Usart4TCI_IRQn      = 65,
        SpiSRRI_IRQn        = 66,
        SpiSRTI_IRQn        = 67,
        SpiSpiI_IRQn        = 68,
        SpiSPEI_IRQn        = 69,
        Tmr4GCMUH_IRQn      = 70,
        Tmr4GCMUL_IRQn      = 71,
        Tmr4GCMVH_IRQn      = 72,
        Tmr4GCMVL_IRQn      = 73,
        Tmr4GCMWH_IRQn      = 74,
        Tmr4GCMWL_IRQn      = 75,
        Tmr4OVF_IRQn        = 76,
        Tmr4UDF_IRQn        = 77,
        Tmr4RLOU_IRQn       = 78,
        Tmr4RLOV_IRQn       = 79,
        Tmr4RLOW_IRQn       = 80,
        EmbGR0_IRQn         = 81,
        Acmp1_IRQn          = 82,
        Acmp2_IRQn          = 83,
        Acmp3_IRQn          = 84,
        I2cRXI_IRQn         = 85,
        I2cTXI_IRQn         = 86,
        I2cTEI_IRQn         = 87,
        I2cEEI_IRQn         = 88,
        Usart1WUPI_IRQn     = 89,
        Lvd1_IRQn           = 90,
        Lvd2_IRQn           = 91,
        FCMFERRI_IRQn       = 92,
        FCMMENDI_IRQn       = 93,
        FCMCOVFI_IRQn       = 94,
        Wdt_IRQn            = 95,
        CtcErr_IRQn         = 96,
        AdcEOCA_IRQn        = 97,
        AdcEOCB_IRQn        = 98,
        AdcCHCMP_IRQn       = 99,
        AdcSEQCMP_IRQn      = 100,

} IRQn_Type;

#include <core_cm4.h>
#include <stdint.h>

/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum en_event_src
{
        EVT_SWI_IRQ0        = 0,
        EVT_SWI_IRQ1        = 1,
        EVT_SWI_IRQ2        = 2,
        EVT_SWI_IRQ3        = 3,
        EVT_SWI_IRQ4        = 4,
        EVT_SWI_IRQ5        = 5,
        EVT_SWI_IRQ6        = 6,
        EVT_SWI_IRQ7        = 7,
        EVT_SWI_IRQ8        = 8,
        EVT_SWI_IRQ9        = 9,
        EVT_SWI_IRQ10       = 10,
        EVT_SWI_IRQ11       = 11,
        EVT_SWI_IRQ12       = 12,
        EVT_SWI_IRQ13       = 13,
        EVT_SWI_IRQ14       = 14,
        EVT_SWI_IRQ15       = 15,

        /* External Interrupt */
        EVT_PORT_EIRQ0      = 0,
        EVT_PORT_EIRQ1      = 1,
        EVT_PORT_EIRQ2      = 2,
        EVT_PORT_EIRQ3      = 3,
        EVT_PORT_EIRQ4      = 4,
        EVT_PORT_EIRQ5      = 5,
        EVT_PORT_EIRQ6      = 6,
        EVT_PORT_EIRQ7      = 7,

        /*  DMA  */
        EVT_DMA_TC0         = 32,
        EVT_DMA_TC1         = 33,
        EVT_DMA_TC2         = 34,
        EVT_DMA_TC3         = 35,

        EVT_DMA_BTC0        = 40,
        EVT_DMA_BTC1        = 41,
        EVT_DMA_BTC2        = 42,
        EVT_DMA_BTC3        = 43,

