levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
        /* EFM  */
        EVT_EFM_OPTEND      = 52,

        /* DCU  */
        EVT_DCU             = 55,

        /* TMR0  */
        EVT_TMR01_GCMA      = 64,
        EVT_TMR01_GCMB      = 65,
        EVT_TMR02_GCMA      = 66,
        EVT_TMR02_GCMB      = 67,

        /* TMRA */
        EVT_TMRA1_OVF       = 256,
        EVT_TMRA1_UDF       = 257,
        EVT_TMRA1_CMP       = 258,
        EVT_TMRA2_OVF       = 259,
        EVT_TMRA2_UDF       = 260,
        EVT_TMRA2_CMP       = 261,
        EVT_TMRA3_OVF       = 262,
        EVT_TMRA3_UDF       = 263,
        EVT_TMRA3_CMP       = 264,
        EVT_TMRA4_OVF       = 265,
        EVT_TMRA4_UDF       = 266,
        EVT_TMRA4_CMP       = 267,

        /* TMRB */
        EVT_TMRB_OVF        = 274,
        EVT_TMRB_UDF        = 275,
        EVT_TMRB_CMP        = 276,

        /* USART */
        EVT_USART1_EI       = 278,
        EVT_USART1_RI       = 279,
        EVT_USART1_TI       = 280,
        EVT_USART1_TCI      = 281,
        EVT_USART2_EI       = 283,
        EVT_USART2_RI       = 284,
        EVT_USART2_TI       = 285,
        EVT_USART2_TCI      = 286,
        EVT_USART3_EI       = 288,
        EVT_USART3_RI       = 289,
        EVT_USART3_TI       = 290,
        EVT_USART3_TCI      = 291,
        EVT_USART4_EI       = 293,
        EVT_USART4_RI       = 294,
        EVT_USART4_TI       = 295,
        EVT_USART4_TCI      = 296,

        /* SPI */
        EVT_SPI_SRRI        = 299,
        EVT_SPI_SRTI        = 300,
        EVT_SPI_SPII        = 301,
        EVT_SPI_SPEI        = 302,
        EVT_SPI_SPTEND      = 303,

        /* AOS */
        EVT_AOS_STRG        = 319,

        /* TMR4 */
        EVT_TMR4_SCMUH      = 368,
        EVT_TMR4_SCMUL      = 369,
        EVT_TMR4_SCMVH      = 370,
        EVT_TMR4_SCMVL      = 371,
        EVT_TMR4_SCMWH      = 372,
        EVT_TMR4_SCMWL      = 373,

        /* ACMP */
        EVT_ACMP1           = 416,
        EVT_ACMP2           = 417,
        EVT_ACMP3           = 418,

        /* I2C */
        EVT_I2C_RXI         = 420,
        EVT_I2C_TXI         = 421,
        EVT_I2C_TEI         = 422,
        EVT_I2C_EE1         = 423,

        /* LVD */
        EVT_LVD1            = 433,
        EVT_LVD2            = 434,

        /* WDT */
        EVT_WDT_REFUDF      = 439,

        /* ADC */
        EVT_ADC_EOCA        = 448,
        EVT_ADC_EOCB        = 449,
        EVT_ADC_CHCMP       = 450,
        EVT_ADC_SEQCMP      = 451,
} en_event_src_t;

/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum en_int_src
{
        INT_SWI_IRQ0        = 0,
        INT_SWI_IRQ1        = 1,
        INT_SWI_IRQ2        = 2,
        INT_SWI_IRQ3        = 3,
        INT_SWI_IRQ4        = 4,
        INT_SWI_IRQ5        = 5,
        INT_SWI_IRQ6        = 6,
        INT_SWI_IRQ7        = 7,
        INT_SWI_IRQ8        = 8,
        INT_SWI_IRQ9        = 9,
        INT_SWI_IRQ10       = 10,
        INT_SWI_IRQ11       = 11,
        INT_SWI_IRQ12       = 12,
        INT_SWI_IRQ13       = 13,
        INT_SWI_IRQ14       = 14,
        INT_SWI_IRQ15       = 15,

        /* External Interrupt */
        INT_PORT_EIRQ0      = 0,
        INT_PORT_EIRQ1      = 1,
        INT_PORT_EIRQ2      = 2,
        INT_PORT_EIRQ3      = 3,
        INT_PORT_EIRQ4      = 4,
        INT_PORT_EIRQ5      = 5,
        INT_PORT_EIRQ6      = 6,
        INT_PORT_EIRQ7      = 7,

        /* DMA */
        INT_DMA_TC0         = 32,
        INT_DMA_TC1         = 33,
        INT_DMA_TC2         = 34,
        INT_DMA_TC3         = 35,

        INT_DMA_BTC0        = 40,
        INT_DMA_BTC1        = 41,
        INT_DMA_BTC2        = 42,
        INT_DMA_BTC3        = 43,
        INT_DMA_ERR         = 48,

        /* EFM */
        INT_EFM_PEERR       = 50,
        INT_EFM_COLERR      = 51,
        INT_EFM_OPTEND      = 52,

        /* DCU */
        INT_DCU             = 55,

        /* TMR0 */
        INT_TMR01_GCMA      = 64,
        INT_TMR01_GCMB      = 65,
        INT_TMR02_GCMA      = 66,
        INT_TMR02_GCMB      = 67,

        /* XTAL */
        INT_XTAL_STOP       = 85,

        /* SWDT */
        INT_SWDT_REFUDF     = 87,

        /* TMRA */
        INT_TMRA1_OVF       = 256,
        INT_TMRA1_UDF       = 257,
        INT_TMRA1_CMP       = 258,
        INT_TMRA2_OVF       = 259,
        INT_TMRA2_UDF       = 260,
        INT_TMRA2_CMP       = 261,
        INT_TMRA3_OVF       = 262,
        INT_TMRA3_UDF       = 263,
        INT_TMRA3_CMP       = 264,
        INT_TMRA4_OVF       = 265,
        INT_TMRA4_UDF       = 266,
        INT_TMRA4_CMP       = 267,

        /* TMRB */
        INT_TMRB_OVF        = 274,
        INT_TMRB_UDF        = 275,
        INT_TMRB_CMP        = 276,

        /* USART */
        INT_USART1_EI       = 278,
        INT_USART1_RI       = 279,
        INT_USART1_TI       = 280,
        INT_USART1_TCI      = 281,
        INT_USART2_EI       = 283,
        INT_USART2_RI       = 284,
        INT_USART2_TI       = 285,
        INT_USART2_TCI      = 286,
        INT_USART3_EI       = 288,
        INT_USART3_RI       = 289,
        INT_USART3_TI       = 290,
        INT_USART3_TCI      = 291,
        INT_USART4_EI       = 293,
        INT_USART4_RI       = 294,
        INT_USART4_TI       = 295,
        INT_USART4_TCI      = 296,

        /* SPI */
        INT_SPI_SRRI        = 299,
        INT_SPI_SRTI        = 300,
        INT_SPI_SPII        = 301,
        INT_SPI_SPEI        = 302,

        /* TMR4 */
        INT_TMR4_GCMUH      = 320,
        INT_TMR4_GCMUL      = 321,
        INT_TMR4_GCMVH      = 322,
        INT_TMR4_GCMVL      = 323,
        INT_TMR4_GCMWH      = 324,
        INT_TMR4_GCMWL      = 325,
        INT_TMR4_GOVF       = 326,
        INT_TMR4_GUDF       = 327,
        INT_TMR4_RLOU       = 328,
        INT_TMR4_RLOV       = 329,
        INT_TMR4_RLOW       = 330,

        /* EMB */
        INT_EMB_GR0         = 390,

