levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
        /* ACMP */
        INT_ACMP1           = 416,
        INT_ACMP2           = 417,
        INT_ACMP3           = 418,

        /* I2C */
        INT_I2C_RXI         = 420,
        INT_I2C_TXI         = 421,
        INT_I2C_TEI         = 422,
        INT_I2C_EE1         = 423,

        /* USART1 wakeup */
        INT_USART1_WUPI     = 432,

        /* LVD */
        INT_LVD1            = 433,
        INT_LVD2            = 434,

        /* FCM */
        INT_FCMFERRI        = 436,
        INT_FCMMENDI        = 437,
        INT_FCMCOVFI        = 438,

        /* WDT */
        INT_WDT_REFUDF      = 439,

        /* CTC */
        INT_CTC_ERR         = 440,

        /* ADC */
        INT_ADC_EOCA        = 448,
        INT_ADC_EOCB        = 449,
        INT_ADC_CHCMP       = 450,
        INT_ADC_SEQCMP      = 451,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/
/**
 * @brief ADC
 */
typedef struct
{
    __IO uint8_t  STR;
    uint8_t RESERVED0[1];
    __IO uint16_t CR0;
    __IO uint16_t CR1;
    uint8_t RESERVED1[4];
    __IO uint16_t TRGSR;
    __IO uint16_t CHSELRA0;
    uint8_t RESERVED2[2];
    __IO uint16_t CHSELRB0;
    uint8_t RESERVED3[2];
    __IO uint16_t AVCHSELR0;
    uint8_t RESERVED4[2];
    __IO uint8_t  EXCHSELR;
    uint8_t RESERVED5[1];
    __IO uint16_t SHCR;
    uint8_t RESERVED6[4];
    __IO uint8_t  SSTR0;
    __IO uint8_t  SSTR1;
    __IO uint8_t  SSTR2;
    __IO uint8_t  SSTR3;
    __IO uint8_t  SSTR4;
    __IO uint8_t  SSTR5;
    __IO uint8_t  SSTR6;
    __IO uint8_t  SSTR7;
    __IO uint8_t  SSTR8;
    __IO uint8_t  SSTR9;
    uint8_t RESERVED7[26];
    __IO uint8_t  ISR;
    __IO uint8_t  ICR;
    __IO uint8_t  ISCLRR;
    uint8_t RESERVED8[9];
    __IO uint16_t DR0;
    __IO uint16_t DR1;
    __IO uint16_t DR2;
    __IO uint16_t DR3;
    __IO uint16_t DR4;
    __IO uint16_t DR5;
    __IO uint16_t DR6;
    __IO uint16_t DR7;
    __IO uint16_t DR8;
    __IO uint16_t DR9;
} M4_ADC_TypeDef;

/**
 * @brief AOS
 */
typedef struct
{
    __IO uint32_t INTC_STRGCR;
    uint8_t RESERVED0[28];
    __IO uint32_t TMR00_HTSSR;
    __IO uint32_t TMR01_HTSSR;
    uint8_t RESERVED1[24];
    __IO uint32_t TMRA0_HTSSR;
    __IO uint32_t TMRA1_HTSSR;
    uint8_t RESERVED2[8];
    __IO uint32_t TMRB_HTSSR;
    uint8_t RESERVED3[12];
    __IO uint32_t ADC_ITRGSELR0;
    __IO uint32_t ADC_ITRGSELR1;
    uint8_t RESERVED4[24];
    __IO uint32_t DMA0_TRGSEL;
    __IO uint32_t DMA1_TRGSEL;
    __IO uint32_t DMA2_TRGSEL;
    __IO uint32_t DMA3_TRGSEL;
    __IO uint32_t DCU_TRGSEL;
} M4_AOS_TypeDef;

/**
 * @brief CMP
 */
typedef struct
{
    __IO uint8_t  MDR;
    __IO uint8_t  FIR;
    __IO uint8_t  OCR;
    __IO uint8_t  VSR;
    __IO uint8_t  TWR1;
    __IO uint8_t  TWR2;
} M4_CMP_TypeDef;

/**
 * @brief CMU
 */
typedef struct
{
    __IO uint8_t  ADCKSEL;
    uint8_t RESERVED0[3];
    __IO uint8_t  XTALSTDSR;
    uint8_t RESERVED1[3];
    __IO uint32_t SCFGR;
    __IO uint8_t  CKSWR;
    uint8_t RESERVED2[3];
    __IO uint8_t  XTALCR;
    uint8_t RESERVED3[3];
    __IO uint8_t  XTALCFGR;
    __IO uint8_t  XTALSTBCR;
    uint8_t RESERVED4[2];
    __IO uint8_t  HRCCR;
    uint8_t RESERVED5[3];
    __IO uint8_t  HRCCFGR;
    uint8_t RESERVED6[3];
    __IO uint8_t  OSCSTBSR;
    uint8_t RESERVED7[3];
    __IO uint8_t  MCOCFGR;
    uint8_t RESERVED8[3];
    __IO uint8_t  XTALSTDCR;
    uint8_t RESERVED9[7];
    __IO uint32_t FCG;
    uint8_t RESERVED10[8];
    __IO uint8_t  LRCCR;
    uint8_t RESERVED11[3];
    __IO uint8_t  MRCCR;
    uint8_t RESERVED12[3];
    __IO uint32_t PLLCFGR;
    __IO uint8_t  PLLCR;
    uint8_t RESERVED13[3];
    __IO uint8_t  TPIUCKCFGR;
} M4_CMU_TypeDef;

/**
 * @brief CRC
 */
typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t RESLT;
    uint8_t RESERVED0[120];
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;
    __IO uint32_t DAT5;
    __IO uint32_t DAT6;
    __IO uint32_t DAT7;
    __IO uint32_t DAT8;
    __IO uint32_t DAT9;
    __IO uint32_t DAT10;
    __IO uint32_t DAT11;
    __IO uint32_t DAT12;
    __IO uint32_t DAT13;
    __IO uint32_t DAT14;
    __IO uint32_t DAT15;
    __IO uint32_t DAT16;
    __IO uint32_t DAT17;
    __IO uint32_t DAT18;
    __IO uint32_t DAT19;
    __IO uint32_t DAT20;
    __IO uint32_t DAT21;
    __IO uint32_t DAT22;
    __IO uint32_t DAT23;
    __IO uint32_t DAT24;
    __IO uint32_t DAT25;
    __IO uint32_t DAT26;
    __IO uint32_t DAT27;
    __IO uint32_t DAT28;
    __IO uint32_t DAT29;
    __IO uint32_t DAT30;
    __IO uint32_t DAT31;
} M4_CRC_TypeDef;

/**
 * @brief CTC
 */
typedef struct
{
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t STR;
} M4_CTC_TypeDef;

/**
 * @brief DAC
 */
typedef struct
{
    __IO uint16_t DADR1;
    uint8_t RESERVED0[6];
    __IO uint16_t DACR1;
    uint8_t RESERVED1[2];
    __IO uint16_t DADC1;
} M4_DAC_TypeDef;

/**
 * @brief DBGC
 */
typedef struct
{
    __IO uint32_t AUTHID0;
    __IO uint32_t AUTHID1;
    __IO uint32_t AUTHID2;
    __IO uint32_t RESV0;
    __IO uint32_t MCUSTAT;
    __IO uint32_t MCUCTL;
    __IO uint32_t FMCCTL;
} M4_DBGC_TypeDef;

/**
 * @brief DCU
 */
typedef struct
{
    __IO uint32_t CTL;
    __IO uint32_t FLAG;
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    __IO uint32_t FLAGCLR;
    __IO uint32_t INTSEL;
} M4_DCU_TypeDef;

/**
 * @brief DMA
 */
typedef struct
{
    __IO uint32_t EN;
    __IO uint32_t INTSTAT0;
    __IO uint32_t INTSTAT1;
    __IO uint32_t INTMASK0;
    __IO uint32_t INTMASK1;
    __IO uint32_t INTCLR0;
    __IO uint32_t INTCLR1;
    __IO uint32_t CHEN;
    uint8_t RESERVED0[4];
    __IO uint32_t CHSTAT;
    uint8_t RESERVED1[8];
    __IO uint32_t RAM_LLP;
    __IO uint32_t ROM_LLP;
    __IO uint32_t CHENCLR;
    uint8_t RESERVED2[4];
    __IO uint32_t SAR0;
    __IO uint32_t DAR0;
    __IO uint32_t CH0CTL0;
    __IO uint32_t CH0CTL1;
    uint8_t RESERVED3[48];
    __IO uint32_t SAR1;
    __IO uint32_t DAR1;
    __IO uint32_t CH1CTL0;
    __IO uint32_t CH1CTL1;
    uint8_t RESERVED4[48];
    __IO uint32_t SAR2;
    __IO uint32_t DAR2;
    __IO uint32_t CH2CTL0;
    __IO uint32_t CH2CTL1;
    uint8_t RESERVED5[48];
    __IO uint32_t SAR3;
    __IO uint32_t DAR3;
    __IO uint32_t CH3CTL0;
    __IO uint32_t CH3CTL1;
} M4_DMA_TypeDef;

/**
 * @brief EFM
 */
typedef struct
{
    __IO uint32_t FAPRT;
    __IO uint32_t FSTP;
    __IO uint32_t FRMC;
    __IO uint32_t FWMC;
    __IO uint32_t FSR;
    __IO uint32_t FSCLR;
    __IO uint32_t FITE;
    uint8_t RESERVED0[4];
    __IO uint32_t FPMTSW;
    __IO uint32_t FPMTEW;
    uint8_t RESERVED1[40];
    __IO uint32_t UQID0;
    __IO uint32_t UQID1;
    __IO uint32_t UQID2;
    __IO uint32_t UQID3;
    uint8_t RESERVED2[546];
    __IO uint8_t  HRCCFGR;
} M4_EFM_TypeDef;

/**
 * @brief EMB
 */
typedef struct
{
    __IO uint32_t CTL0;
    __IO uint32_t PWMLV0;
    __IO uint32_t SOE0;
    __IO uint32_t STAT0;
    __IO uint32_t STATCLR0;
    __IO uint32_t INTEN0;
    uint8_t RESERVED0[8];
    __IO uint32_t CTL1;
    uint8_t RESERVED1[4];
    __IO uint32_t SOE1;
    __IO uint32_t STAT1;
    __IO uint32_t STATCLR1;
    __IO uint32_t INTEN1;
    __IO uint32_t ECSR;
} M4_EMB_TypeDef;

/**
 * @brief FCM
 */
typedef struct
{
    __IO uint32_t LVR;
    __IO uint32_t UVR;
    __IO uint32_t CNTR;
    __IO uint32_t STR;
    __IO uint32_t MCCR;
    __IO uint32_t RCCR;
    __IO uint32_t RIER;
    __IO uint32_t SR;
    __IO uint32_t CLR;
} M4_FCM_TypeDef;

/**
 * @brief GPIO
 */
typedef struct
{
    __IO uint8_t  PIDR0;
    __IO uint8_t  PIDR1;
    __IO uint8_t  PIDR2;
    __IO uint8_t  PIDR3;
    __IO uint8_t  PIDR4;
    __IO uint8_t  PIDR5;
    uint8_t RESERVED0[1];
    __IO uint8_t  PIDR7;
    uint8_t RESERVED1[1];
    __IO uint8_t  PIDR9;
    __IO uint8_t  PIDRA;
    __IO uint8_t  PIDRB;
    uint8_t RESERVED2[1];
    __IO uint8_t  PIDRD;
    __IO uint8_t  PIDRE;
    uint8_t RESERVED3[1];
    __IO uint8_t  PODR0;
    __IO uint8_t  PODR1;
    __IO uint8_t  PODR2;
    __IO uint8_t  PODR3;
    __IO uint8_t  PODR4;
    __IO uint8_t  PODR5;
    uint8_t RESERVED4[1];
    __IO uint8_t  PODR7;
    uint8_t RESERVED5[1];
    __IO uint8_t  PODR9;
    __IO uint8_t  PODRA;
    __IO uint8_t  PODRB;
    uint8_t RESERVED6[1];
    __IO uint8_t  PODRD;
    __IO uint8_t  PODRE;
    uint8_t RESERVED7[1];
    __IO uint8_t  POER0;
    __IO uint8_t  POER1;
    __IO uint8_t  POER2;
    __IO uint8_t  POER3;
    __IO uint8_t  POER4;
    __IO uint8_t  POER5;
    uint8_t RESERVED8[1];
    __IO uint8_t  POER7;
    uint8_t RESERVED9[1];
    __IO uint8_t  POER9;
    __IO uint8_t  POERA;
    __IO uint8_t  POERB;
    uint8_t RESERVED10[1];
    __IO uint8_t  POERD;
    __IO uint8_t  POERE;
    uint8_t RESERVED11[1];
    __IO uint8_t  POSR0;
    __IO uint8_t  POSR1;
    __IO uint8_t  POSR2;
    __IO uint8_t  POSR3;
    __IO uint8_t  POSR4;
    __IO uint8_t  POSR5;
    uint8_t RESERVED12[1];
    __IO uint8_t  POSR7;
    uint8_t RESERVED13[1];
    __IO uint8_t  POSR9;
    __IO uint8_t  POSRA;
    __IO uint8_t  POSRB;
    uint8_t RESERVED14[1];
    __IO uint8_t  POSRD;
    __IO uint8_t  POSRE;
    uint8_t RESERVED15[1];
    __IO uint8_t  PORR0;
    __IO uint8_t  PORR1;
    __IO uint8_t  PORR2;
    __IO uint8_t  PORR3;
    __IO uint8_t  PORR4;
    __IO uint8_t  PORR5;
    uint8_t RESERVED16[1];
    __IO uint8_t  PORR7;
    uint8_t RESERVED17[1];
    __IO uint8_t  PORR9;
    __IO uint8_t  PORRA;
    __IO uint8_t  PORRB;
    uint8_t RESERVED18[1];
    __IO uint8_t  PORRD;
    __IO uint8_t  PORRE;
    uint8_t RESERVED19[1];
    __IO uint8_t  POTR0;
    __IO uint8_t  POTR1;
    __IO uint8_t  POTR2;
    __IO uint8_t  POTR3;
    __IO uint8_t  POTR4;
    __IO uint8_t  POTR5;
    uint8_t RESERVED20[1];
    __IO uint8_t  POTR7;
    uint8_t RESERVED21[1];
    __IO uint8_t  POTR9;
    __IO uint8_t  POTRA;
    __IO uint8_t  POTRB;
    uint8_t RESERVED22[1];
    __IO uint8_t  POTRD;
    __IO uint8_t  POTRE;
    uint8_t RESERVED23[673];
    __IO uint16_t PSPCR;
    uint8_t RESERVED24[2];
    __IO uint16_t PCCR;
    __IO uint16_t PINAER;
    __IO uint16_t PWPR;
    uint8_t RESERVED25[246];
    __IO uint16_t PCR00;
    __IO uint16_t PFSR00;
    __IO uint16_t PCR01;
    __IO uint16_t PFSR01;
    __IO uint16_t PCR02;
    __IO uint16_t PFSR02;
    uint8_t RESERVED26[20];
    __IO uint16_t PCR10;
    __IO uint16_t PFSR10;
    __IO uint16_t PCR11;
    __IO uint16_t PFSR11;
    uint8_t RESERVED27[32];
    __IO uint16_t PCR22;
    __IO uint16_t PFSR22;
    __IO uint16_t PCR23;
    __IO uint16_t PFSR23;
    __IO uint16_t PCR24;
    __IO uint16_t PFSR24;
    uint8_t RESERVED28[12];
    __IO uint16_t PCR30;
    __IO uint16_t PFSR30;
    __IO uint16_t PCR31;
    __IO uint16_t PFSR31;
    __IO uint16_t PCR32;
    __IO uint16_t PFSR32;
    __IO uint16_t PCR33;
    __IO uint16_t PFSR33;
    uint8_t RESERVED29[8];
    __IO uint16_t PCR36;
    __IO uint16_t PFSR36;
    __IO uint16_t PCR37;
    __IO uint16_t PFSR37;
    __IO uint16_t PCR40;
    __IO uint16_t PFSR40;
    __IO uint16_t PCR41;
    __IO uint16_t PFSR41;
    __IO uint16_t PCR42;
    __IO uint16_t PFSR42;
    __IO uint16_t PCR43;
    __IO uint16_t PFSR43;
    __IO uint16_t PCR44;
    __IO uint16_t PFSR44;
    __IO uint16_t PCR45;
    __IO uint16_t PFSR45;
    __IO uint16_t PCR46;
    __IO uint16_t PFSR46;
    __IO uint16_t PCR47;
    __IO uint16_t PFSR47;
    __IO uint16_t PCR50;
    __IO uint16_t PFSR50;
    uint8_t RESERVED30[60];
    __IO uint16_t PCR70;
    __IO uint16_t PFSR70;
    __IO uint16_t PCR71;
    __IO uint16_t PFSR71;
    __IO uint16_t PCR72;
    __IO uint16_t PFSR72;
    __IO uint16_t PCR73;
    __IO uint16_t PFSR73;
    __IO uint16_t PCR74;
    __IO uint16_t PFSR74;
    __IO uint16_t PCR75;
    __IO uint16_t PFSR75;
    __IO uint16_t PCR76;
    __IO uint16_t PFSR76;
    uint8_t RESERVED31[40];
    __IO uint16_t PCR91;
    __IO uint16_t PFSR91;
    __IO uint16_t PCR92;
    __IO uint16_t PFSR92;
    __IO uint16_t PCR93;
    __IO uint16_t PFSR93;
    __IO uint16_t PCR94;
    __IO uint16_t PFSR94;
    uint8_t RESERVED32[20];
    __IO uint16_t PCRA2;
    __IO uint16_t PFSRA2;
    __IO uint16_t PCRA3;
    __IO uint16_t PFSRA3;
    __IO uint16_t PCRA4;
    __IO uint16_t PFSRA4;
    __IO uint16_t PCRA5;
    __IO uint16_t PFSRA5;
    uint8_t RESERVED33[8];
    __IO uint16_t PCRB0;
    __IO uint16_t PFSRB0;
    __IO uint16_t PCRB1;
    __IO uint16_t PFSRB1;
    __IO uint16_t PCRB2;
    __IO uint16_t PFSRB2;
    __IO uint16_t PCRB3;
    __IO uint16_t PFSRB3;
    __IO uint16_t PCRB4;
    __IO uint16_t PFSRB4;
    __IO uint16_t PCRB5;
    __IO uint16_t PFSRB5;
    __IO uint16_t PCRB6;
    __IO uint16_t PFSRB6;
    __IO uint16_t PCRB7;
    __IO uint16_t PFSRB7;
    uint8_t RESERVED34[44];
    __IO uint16_t PCRD3;
    __IO uint16_t PFSRD3;
    __IO uint16_t PCRD4;
    __IO uint16_t PFSRD4;
    __IO uint16_t PCRD5;
    __IO uint16_t PFSRD5;
    __IO uint16_t PCRD6;
    __IO uint16_t PFSRD6;
    __IO uint16_t PCRD7;
    __IO uint16_t PFSRD7;
    uint8_t RESERVED35[8];
    __IO uint16_t PCRE2;
    __IO uint16_t PFSRE2;
} M4_GPIO_TypeDef;

/**
 * @brief I2C
 */
typedef struct
{
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    uint8_t RESERVED0[8];
    __IO uint32_t SLR0;
    __IO uint32_t SLR1;
    uint8_t RESERVED1[4];
    __IO uint32_t SR;
    __IO uint32_t CLR;
    __IO uint32_t DTR;
    __IO uint32_t DRR;
    __IO uint32_t CCR;
    __IO uint32_t FLTR;
} M4_I2C_TypeDef;

/**
 * @brief ICG
 */
typedef struct
{
    __IO uint32_t ICG0;
    __IO uint32_t ICG1;
    __IO uint32_t ICG2;
    __IO uint32_t ICG3;
    __IO uint32_t ICG4;
    __IO uint32_t ICG5;
    __IO uint32_t ICG6;
    __IO uint32_t ICG7;
} M4_ICG_TypeDef;

/**
 * @brief INTC
 */
typedef struct
{
    __IO uint32_t NMICR;
    __IO uint32_t NMIER;
    __IO uint32_t NMIFR;
    __IO uint32_t NMICFR;
    __IO uint32_t EIRQCR0;
    __IO uint32_t EIRQCR1;
    __IO uint32_t EIRQCR2;
    __IO uint32_t EIRQCR3;
    __IO uint32_t EIRQCR4;
    __IO uint32_t EIRQCR5;
    __IO uint32_t EIRQCR6;
    __IO uint32_t EIRQCR7;
    uint8_t RESERVED0[32];
    __IO uint32_t WUPEN;
    __IO uint32_t EIRQFR;
    __IO uint32_t EIRQCFR;
    __IO uint32_t SEL0;
    __IO uint32_t SEL1;
    __IO uint32_t SEL2;
    __IO uint32_t SEL3;
    __IO uint32_t SEL4;
    __IO uint32_t SEL5;
    __IO uint32_t SEL6;
    __IO uint32_t SEL7;
    __IO uint32_t SEL8;
    __IO uint32_t SEL9;
    __IO uint32_t SEL10;
    __IO uint32_t SEL11;
    __IO uint32_t SEL12;
    __IO uint32_t SEL13;
    __IO uint32_t SEL14;
    __IO uint32_t SEL15;
    __IO uint32_t SEL16;
    __IO uint32_t SEL17;
    __IO uint32_t SEL18;
    __IO uint32_t SEL19;
    __IO uint32_t SEL20;
    __IO uint32_t SEL21;
    __IO uint32_t SEL22;
    __IO uint32_t SEL23;
    __IO uint32_t SEL24;
    __IO uint32_t SEL25;
    __IO uint32_t SEL26;
    __IO uint32_t SEL27;
    __IO uint32_t SEL28;
    __IO uint32_t SEL29;
    __IO uint32_t SEL30;
    __IO uint32_t SEL31;
    __IO uint32_t SEL32;
    __IO uint32_t SEL33;
    __IO uint32_t SEL34;
    __IO uint32_t SEL35;
    __IO uint32_t SEL36;
    __IO uint32_t SEL37;
    __IO uint32_t SEL38;
    __IO uint32_t SEL39;
    __IO uint32_t SEL40;
    __IO uint32_t SEL41;
    __IO uint32_t SEL42;
    __IO uint32_t SEL43;
    __IO uint32_t SEL44;
    __IO uint32_t SEL45;
    __IO uint32_t SEL46;
    __IO uint32_t SEL47;
    __IO uint32_t SEL48;
    __IO uint32_t SEL49;
    __IO uint32_t SEL50;
    __IO uint32_t SEL51;
    __IO uint32_t SEL52;
    __IO uint32_t SEL53;
    __IO uint32_t SEL54;
    __IO uint32_t SEL55;
    __IO uint32_t SEL56;
    __IO uint32_t SEL57;
    __IO uint32_t SEL58;
    __IO uint32_t SEL59;
    __IO uint32_t SEL60;
    __IO uint32_t SEL61;
    __IO uint32_t SEL62;
    __IO uint32_t SEL63;
    __IO uint32_t SEL64;
    __IO uint32_t SEL65;
    __IO uint32_t SEL66;
    __IO uint32_t SEL67;
    __IO uint32_t SEL68;
    __IO uint32_t SEL69;
    __IO uint32_t SEL70;
    __IO uint32_t SEL71;
    __IO uint32_t SEL72;
    __IO uint32_t SEL73;
    __IO uint32_t SEL74;
    __IO uint32_t SEL75;
    __IO uint32_t SEL76;
    __IO uint32_t SEL77;
    __IO uint32_t SEL78;
    __IO uint32_t SEL79;
    __IO uint32_t SEL80;
    __IO uint32_t SEL81;
    __IO uint32_t SEL82;
    __IO uint32_t SEL83;
    __IO uint32_t SEL84;
    __IO uint32_t SEL85;
    __IO uint32_t SEL86;
    __IO uint32_t SEL87;
    __IO uint32_t SEL88;
    __IO uint32_t SEL89;
    __IO uint32_t SEL90;
    __IO uint32_t SEL91;
    __IO uint32_t SEL92;
    __IO uint32_t SEL93;
    __IO uint32_t SEL94;
    __IO uint32_t SEL95;
    __IO uint32_t SEL96;
    __IO uint32_t SEL97;
    __IO uint32_t SEL98;
    __IO uint32_t SEL99;
    __IO uint32_t SEL100;
    uint8_t RESERVED1[172];
    __IO uint32_t SWIER;
    __IO uint32_t EVTER;
    __IO uint32_t IER;
} M4_INTC_TypeDef;

/**
 * @brief PWC
 */
typedef struct
{
    __IO uint8_t  STPMCR;
    uint8_t RESERVED0[3];
    __IO uint16_t PWRC;
    uint8_t RESERVED1[2];
    __IO uint8_t  PWRMONR;
    uint8_t RESERVED2[3];
    __IO uint8_t  RAMCR;
    uint8_t RESERVED3[3];
    __IO uint32_t LVDCR0;
    __IO uint8_t  LVDCSR1;
    uint8_t RESERVED4[11];
    __IO uint16_t FPRC;
    uint8_t RESERVED5[30];
    __IO uint16_t DBGC;
    uint8_t RESERVED6[190];
    __IO uint16_t RSTF0;
} M4_PWC_TypeDef;

/**
 * @brief RMU
 */
typedef struct
{
    __IO uint16_t RSTF0;
} M4_RMU_TypeDef;

/**
 * @brief SPI
 */
typedef struct
{
    __IO uint32_t DR;
    __IO uint32_t CR1;
    uint8_t RESERVED0[4];
    __IO uint32_t CFG1;
    uint8_t RESERVED1[4];
    __IO uint32_t SR;
    __IO uint32_t CFG2;
} M4_SPI_TypeDef;

/**
 * @brief SWDT
 */
typedef struct
{
    uint8_t RESERVED0[4];
    __IO uint32_t SR;
    __IO uint32_t RR;
} M4_SWDT_TypeDef;

/**
 * @brief TMR0
 */
typedef struct
{
    __IO uint32_t CNTAR;
    __IO uint32_t CNTBR;
    __IO uint32_t CMPAR;
    __IO uint32_t CMPBR;
    __IO uint32_t BCONR;
    __IO uint32_t STFLR;
} M4_TMR0_TypeDef;

/**
 * @brief TMR4
 */
typedef struct
{
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUH;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRWL;
    __IO uint16_t OCSRU;
    __IO uint16_t OCERU;
    __IO uint16_t OCSRV;
    __IO uint16_t OCERV;
    __IO uint16_t OCSRW;
    __IO uint16_t OCERW;
    __IO uint16_t OCMRHUH;
    uint8_t RESERVED6[2];
    __IO uint32_t OCMRLUL;
    __IO uint16_t OCMRHVH;
    uint8_t RESERVED7[2];
    __IO uint32_t OCMRLVL;
    __IO uint16_t OCMRHWH;
    uint8_t RESERVED8[2];
    __IO uint32_t OCMRLWL;
    uint8_t RESERVED9[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED10[2];
    __IO uint16_t CNTR;
    __IO uint16_t CCSR;
    __IO uint16_t CVPR;
    uint8_t RESERVED11[54];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED12[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED13[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    __IO uint16_t POCRU;
    uint8_t RESERVED14[2];
    __IO uint16_t POCRV;
    uint8_t RESERVED15[2];
    __IO uint16_t POCRW;
    uint8_t RESERVED16[2];
    __IO uint16_t RCSR;
    uint8_t RESERVED17[12];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED18[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED19[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED20[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED21[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED22[2];
    __IO uint16_t SCCRWL;
    __IO uint16_t SCSRUH;
    __IO uint16_t SCMRUH;
    __IO uint16_t SCSRUL;
    __IO uint16_t SCMRUL;
    __IO uint16_t SCSRVH;
    __IO uint16_t SCMRVH;
    __IO uint16_t SCSRVL;
    __IO uint16_t SCMRVL;
    __IO uint16_t SCSRWH;
    __IO uint16_t SCMRWH;
    __IO uint16_t SCSRWL;
    __IO uint16_t SCMRWL;
    __IO uint32_t PSCR;
    __IO uint16_t SCER;
} M4_TMR4_TypeDef;

/**
 * @brief TMRA
 */
typedef struct
{
    __IO uint16_t CNTER;
    uint8_t RESERVED0[2];
    __IO uint16_t PERAR;
    uint8_t RESERVED1[58];
    __IO uint16_t CMPAR1;
    uint8_t RESERVED2[2];
    __IO uint16_t CMPAR2;
    uint8_t RESERVED3[58];
    __IO uint16_t BCSTR;
    uint8_t RESERVED4[2];
    __IO uint16_t HCONR;
    uint8_t RESERVED5[2];
    __IO uint16_t HCUPR;
    uint8_t RESERVED6[2];
    __IO uint16_t HCDOR;
    uint8_t RESERVED7[2];
    __IO uint16_t ICONR;
    uint8_t RESERVED8[2];
    __IO uint16_t ECONR;
    uint8_t RESERVED9[2];
    __IO uint16_t FCONR;
    uint8_t RESERVED10[2];
    __IO uint16_t STFLR;
    uint8_t RESERVED11[34];
    __IO uint16_t BCONR;
    uint8_t RESERVED12[62];
    __IO uint16_t CCONR1;
    uint8_t RESERVED13[2];
    __IO uint16_t CCONR2;
    uint8_t RESERVED14[58];
    __IO uint16_t PCONR1;
    uint8_t RESERVED15[2];
    __IO uint16_t PCONR2;
} M4_TMRA_TypeDef;

/**
 * @brief TMRB
 */
typedef struct
{
    __IO uint16_t CNTER;
    uint8_t RESERVED0[2];
    __IO uint16_t PERAR;
    uint8_t RESERVED1[58];
    __IO uint16_t CMPAR1;
    uint8_t RESERVED2[2];
    __IO uint16_t CMPAR2;
    uint8_t RESERVED3[2];
    __IO uint16_t CMPAR3;
    uint8_t RESERVED4[2];
    __IO uint16_t CMPAR4;
    uint8_t RESERVED5[2];
    __IO uint16_t CMPAR5;
    uint8_t RESERVED6[2];
    __IO uint16_t CMPAR6;
    uint8_t RESERVED7[42];
    __IO uint16_t BCSTR;
    uint8_t RESERVED8[2];
    __IO uint16_t HCONR;
    uint8_t RESERVED9[2];
    __IO uint16_t HCUPR;
    uint8_t RESERVED10[2];
    __IO uint16_t HCDOR;
    uint8_t RESERVED11[2];
    __IO uint16_t ICONR;
    uint8_t RESERVED12[2];
    __IO uint16_t ECONR;
    uint8_t RESERVED13[6];
    __IO uint16_t STFLR;
    uint8_t RESERVED14[34];
    __IO uint16_t BCONR1;
    uint8_t RESERVED15[6];
    __IO uint16_t BCONR2;
    uint8_t RESERVED16[6];
    __IO uint16_t BCONR3;
    uint8_t RESERVED17[46];
    __IO uint16_t CCONR1;
    uint8_t RESERVED18[2];
    __IO uint16_t CCONR2;
    uint8_t RESERVED19[2];
    __IO uint16_t CCONR3;
    uint8_t RESERVED20[2];
    __IO uint16_t CCONR4;
    uint8_t RESERVED21[50];
    __IO uint16_t PCONR1;
    uint8_t RESERVED22[2];
    __IO uint16_t PCONR2;
    uint8_t RESERVED23[2];
    __IO uint16_t PCONR3;
    uint8_t RESERVED24[2];
    __IO uint16_t PCONR4;
} M4_TMRB_TypeDef;

/**
 * @brief USART
 */
typedef struct
{
    __IO uint32_t SR;
    __IO uint32_t DR;
    __IO uint32_t BRR;
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t PR;
} M4_USART_TypeDef;

/**
 * @brief WDT
 */
typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} M4_WDT_TypeDef;



/******************************************************************************/
/*           Device Specific Peripheral declaration & memory map              */
/******************************************************************************/

