levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
#define M4_ADC                               ((M4_ADC_TypeDef *)0x40030000UL)
#define M4_AOS                               ((M4_AOS_TypeDef *)0x40010800UL)
#define M4_CMP1                              ((M4_CMP_TypeDef *)0x4004A000UL)
#define M4_CMP2                              ((M4_CMP_TypeDef *)0x4004A010UL)
#define M4_CMP3                              ((M4_CMP_TypeDef *)0x4004A020UL)
#define M4_CMU                               ((M4_CMU_TypeDef *)0x40054400UL)
#define M4_CRC                               ((M4_CRC_TypeDef *)0x40050400UL)
#define M4_CTC                               ((M4_CTC_TypeDef *)0x40010000UL)
#define M4_DAC                               ((M4_DAC_TypeDef *)0x4004A100UL)
#define M4_DBGC                              ((M4_DBGC_TypeDef *)0xE0042000UL)
#define M4_DCU                               ((M4_DCU_TypeDef *)0x40052000UL)
#define M4_DMA                               ((M4_DMA_TypeDef *)0x40053000UL)
#define M4_EFM                               ((M4_EFM_TypeDef *)0x40010400UL)
#define M4_EMB                               ((M4_EMB_TypeDef *)0x40017C00UL)
#define M4_FCM                               ((M4_FCM_TypeDef *)0x40048400UL)
#define M4_GPIO                              ((M4_GPIO_TypeDef *)0x40053800UL)
#define M4_I2C                               ((M4_I2C_TypeDef *)0x4004E000UL)
#define M4_ICG                               ((M4_ICG_TypeDef *)0x00000240UL)
#define M4_INTC                              ((M4_INTC_TypeDef *)0x40051000UL)
#define M4_PWC                               ((M4_PWC_TypeDef *)0x40054000UL)
#define M4_RMU                               ((M4_RMU_TypeDef *)0x40054100UL)
#define M4_SPI                               ((M4_SPI_TypeDef *)0x4001C000UL)
#define M4_SWDT                              ((M4_SWDT_TypeDef *)0x40049400UL)
#define M4_TMR01                             ((M4_TMR0_TypeDef *)0x40024000UL)
#define M4_TMR02                             ((M4_TMR0_TypeDef *)0x40024400UL)
#define M4_TMR4                              ((M4_TMR4_TypeDef *)0x40017000UL)
#define M4_TMRA1                             ((M4_TMRA_TypeDef *)0x40015000UL)
#define M4_TMRA2                             ((M4_TMRA_TypeDef *)0x40015400UL)
#define M4_TMRA3                             ((M4_TMRA_TypeDef *)0x40015800UL)
#define M4_TMRA4                             ((M4_TMRA_TypeDef *)0x40015C00UL)
#define M4_TMRB                              ((M4_TMRB_TypeDef *)0x40025000UL)
#define M4_USART1                            ((M4_USART_TypeDef *)0x4001D000UL)
#define M4_USART2                            ((M4_USART_TypeDef *)0x4001D400UL)
#define M4_USART3                            ((M4_USART_TypeDef *)0x40021000UL)
#define M4_USART4                            ((M4_USART_TypeDef *)0x40021400UL)
#define M4_WDT                               ((M4_WDT_TypeDef *)0x40049000UL)


/******************************************************************************/
/*                   Peripheral Registers Bits Definition                     */
/******************************************************************************/

/*******************************************************************************
                Bit definition for Peripheral ADC
*******************************************************************************/
/*  Bit definition for ADC_STR register  */
#define ADC_STR_STRT_POS                               (0U)
#define ADC_STR_STRT                                   ((uint8_t)0x01U)

/*  Bit definition for ADC_CR0 register  */
#define ADC_CR0_MS_POS                                 (0U)
#define ADC_CR0_MS                                     ((uint16_t)0x0003U)
#define ADC_CR0_MS_0                                   ((uint16_t)0x0001U)
#define ADC_CR0_MS_1                                   ((uint16_t)0x0002U)
#define ADC_CR0_ACCSEL_POS                             (4U)
#define ADC_CR0_ACCSEL                                 ((uint16_t)0x0030U)
#define ADC_CR0_ACCSEL_0                               ((uint16_t)0x0010U)
#define ADC_CR0_ACCSEL_1                               ((uint16_t)0x0020U)
#define ADC_CR0_CLREN_POS                              (6U)
#define ADC_CR0_CLREN                                  ((uint16_t)0x0040U)
#define ADC_CR0_DFMT_POS                               (7U)
#define ADC_CR0_DFMT                                   ((uint16_t)0x0080U)
#define ADC_CR0_AVCNT_POS                              (8U)
#define ADC_CR0_AVCNT                                  ((uint16_t)0x0700U)
#define ADC_CR0_AVCNT_0                                ((uint16_t)0x0100U)
#define ADC_CR0_AVCNT_1                                ((uint16_t)0x0200U)
#define ADC_CR0_AVCNT_2                                ((uint16_t)0x0400U)

/*  Bit definition for ADC_CR1 register  */
#define ADC_CR1_RSCHSEL_POS                            (2U)
#define ADC_CR1_RSCHSEL                                ((uint16_t)0x0004U)

/*  Bit definition for ADC_TRGSR register  */
#define ADC_TRGSR_TRGSELA_POS                          (0U)
#define ADC_TRGSR_TRGSELA                              ((uint16_t)0x0003U)
#define ADC_TRGSR_TRGSELA_0                            ((uint16_t)0x0001U)
#define ADC_TRGSR_TRGSELA_1                            ((uint16_t)0x0002U)
#define ADC_TRGSR_TRGENA_POS                           (7U)
#define ADC_TRGSR_TRGENA                               ((uint16_t)0x0080U)
#define ADC_TRGSR_TRGSELB_POS                          (8U)
#define ADC_TRGSR_TRGSELB                              ((uint16_t)0x0300U)
#define ADC_TRGSR_TRGSELB_0                            ((uint16_t)0x0100U)
#define ADC_TRGSR_TRGSELB_1                            ((uint16_t)0x0200U)
#define ADC_TRGSR_TRGENB_POS                           (15U)
#define ADC_TRGSR_TRGENB                               ((uint16_t)0x8000U)

/*  Bit definition for ADC_CHSELRA0 register  */
#define ADC_CHSELRA0_CHSELA_POS                        (0U)
#define ADC_CHSELRA0_CHSELA                            ((uint16_t)0x03FFU)
#define ADC_CHSELRA0_CHSELA_0                          ((uint16_t)0x0001U)
#define ADC_CHSELRA0_CHSELA_1                          ((uint16_t)0x0002U)
#define ADC_CHSELRA0_CHSELA_2                          ((uint16_t)0x0004U)
#define ADC_CHSELRA0_CHSELA_3                          ((uint16_t)0x0008U)
#define ADC_CHSELRA0_CHSELA_4                          ((uint16_t)0x0010U)
#define ADC_CHSELRA0_CHSELA_5                          ((uint16_t)0x0020U)
#define ADC_CHSELRA0_CHSELA_6                          ((uint16_t)0x0040U)
#define ADC_CHSELRA0_CHSELA_7                          ((uint16_t)0x0080U)
#define ADC_CHSELRA0_CHSELA_8                          ((uint16_t)0x0100U)
#define ADC_CHSELRA0_CHSELA_9                          ((uint16_t)0x0200U)

/*  Bit definition for ADC_CHSELRB0 register  */
#define ADC_CHSELRB0_CHSELB_POS                        (0U)
#define ADC_CHSELRB0_CHSELB                            ((uint16_t)0x03FFU)
#define ADC_CHSELRB0_CHSELB_0                          ((uint16_t)0x0001U)
#define ADC_CHSELRB0_CHSELB_1                          ((uint16_t)0x0002U)
#define ADC_CHSELRB0_CHSELB_2                          ((uint16_t)0x0004U)
#define ADC_CHSELRB0_CHSELB_3                          ((uint16_t)0x0008U)
#define ADC_CHSELRB0_CHSELB_4                          ((uint16_t)0x0010U)
#define ADC_CHSELRB0_CHSELB_5                          ((uint16_t)0x0020U)
#define ADC_CHSELRB0_CHSELB_6                          ((uint16_t)0x0040U)
#define ADC_CHSELRB0_CHSELB_7                          ((uint16_t)0x0080U)
#define ADC_CHSELRB0_CHSELB_8                          ((uint16_t)0x0100U)
#define ADC_CHSELRB0_CHSELB_9                          ((uint16_t)0x0200U)

/*  Bit definition for ADC_AVCHSELR0 register  */
#define ADC_AVCHSELR0_AVCHSEL_POS                      (0U)
#define ADC_AVCHSELR0_AVCHSEL                          ((uint16_t)0x03FFU)
#define ADC_AVCHSELR0_AVCHSEL_0                        ((uint16_t)0x0001U)
#define ADC_AVCHSELR0_AVCHSEL_1                        ((uint16_t)0x0002U)
#define ADC_AVCHSELR0_AVCHSEL_2                        ((uint16_t)0x0004U)
#define ADC_AVCHSELR0_AVCHSEL_3                        ((uint16_t)0x0008U)
#define ADC_AVCHSELR0_AVCHSEL_4                        ((uint16_t)0x0010U)
#define ADC_AVCHSELR0_AVCHSEL_5                        ((uint16_t)0x0020U)
#define ADC_AVCHSELR0_AVCHSEL_6                        ((uint16_t)0x0040U)
#define ADC_AVCHSELR0_AVCHSEL_7                        ((uint16_t)0x0080U)
#define ADC_AVCHSELR0_AVCHSEL_8                        ((uint16_t)0x0100U)
#define ADC_AVCHSELR0_AVCHSEL_9                        ((uint16_t)0x0200U)

/*  Bit definition for ADC_EXCHSELR register  */
#define ADC_EXCHSELR_EXCHSEL_POS                       (0U)
#define ADC_EXCHSELR_EXCHSEL                           ((uint8_t)0x01U)

/*  Bit definition for ADC_SHCR register  */
#define ADC_SHCR_SHT_POS                               (0U)
#define ADC_SHCR_SHT                                   ((uint16_t)0x00FFU)
#define ADC_SHCR_SHT_0                                 ((uint16_t)0x0001U)
#define ADC_SHCR_SHT_1                                 ((uint16_t)0x0002U)
#define ADC_SHCR_SHT_2                                 ((uint16_t)0x0004U)
#define ADC_SHCR_SHT_3                                 ((uint16_t)0x0008U)
#define ADC_SHCR_SHT_4                                 ((uint16_t)0x0010U)
#define ADC_SHCR_SHT_5                                 ((uint16_t)0x0020U)
#define ADC_SHCR_SHT_6                                 ((uint16_t)0x0040U)
#define ADC_SHCR_SHT_7                                 ((uint16_t)0x0080U)
#define ADC_SHCR_SHSEL_POS                             (8U)
#define ADC_SHCR_SHSEL                                 ((uint16_t)0x0700U)
#define ADC_SHCR_SHSEL_0                               ((uint16_t)0x0100U)
#define ADC_SHCR_SHSEL_1                               ((uint16_t)0x0200U)
#define ADC_SHCR_SHSEL_2                               ((uint16_t)0x0400U)
#define ADC_SHCR_SHMD_POS                              (15U)
#define ADC_SHCR_SHMD                                  ((uint16_t)0x8000U)

/*  Bit definition for ADC_SSTR0 register  */
#define ADC_SSTR0                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR1 register  */
#define ADC_SSTR1                                      ((uint8_t)0xFFU)

