levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for ADC_SSTR2 register  */
#define ADC_SSTR2                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR3 register  */
#define ADC_SSTR3                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR4 register  */
#define ADC_SSTR4                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR5 register  */
#define ADC_SSTR5                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR6 register  */
#define ADC_SSTR6                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR7 register  */
#define ADC_SSTR7                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR8 register  */
#define ADC_SSTR8                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_SSTR9 register  */
#define ADC_SSTR9                                      ((uint8_t)0xFFU)

/*  Bit definition for ADC_ISR register  */
#define ADC_ISR_EOCAF_POS                              (0U)
#define ADC_ISR_EOCAF                                  ((uint8_t)0x01U)
#define ADC_ISR_EOCBF_POS                              (1U)
#define ADC_ISR_EOCBF                                  ((uint8_t)0x02U)
#define ADC_ISR_SASTPDF_POS                            (4U)
#define ADC_ISR_SASTPDF                                ((uint8_t)0x10U)

/*  Bit definition for ADC_ICR register  */
#define ADC_ICR_EOCAIEN_POS                            (0U)
#define ADC_ICR_EOCAIEN                                ((uint8_t)0x01U)
#define ADC_ICR_EOCBIEN_POS                            (1U)
#define ADC_ICR_EOCBIEN                                ((uint8_t)0x02U)

/*  Bit definition for ADC_ISCLRR register  */
#define ADC_ISCLRR_CLREOCAF_POS                        (0U)
#define ADC_ISCLRR_CLREOCAF                            ((uint8_t)0x01U)
#define ADC_ISCLRR_CLREOCBF_POS                        (1U)
#define ADC_ISCLRR_CLREOCBF                            ((uint8_t)0x02U)
#define ADC_ISCLRR_CLRSASTPDF_POS                      (4U)
#define ADC_ISCLRR_CLRSASTPDF                          ((uint8_t)0x10U)

/*  Bit definition for ADC_DR0 register  */
#define ADC_DR0                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR1 register  */
#define ADC_DR1                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR2 register  */
#define ADC_DR2                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR3 register  */
#define ADC_DR3                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR4 register  */
#define ADC_DR4                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR5 register  */
#define ADC_DR5                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR6 register  */
#define ADC_DR6                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR7 register  */
#define ADC_DR7                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR8 register  */
#define ADC_DR8                                        ((uint16_t)0xFFFFU)

/*  Bit definition for ADC_DR9 register  */
#define ADC_DR9                                        ((uint16_t)0xFFFFU)


/*******************************************************************************
                Bit definition for Peripheral AOS
*******************************************************************************/
/*  Bit definition for AOS_INTC_STRGCR register  */
#define AOS_INTC_STRGCR_STRG_POS                       (0U)
#define AOS_INTC_STRGCR_STRG                           ((uint32_t)0x00000001U)

/*  Bit definition for AOS_TMR00_HTSSR register  */
#define AOS_TMR00_HTSSR_TRGSEL_POS                     (0U)
#define AOS_TMR00_HTSSR_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_TMR00_HTSSR_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_TMR00_HTSSR_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_TMR00_HTSSR_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_TMR00_HTSSR_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_TMR00_HTSSR_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_TMR00_HTSSR_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_TMR00_HTSSR_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_TMR00_HTSSR_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_TMR00_HTSSR_TRGSEL_8                       ((uint32_t)0x00000100U)

/*  Bit definition for AOS_TMR01_HTSSR register  */
#define AOS_TMR01_HTSSR_TRGSEL_POS                     (0U)
#define AOS_TMR01_HTSSR_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_TMR01_HTSSR_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_TMR01_HTSSR_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_TMR01_HTSSR_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_TMR01_HTSSR_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_TMR01_HTSSR_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_TMR01_HTSSR_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_TMR01_HTSSR_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_TMR01_HTSSR_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_TMR01_HTSSR_TRGSEL_8                       ((uint32_t)0x00000100U)

/*  Bit definition for AOS_TMRA0_HTSSR register  */
#define AOS_TMRA0_HTSSR_TRGSEL_POS                     (0U)
#define AOS_TMRA0_HTSSR_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_TMRA0_HTSSR_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_TMRA0_HTSSR_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_TMRA0_HTSSR_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_TMRA0_HTSSR_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_TMRA0_HTSSR_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_TMRA0_HTSSR_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_TMRA0_HTSSR_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_TMRA0_HTSSR_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_TMRA0_HTSSR_TRGSEL_8                       ((uint32_t)0x00000100U)

/*  Bit definition for AOS_TMRA1_HTSSR register  */
#define AOS_TMRA1_HTSSR_TRGSEL_POS                     (0U)
#define AOS_TMRA1_HTSSR_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_TMRA1_HTSSR_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_TMRA1_HTSSR_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_TMRA1_HTSSR_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_TMRA1_HTSSR_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_TMRA1_HTSSR_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_TMRA1_HTSSR_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_TMRA1_HTSSR_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_TMRA1_HTSSR_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_TMRA1_HTSSR_TRGSEL_8                       ((uint32_t)0x00000100U)

