levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for AOS_TMRB_HTSSR register  */
#define AOS_TMRB_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMRB_HTSSR_TRGSEL                          ((uint32_t)0x000001FFU)
#define AOS_TMRB_HTSSR_TRGSEL_0                        ((uint32_t)0x00000001U)
#define AOS_TMRB_HTSSR_TRGSEL_1                        ((uint32_t)0x00000002U)
#define AOS_TMRB_HTSSR_TRGSEL_2                        ((uint32_t)0x00000004U)
#define AOS_TMRB_HTSSR_TRGSEL_3                        ((uint32_t)0x00000008U)
#define AOS_TMRB_HTSSR_TRGSEL_4                        ((uint32_t)0x00000010U)
#define AOS_TMRB_HTSSR_TRGSEL_5                        ((uint32_t)0x00000020U)
#define AOS_TMRB_HTSSR_TRGSEL_6                        ((uint32_t)0x00000040U)
#define AOS_TMRB_HTSSR_TRGSEL_7                        ((uint32_t)0x00000080U)
#define AOS_TMRB_HTSSR_TRGSEL_8                        ((uint32_t)0x00000100U)

/*  Bit definition for AOS_ADC_ITRGSELR0 register  */
#define AOS_ADC_ITRGSELR0_TRGSEL_POS                   (0U)
#define AOS_ADC_ITRGSELR0_TRGSEL                       ((uint32_t)0x000001FFU)
#define AOS_ADC_ITRGSELR0_TRGSEL_0                     ((uint32_t)0x00000001U)
#define AOS_ADC_ITRGSELR0_TRGSEL_1                     ((uint32_t)0x00000002U)
#define AOS_ADC_ITRGSELR0_TRGSEL_2                     ((uint32_t)0x00000004U)
#define AOS_ADC_ITRGSELR0_TRGSEL_3                     ((uint32_t)0x00000008U)
#define AOS_ADC_ITRGSELR0_TRGSEL_4                     ((uint32_t)0x00000010U)
#define AOS_ADC_ITRGSELR0_TRGSEL_5                     ((uint32_t)0x00000020U)
#define AOS_ADC_ITRGSELR0_TRGSEL_6                     ((uint32_t)0x00000040U)
#define AOS_ADC_ITRGSELR0_TRGSEL_7                     ((uint32_t)0x00000080U)
#define AOS_ADC_ITRGSELR0_TRGSEL_8                     ((uint32_t)0x00000100U)

/*  Bit definition for AOS_ADC_ITRGSELR1 register  */
#define AOS_ADC_ITRGSELR1_TRGSEL_POS                   (0U)
#define AOS_ADC_ITRGSELR1_TRGSEL                       ((uint32_t)0x000001FFU)
#define AOS_ADC_ITRGSELR1_TRGSEL_0                     ((uint32_t)0x00000001U)
#define AOS_ADC_ITRGSELR1_TRGSEL_1                     ((uint32_t)0x00000002U)
#define AOS_ADC_ITRGSELR1_TRGSEL_2                     ((uint32_t)0x00000004U)
#define AOS_ADC_ITRGSELR1_TRGSEL_3                     ((uint32_t)0x00000008U)
#define AOS_ADC_ITRGSELR1_TRGSEL_4                     ((uint32_t)0x00000010U)
#define AOS_ADC_ITRGSELR1_TRGSEL_5                     ((uint32_t)0x00000020U)
#define AOS_ADC_ITRGSELR1_TRGSEL_6                     ((uint32_t)0x00000040U)
#define AOS_ADC_ITRGSELR1_TRGSEL_7                     ((uint32_t)0x00000080U)
#define AOS_ADC_ITRGSELR1_TRGSEL_8                     ((uint32_t)0x00000100U)

/*  Bit definition for AOS_DMA0_TRGSEL register  */
#define AOS_DMA0_TRGSEL_TRGSEL_POS                     (0U)
#define AOS_DMA0_TRGSEL_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_DMA0_TRGSEL_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_DMA0_TRGSEL_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_DMA0_TRGSEL_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_DMA0_TRGSEL_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_DMA0_TRGSEL_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_DMA0_TRGSEL_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_DMA0_TRGSEL_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_DMA0_TRGSEL_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_DMA0_TRGSEL_TRGSEL_8                       ((uint32_t)0x00000100U)

/*  Bit definition for AOS_DMA1_TRGSEL register  */
#define AOS_DMA1_TRGSEL_TRGSEL_POS                     (0U)
#define AOS_DMA1_TRGSEL_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_DMA1_TRGSEL_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_DMA1_TRGSEL_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_DMA1_TRGSEL_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_DMA1_TRGSEL_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_DMA1_TRGSEL_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_DMA1_TRGSEL_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_DMA1_TRGSEL_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_DMA1_TRGSEL_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_DMA1_TRGSEL_TRGSEL_8                       ((uint32_t)0x00000100U)

/*  Bit definition for AOS_DMA2_TRGSEL register  */
#define AOS_DMA2_TRGSEL_TRGSEL_POS                     (0U)
#define AOS_DMA2_TRGSEL_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_DMA2_TRGSEL_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_DMA2_TRGSEL_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_DMA2_TRGSEL_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_DMA2_TRGSEL_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_DMA2_TRGSEL_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_DMA2_TRGSEL_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_DMA2_TRGSEL_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_DMA2_TRGSEL_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_DMA2_TRGSEL_TRGSEL_8                       ((uint32_t)0x00000100U)

/*  Bit definition for AOS_DMA3_TRGSEL register  */
#define AOS_DMA3_TRGSEL_TRGSEL_POS                     (0U)
#define AOS_DMA3_TRGSEL_TRGSEL                         ((uint32_t)0x000001FFU)
#define AOS_DMA3_TRGSEL_TRGSEL_0                       ((uint32_t)0x00000001U)
#define AOS_DMA3_TRGSEL_TRGSEL_1                       ((uint32_t)0x00000002U)
#define AOS_DMA3_TRGSEL_TRGSEL_2                       ((uint32_t)0x00000004U)
#define AOS_DMA3_TRGSEL_TRGSEL_3                       ((uint32_t)0x00000008U)
#define AOS_DMA3_TRGSEL_TRGSEL_4                       ((uint32_t)0x00000010U)
#define AOS_DMA3_TRGSEL_TRGSEL_5                       ((uint32_t)0x00000020U)
#define AOS_DMA3_TRGSEL_TRGSEL_6                       ((uint32_t)0x00000040U)
#define AOS_DMA3_TRGSEL_TRGSEL_7                       ((uint32_t)0x00000080U)
#define AOS_DMA3_TRGSEL_TRGSEL_8                       ((uint32_t)0x00000100U)

/*  Bit definition for AOS_DCU_TRGSEL register  */
#define AOS_DCU_TRGSEL_TRGSEL_POS                      (0U)
#define AOS_DCU_TRGSEL_TRGSEL                          ((uint32_t)0x000001FFU)
#define AOS_DCU_TRGSEL_TRGSEL_0                        ((uint32_t)0x00000001U)
#define AOS_DCU_TRGSEL_TRGSEL_1                        ((uint32_t)0x00000002U)
#define AOS_DCU_TRGSEL_TRGSEL_2                        ((uint32_t)0x00000004U)
#define AOS_DCU_TRGSEL_TRGSEL_3                        ((uint32_t)0x00000008U)
#define AOS_DCU_TRGSEL_TRGSEL_4                        ((uint32_t)0x00000010U)
#define AOS_DCU_TRGSEL_TRGSEL_5                        ((uint32_t)0x00000020U)
#define AOS_DCU_TRGSEL_TRGSEL_6                        ((uint32_t)0x00000040U)
#define AOS_DCU_TRGSEL_TRGSEL_7                        ((uint32_t)0x00000080U)
#define AOS_DCU_TRGSEL_TRGSEL_8                        ((uint32_t)0x00000100U)


