levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*******************************************************************************
                Bit definition for Peripheral CMP
*******************************************************************************/
/*  Bit definition for CMP_MDR register  */
#define CMP_MDR_CENB_POS                               (0U)
#define CMP_MDR_CENB                                   ((uint8_t)0x01U)
#define CMP_MDR_CWDE_POS                               (1U)
#define CMP_MDR_CWDE                                   ((uint8_t)0x02U)
#define CMP_MDR_CMON_POS                               (7U)
#define CMP_MDR_CMON                                   ((uint8_t)0x80U)

/*  Bit definition for CMP_FIR register  */
#define CMP_FIR_FCKS_POS                               (0U)
#define CMP_FIR_FCKS                                   ((uint8_t)0x03U)
#define CMP_FIR_FCKS_0                                 ((uint8_t)0x01U)
#define CMP_FIR_FCKS_1                                 ((uint8_t)0x02U)
#define CMP_FIR_EDGS_POS                               (4U)
#define CMP_FIR_EDGS                                   ((uint8_t)0x30U)
#define CMP_FIR_EDGS_0                                 ((uint8_t)0x10U)
#define CMP_FIR_EDGS_1                                 ((uint8_t)0x20U)
#define CMP_FIR_CIEN_POS                               (6U)
#define CMP_FIR_CIEN                                   ((uint8_t)0x40U)

/*  Bit definition for CMP_OCR register  */
#define CMP_OCR_COEN_POS                               (0U)
#define CMP_OCR_COEN                                   ((uint8_t)0x01U)
#define CMP_OCR_COPS_POS                               (1U)
#define CMP_OCR_COPS                                   ((uint8_t)0x02U)
#define CMP_OCR_CPOE_POS                               (2U)
#define CMP_OCR_CPOE                                   ((uint8_t)0x04U)
#define CMP_OCR_TWOE_POS                               (3U)
#define CMP_OCR_TWOE                                   ((uint8_t)0x08U)
#define CMP_OCR_TWOL_POS                               (4U)
#define CMP_OCR_TWOL                                   ((uint8_t)0x10U)

/*  Bit definition for CMP_VSR register  */
#define CMP_VSR_RVSL_POS                               (0U)
#define CMP_VSR_RVSL                                   ((uint8_t)0x07U)
#define CMP_VSR_RVSL_0                                 ((uint8_t)0x01U)
#define CMP_VSR_RVSL_1                                 ((uint8_t)0x02U)
#define CMP_VSR_RVSL_2                                 ((uint8_t)0x04U)
#define CMP_VSR_CVSL_POS                               (4U)
#define CMP_VSR_CVSL                                   ((uint8_t)0xF0U)
#define CMP_VSR_CVSL_0                                 ((uint8_t)0x10U)
#define CMP_VSR_CVSL_1                                 ((uint8_t)0x20U)
#define CMP_VSR_CVSL_2                                 ((uint8_t)0x40U)
#define CMP_VSR_CVSL_3                                 ((uint8_t)0x80U)

/*  Bit definition for CMP_TWR1 register  */
#define CMP_TWR1_CTWS0_POS                             (0U)
#define CMP_TWR1_CTWS0                                 ((uint8_t)0x01U)
#define CMP_TWR1_CTWS1_POS                             (1U)
#define CMP_TWR1_CTWS1                                 ((uint8_t)0x02U)
#define CMP_TWR1_CTWS2_POS                             (2U)
#define CMP_TWR1_CTWS2                                 ((uint8_t)0x04U)
#define CMP_TWR1_CTWS3_POS                             (3U)
#define CMP_TWR1_CTWS3                                 ((uint8_t)0x08U)
#define CMP_TWR1_CTWS4_POS                             (4U)
#define CMP_TWR1_CTWS4                                 ((uint8_t)0x10U)
#define CMP_TWR1_CTWS5_POS                             (5U)
#define CMP_TWR1_CTWS5                                 ((uint8_t)0x20U)
#define CMP_TWR1_CTWS6_POS                             (6U)
#define CMP_TWR1_CTWS6                                 ((uint8_t)0x40U)
#define CMP_TWR1_CTWS7_POS                             (7U)
#define CMP_TWR1_CTWS7                                 ((uint8_t)0x80U)

/*  Bit definition for CMP_TWR2 register  */
#define CMP_TWR2_CTWP0_POS                             (0U)
#define CMP_TWR2_CTWP0                                 ((uint8_t)0x01U)
#define CMP_TWR2_CTWP1_POS                             (1U)
#define CMP_TWR2_CTWP1                                 ((uint8_t)0x02U)
#define CMP_TWR2_CTWP2_POS                             (2U)
#define CMP_TWR2_CTWP2                                 ((uint8_t)0x04U)
#define CMP_TWR2_CTWP3_POS                             (3U)
#define CMP_TWR2_CTWP3                                 ((uint8_t)0x08U)
#define CMP_TWR2_CTWP4_POS                             (4U)
#define CMP_TWR2_CTWP4                                 ((uint8_t)0x10U)
#define CMP_TWR2_CTWP5_POS                             (5U)
#define CMP_TWR2_CTWP5                                 ((uint8_t)0x20U)
#define CMP_TWR2_CTWP6_POS                             (6U)
#define CMP_TWR2_CTWP6                                 ((uint8_t)0x40U)
#define CMP_TWR2_CTWP7_POS                             (7U)
#define CMP_TWR2_CTWP7                                 ((uint8_t)0x80U)


/*******************************************************************************
                Bit definition for Peripheral CMU
*******************************************************************************/
/*  Bit definition for CMU_ADCKSEL register  */
#define CMU_ADCKSEL_ADCKSEL_POS                        (0U)
#define CMU_ADCKSEL_ADCKSEL                            ((uint8_t)0x07U)
#define CMU_ADCKSEL_ADCKSEL_0                          ((uint8_t)0x01U)
#define CMU_ADCKSEL_ADCKSEL_1                          ((uint8_t)0x02U)
#define CMU_ADCKSEL_ADCKSEL_2                          ((uint8_t)0x04U)

/*  Bit definition for CMU_XTALSTDSR register  */
#define CMU_XTALSTDSR_XTALSTDF_POS                     (0U)
#define CMU_XTALSTDSR_XTALSTDF                         ((uint8_t)0x01U)

/*  Bit definition for CMU_SCFGR register  */
#define CMU_SCFGR_PCLK1S_POS                           (0U)
#define CMU_SCFGR_PCLK1S                               ((uint32_t)0x00000007U)
#define CMU_SCFGR_PCLK1S_0                             ((uint32_t)0x00000001U)
#define CMU_SCFGR_PCLK1S_1                             ((uint32_t)0x00000002U)
#define CMU_SCFGR_PCLK1S_2                             ((uint32_t)0x00000004U)
#define CMU_SCFGR_PCLK4S_POS                           (12U)
#define CMU_SCFGR_PCLK4S                               ((uint32_t)0x00007000U)
#define CMU_SCFGR_PCLK4S_0                             ((uint32_t)0x00001000U)
#define CMU_SCFGR_PCLK4S_1                             ((uint32_t)0x00002000U)
#define CMU_SCFGR_PCLK4S_2                             ((uint32_t)0x00004000U)
#define CMU_SCFGR_HCLKS_POS                            (24U)
#define CMU_SCFGR_HCLKS                                ((uint32_t)0x07000000U)
#define CMU_SCFGR_HCLKS_0                              ((uint32_t)0x01000000U)
#define CMU_SCFGR_HCLKS_1                              ((uint32_t)0x02000000U)
#define CMU_SCFGR_HCLKS_2                              ((uint32_t)0x04000000U)

