levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for CMU_CKSWR register  */
#define CMU_CKSWR_CKSW_POS                             (0U)
#define CMU_CKSWR_CKSW                                 ((uint8_t)0x07U)
#define CMU_CKSWR_CKSW_0                               ((uint8_t)0x01U)
#define CMU_CKSWR_CKSW_1                               ((uint8_t)0x02U)
#define CMU_CKSWR_CKSW_2                               ((uint8_t)0x04U)

/*  Bit definition for CMU_XTALCR register  */
#define CMU_XTALCR_XTALSTP_POS                         (0U)
#define CMU_XTALCR_XTALSTP                             ((uint8_t)0x01U)

/*  Bit definition for CMU_XTALCFGR register  */
#define CMU_XTALCFGR_XTALDRV_POS                       (4U)
#define CMU_XTALCFGR_XTALDRV                           ((uint8_t)0x30U)
#define CMU_XTALCFGR_XTALDRV_0                         ((uint8_t)0x10U)
#define CMU_XTALCFGR_XTALDRV_1                         ((uint8_t)0x20U)
#define CMU_XTALCFGR_XTALMS_POS                        (6U)
#define CMU_XTALCFGR_XTALMS                            ((uint8_t)0x40U)
#define CMU_XTALCFGR_SUPDRV_POS                        (7U)
#define CMU_XTALCFGR_SUPDRV                            ((uint8_t)0x80U)

/*  Bit definition for CMU_XTALSTBCR register  */
#define CMU_XTALSTBCR_XTALSTB_POS                      (0U)
#define CMU_XTALSTBCR_XTALSTB                          ((uint8_t)0x07U)
#define CMU_XTALSTBCR_XTALSTB_0                        ((uint8_t)0x01U)
#define CMU_XTALSTBCR_XTALSTB_1                        ((uint8_t)0x02U)
#define CMU_XTALSTBCR_XTALSTB_2                        ((uint8_t)0x04U)

/*  Bit definition for CMU_HRCCR register  */
#define CMU_HRCCR_HRCSTP_POS                           (0U)
#define CMU_HRCCR_HRCSTP                               ((uint8_t)0x01U)

/*  Bit definition for CMU_HRCCFGR register  */
#define CMU_HRCCFGR_HRCFREQS_POS                       (0U)
#define CMU_HRCCFGR_HRCFREQS                           ((uint8_t)0x0FU)
#define CMU_HRCCFGR_HRCFREQS_0                         ((uint8_t)0x01U)
#define CMU_HRCCFGR_HRCFREQS_1                         ((uint8_t)0x02U)
#define CMU_HRCCFGR_HRCFREQS_2                         ((uint8_t)0x04U)
#define CMU_HRCCFGR_HRCFREQS_3                         ((uint8_t)0x08U)

/*  Bit definition for CMU_OSCSTBSR register  */
#define CMU_OSCSTBSR_HRCSTBF_POS                       (0U)
#define CMU_OSCSTBSR_HRCSTBF                           ((uint8_t)0x01U)
#define CMU_OSCSTBSR_XTALSTBF_POS                      (3U)
#define CMU_OSCSTBSR_XTALSTBF                          ((uint8_t)0x08U)
#define CMU_OSCSTBSR_PLLSTBF_POS                       (5U)
#define CMU_OSCSTBSR_PLLSTBF                           ((uint8_t)0x20U)

/*  Bit definition for CMU_MCOCFGR register  */
#define CMU_MCOCFGR_MCO1SEL_POS                        (0U)
#define CMU_MCOCFGR_MCO1SEL                            ((uint8_t)0x0FU)
#define CMU_MCOCFGR_MCO1SEL_0                          ((uint8_t)0x01U)
#define CMU_MCOCFGR_MCO1SEL_1                          ((uint8_t)0x02U)
#define CMU_MCOCFGR_MCO1SEL_2                          ((uint8_t)0x04U)
#define CMU_MCOCFGR_MCO1SEL_3                          ((uint8_t)0x08U)
#define CMU_MCOCFGR_MCO1DIV_POS                        (4U)
#define CMU_MCOCFGR_MCO1DIV                            ((uint8_t)0x70U)
#define CMU_MCOCFGR_MCO1DIV_0                          ((uint8_t)0x10U)
#define CMU_MCOCFGR_MCO1DIV_1                          ((uint8_t)0x20U)
#define CMU_MCOCFGR_MCO1DIV_2                          ((uint8_t)0x40U)
#define CMU_MCOCFGR_MCO1EN_POS                         (7U)
#define CMU_MCOCFGR_MCO1EN                             ((uint8_t)0x80U)

/*  Bit definition for CMU_XTALSTDCR register  */
#define CMU_XTALSTDCR_XTALSTDIE_POS                    (0U)
#define CMU_XTALSTDCR_XTALSTDIE                        ((uint8_t)0x01U)
#define CMU_XTALSTDCR_XTALSTDRE_POS                    (1U)
#define CMU_XTALSTDCR_XTALSTDRE                        ((uint8_t)0x02U)
#define CMU_XTALSTDCR_XTALSTDRIS_POS                   (2U)
#define CMU_XTALSTDCR_XTALSTDRIS                       ((uint8_t)0x04U)
#define CMU_XTALSTDCR_XTALSTDE_POS                     (7U)
#define CMU_XTALSTDCR_XTALSTDE                         ((uint8_t)0x80U)

/*  Bit definition for CMU_FCG register  */
#define CMU_FCG_ADC_POS                                (0U)
#define CMU_FCG_ADC                                    ((uint32_t)0x00000001U)
#define CMU_FCG_CTC_POS                                (1U)
#define CMU_FCG_CTC                                    ((uint32_t)0x00000002U)
#define CMU_FCG_CMP_POS                                (2U)
#define CMU_FCG_CMP                                    ((uint32_t)0x00000004U)
#define CMU_FCG_AOS_POS                                (4U)
#define CMU_FCG_AOS                                    ((uint32_t)0x00000010U)
#define CMU_FCG_DMA_POS                                (5U)
#define CMU_FCG_DMA                                    ((uint32_t)0x00000020U)
#define CMU_FCG_CRC_POS                                (7U)
#define CMU_FCG_CRC                                    ((uint32_t)0x00000080U)
#define CMU_FCG_TIMA1_POS                              (8U)
#define CMU_FCG_TIMA1                                  ((uint32_t)0x00000100U)
#define CMU_FCG_TIMA2_POS                              (9U)
#define CMU_FCG_TIMA2                                  ((uint32_t)0x00000200U)
#define CMU_FCG_TIMA3_POS                              (10U)
#define CMU_FCG_TIMA3                                  ((uint32_t)0x00000400U)
#define CMU_FCG_TIMA4_POS                              (11U)
#define CMU_FCG_TIMA4                                  ((uint32_t)0x00000800U)
#define CMU_FCG_TIM0_1_POS                             (16U)
#define CMU_FCG_TIM0_1                                 ((uint32_t)0x00010000U)
#define CMU_FCG_TIM0_2_POS                             (17U)
#define CMU_FCG_TIM0_2                                 ((uint32_t)0x00020000U)
#define CMU_FCG_TIM4_1_POS                             (18U)
#define CMU_FCG_TIM4_1                                 ((uint32_t)0x00040000U)
#define CMU_FCG_TIMB_1_POS                             (19U)
#define CMU_FCG_TIMB_1                                 ((uint32_t)0x00080000U)
#define CMU_FCG_EMB_POS                                (20U)
#define CMU_FCG_EMB                                    ((uint32_t)0x00100000U)
#define CMU_FCG_FCM_POS                                (21U)
#define CMU_FCG_FCM                                    ((uint32_t)0x00200000U)
#define CMU_FCG_DCU_POS                                (22U)
#define CMU_FCG_DCU                                    ((uint32_t)0x00400000U)
#define CMU_FCG_UART1_POS                              (24U)
#define CMU_FCG_UART1                                  ((uint32_t)0x01000000U)
#define CMU_FCG_UART2_POS                              (25U)
#define CMU_FCG_UART2                                  ((uint32_t)0x02000000U)
#define CMU_FCG_UART3_POS                              (26U)
#define CMU_FCG_UART3                                  ((uint32_t)0x04000000U)
#define CMU_FCG_UART4_POS                              (27U)
#define CMU_FCG_UART4                                  ((uint32_t)0x08000000U)
#define CMU_FCG_IIC_1_POS                              (28U)
#define CMU_FCG_IIC_1                                  ((uint32_t)0x10000000U)
#define CMU_FCG_SPI_1_POS                              (29U)
#define CMU_FCG_SPI_1                                  ((uint32_t)0x20000000U)

/*  Bit definition for CMU_LRCCR register  */
#define CMU_LRCCR_LRCSTP_POS                           (0U)
#define CMU_LRCCR_LRCSTP                               ((uint8_t)0x01U)

/*  Bit definition for CMU_MRCCR register  */
#define CMU_MRCCR_MRCSTP_POS                           (0U)
#define CMU_MRCCR_MRCSTP                               ((uint8_t)0x01U)

