levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for CMU_PLLCFGR register  */
#define CMU_PLLCFGR_PLLM_POS                           (0U)
#define CMU_PLLCFGR_PLLM                               ((uint32_t)0x00000007U)
#define CMU_PLLCFGR_PLLM_0                             ((uint32_t)0x00000001U)
#define CMU_PLLCFGR_PLLM_1                             ((uint32_t)0x00000002U)
#define CMU_PLLCFGR_PLLM_2                             ((uint32_t)0x00000004U)
#define CMU_PLLCFGR_PLLSRC_POS                         (7U)
#define CMU_PLLCFGR_PLLSRC                             ((uint32_t)0x00000080U)
#define CMU_PLLCFGR_PLLN_POS                           (8U)
#define CMU_PLLCFGR_PLLN                               ((uint32_t)0x00003F00U)
#define CMU_PLLCFGR_PLLN_0                             ((uint32_t)0x00000100U)
#define CMU_PLLCFGR_PLLN_1                             ((uint32_t)0x00000200U)
#define CMU_PLLCFGR_PLLN_2                             ((uint32_t)0x00000400U)
#define CMU_PLLCFGR_PLLN_3                             ((uint32_t)0x00000800U)
#define CMU_PLLCFGR_PLLN_4                             ((uint32_t)0x00001000U)
#define CMU_PLLCFGR_PLLN_5                             ((uint32_t)0x00002000U)
#define CMU_PLLCFGR_PLLP_POS                           (28U)
#define CMU_PLLCFGR_PLLP                               ((uint32_t)0x30000000U)
#define CMU_PLLCFGR_PLLP_0                             ((uint32_t)0x10000000U)
#define CMU_PLLCFGR_PLLP_1                             ((uint32_t)0x20000000U)

/*  Bit definition for CMU_PLLCR register  */
#define CMU_PLLCR_PLLOFF_POS                           (0U)
#define CMU_PLLCR_PLLOFF                               ((uint8_t)0x01U)

/*  Bit definition for CMU_TPIUCKCFGR register  */
#define CMU_TPIUCKCFGR_TPIUCKS_POS                     (0U)
#define CMU_TPIUCKCFGR_TPIUCKS                         ((uint8_t)0x03U)
#define CMU_TPIUCKCFGR_TPIUCKS_0                       ((uint8_t)0x01U)
#define CMU_TPIUCKCFGR_TPIUCKS_1                       ((uint8_t)0x02U)
#define CMU_TPIUCKCFGR_TPIUCKOE_POS                    (7U)
#define CMU_TPIUCKCFGR_TPIUCKOE                        ((uint8_t)0x80U)


/*******************************************************************************
                Bit definition for Peripheral CRC
*******************************************************************************/
/*  Bit definition for CRC_CR register  */
#define CRC_CR_CR_POS                                  (0U)
#define CRC_CR_CR                                      ((uint32_t)0x00000001U)
#define CRC_CR_FLAG_POS                                (1U)
#define CRC_CR_FLAG                                    ((uint32_t)0x00000002U)

/*  Bit definition for CRC_RESLT register  */
#define CRC_RESLT                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT0 register  */
#define CRC_DAT0                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT1 register  */
#define CRC_DAT1                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT2 register  */
#define CRC_DAT2                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT3 register  */
#define CRC_DAT3                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT4 register  */
#define CRC_DAT4                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT5 register  */
#define CRC_DAT5                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT6 register  */
#define CRC_DAT6                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT7 register  */
#define CRC_DAT7                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT8 register  */
#define CRC_DAT8                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT9 register  */
#define CRC_DAT9                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT10 register  */
#define CRC_DAT10                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT11 register  */
#define CRC_DAT11                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT12 register  */
#define CRC_DAT12                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT13 register  */
#define CRC_DAT13                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT14 register  */
#define CRC_DAT14                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT15 register  */
#define CRC_DAT15                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT16 register  */
#define CRC_DAT16                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT17 register  */
#define CRC_DAT17                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT18 register  */
#define CRC_DAT18                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT19 register  */
#define CRC_DAT19                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT20 register  */
#define CRC_DAT20                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT21 register  */
#define CRC_DAT21                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT22 register  */
#define CRC_DAT22                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT23 register  */
#define CRC_DAT23                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT24 register  */
#define CRC_DAT24                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT25 register  */
#define CRC_DAT25                                      ((uint32_t)0xFFFFFFFFU)

