levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for CRC_DAT26 register  */
#define CRC_DAT26                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT27 register  */
#define CRC_DAT27                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT28 register  */
#define CRC_DAT28                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT29 register  */
#define CRC_DAT29                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT30 register  */
#define CRC_DAT30                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for CRC_DAT31 register  */
#define CRC_DAT31                                      ((uint32_t)0xFFFFFFFFU)


/*******************************************************************************
                Bit definition for Peripheral CTC
*******************************************************************************/
/*  Bit definition for CTC_CR1 register  */
#define CTC_CR1_REFPSC_POS                             (0U)
#define CTC_CR1_REFPSC                                 ((uint32_t)0x00000007U)
#define CTC_CR1_REFPSC_0                               ((uint32_t)0x00000001U)
#define CTC_CR1_REFPSC_1                               ((uint32_t)0x00000002U)
#define CTC_CR1_REFPSC_2                               ((uint32_t)0x00000004U)
#define CTC_CR1_REFCKS_POS                             (4U)
#define CTC_CR1_REFCKS                                 ((uint32_t)0x00000030U)
#define CTC_CR1_REFCKS_0                               ((uint32_t)0x00000010U)
#define CTC_CR1_REFCKS_1                               ((uint32_t)0x00000020U)
#define CTC_CR1_ERRIE_POS                              (6U)
#define CTC_CR1_ERRIE                                  ((uint32_t)0x00000040U)
#define CTC_CR1_CTCEN_POS                              (7U)
#define CTC_CR1_CTCEN                                  ((uint32_t)0x00000080U)
#define CTC_CR1_TRMVAL_POS                             (16U)
#define CTC_CR1_TRMVAL                                 ((uint32_t)0x003F0000U)
#define CTC_CR1_TRMVAL_0                               ((uint32_t)0x00010000U)
#define CTC_CR1_TRMVAL_1                               ((uint32_t)0x00020000U)
#define CTC_CR1_TRMVAL_2                               ((uint32_t)0x00040000U)
#define CTC_CR1_TRMVAL_3                               ((uint32_t)0x00080000U)
#define CTC_CR1_TRMVAL_4                               ((uint32_t)0x00100000U)
#define CTC_CR1_TRMVAL_5                               ((uint32_t)0x00200000U)

/*  Bit definition for CTC_CR2 register  */
#define CTC_CR2_OFSVAL_POS                             (0U)
#define CTC_CR2_OFSVAL                                 ((uint32_t)0x000000FFU)
#define CTC_CR2_OFSVAL_0                               ((uint32_t)0x00000001U)
#define CTC_CR2_OFSVAL_1                               ((uint32_t)0x00000002U)
#define CTC_CR2_OFSVAL_2                               ((uint32_t)0x00000004U)
#define CTC_CR2_OFSVAL_3                               ((uint32_t)0x00000008U)
#define CTC_CR2_OFSVAL_4                               ((uint32_t)0x00000010U)
#define CTC_CR2_OFSVAL_5                               ((uint32_t)0x00000020U)
#define CTC_CR2_OFSVAL_6                               ((uint32_t)0x00000040U)
#define CTC_CR2_OFSVAL_7                               ((uint32_t)0x00000080U)
#define CTC_CR2_RLDVAL_POS                             (16U)
#define CTC_CR2_RLDVAL                                 ((uint32_t)0xFFFF0000U)
#define CTC_CR2_RLDVAL_0                               ((uint32_t)0x00010000U)
#define CTC_CR2_RLDVAL_1                               ((uint32_t)0x00020000U)
#define CTC_CR2_RLDVAL_2                               ((uint32_t)0x00040000U)
#define CTC_CR2_RLDVAL_3                               ((uint32_t)0x00080000U)
#define CTC_CR2_RLDVAL_4                               ((uint32_t)0x00100000U)
#define CTC_CR2_RLDVAL_5                               ((uint32_t)0x00200000U)
#define CTC_CR2_RLDVAL_6                               ((uint32_t)0x00400000U)
#define CTC_CR2_RLDVAL_7                               ((uint32_t)0x00800000U)
#define CTC_CR2_RLDVAL_8                               ((uint32_t)0x01000000U)
#define CTC_CR2_RLDVAL_9                               ((uint32_t)0x02000000U)
#define CTC_CR2_RLDVAL_10                              ((uint32_t)0x04000000U)
#define CTC_CR2_RLDVAL_11                              ((uint32_t)0x08000000U)
#define CTC_CR2_RLDVAL_12                              ((uint32_t)0x10000000U)
#define CTC_CR2_RLDVAL_13                              ((uint32_t)0x20000000U)
#define CTC_CR2_RLDVAL_14                              ((uint32_t)0x40000000U)
#define CTC_CR2_RLDVAL_15                              ((uint32_t)0x80000000U)

/*  Bit definition for CTC_STR register  */
#define CTC_STR_TRIMOK_POS                             (0U)
#define CTC_STR_TRIMOK                                 ((uint32_t)0x00000001U)
#define CTC_STR_TRMOVF_POS                             (1U)
#define CTC_STR_TRMOVF                                 ((uint32_t)0x00000002U)
#define CTC_STR_TRMUDF_POS                             (2U)
#define CTC_STR_TRMUDF                                 ((uint32_t)0x00000004U)
#define CTC_STR_CTCBSY_POS                             (3U)
#define CTC_STR_CTCBSY                                 ((uint32_t)0x00000008U)


/*******************************************************************************
                Bit definition for Peripheral DAC
*******************************************************************************/
/*  Bit definition for CMP_DADR1 register  */
#define CMP_DADR1_DATA1_POS                            (0U)
#define CMP_DADR1_DATA1                                ((uint16_t)0x00FFU)
#define CMP_DADR1_DATA1_0                              ((uint16_t)0x0001U)
#define CMP_DADR1_DATA1_1                              ((uint16_t)0x0002U)
#define CMP_DADR1_DATA1_2                              ((uint16_t)0x0004U)
#define CMP_DADR1_DATA1_3                              ((uint16_t)0x0008U)
#define CMP_DADR1_DATA1_4                              ((uint16_t)0x0010U)
#define CMP_DADR1_DATA1_5                              ((uint16_t)0x0020U)
#define CMP_DADR1_DATA1_6                              ((uint16_t)0x0040U)
#define CMP_DADR1_DATA1_7                              ((uint16_t)0x0080U)
#define CMP_DADR1_DATA2_POS                            (8U)
#define CMP_DADR1_DATA2                                ((uint16_t)0xFF00U)
#define CMP_DADR1_DATA2_0                              ((uint16_t)0x0100U)
#define CMP_DADR1_DATA2_1                              ((uint16_t)0x0200U)
#define CMP_DADR1_DATA2_2                              ((uint16_t)0x0400U)
#define CMP_DADR1_DATA2_3                              ((uint16_t)0x0800U)
#define CMP_DADR1_DATA2_4                              ((uint16_t)0x1000U)
#define CMP_DADR1_DATA2_5                              ((uint16_t)0x2000U)
#define CMP_DADR1_DATA2_6                              ((uint16_t)0x4000U)
#define CMP_DADR1_DATA2_7                              ((uint16_t)0x8000U)

/*  Bit definition for CMP_DACR1 register  */
#define CMP_DACR1_DAEN_POS                             (0U)
#define CMP_DACR1_DAEN                                 ((uint16_t)0x0001U)
#define CMP_DACR1_ALGN_POS                             (8U)
#define CMP_DACR1_ALGN                                 ((uint16_t)0x0100U)

/*  Bit definition for CMP_DADC1 register  */
#define CMP_DADC1_DASW_POS                             (0U)
#define CMP_DADC1_DASW                                 ((uint16_t)0x0001U)
#define CMP_DADC1_WPRT_POS                             (8U)
#define CMP_DADC1_WPRT                                 ((uint16_t)0xFF00U)
#define CMP_DADC1_WPRT_0                               ((uint16_t)0x0100U)
#define CMP_DADC1_WPRT_1                               ((uint16_t)0x0200U)
#define CMP_DADC1_WPRT_2                               ((uint16_t)0x0400U)
#define CMP_DADC1_WPRT_3                               ((uint16_t)0x0800U)
#define CMP_DADC1_WPRT_4                               ((uint16_t)0x1000U)
#define CMP_DADC1_WPRT_5                               ((uint16_t)0x2000U)
#define CMP_DADC1_WPRT_6                               ((uint16_t)0x4000U)
#define CMP_DADC1_WPRT_7                               ((uint16_t)0x8000U)


