levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*******************************************************************************
                Bit definition for Peripheral DBGC
*******************************************************************************/
/*  Bit definition for DBG_AUTHID0 register  */
#define DBG_AUTHID0                                    ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBG_AUTHID1 register  */
#define DBG_AUTHID1                                    ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBG_AUTHID2 register  */
#define DBG_AUTHID2                                    ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBG_RESV0 register  */
#define DBG_RESV0                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DBG_MCUSTAT register  */
#define DBG_MCUSTAT_DBG_AUTH_POS                       (0U)
#define DBG_MCUSTAT_DBG_AUTH                           ((uint32_t)0x00000001U)
#define DBG_MCUSTAT_FMC_REMVLOCK_POS                   (1U)
#define DBG_MCUSTAT_FMC_REMVLOCK                       ((uint32_t)0x00000002U)
#define DBG_MCUSTAT_FMC_SAFTYLOCK1_POS                 (2U)
#define DBG_MCUSTAT_FMC_SAFTYLOCK1                     ((uint32_t)0x00000004U)
#define DBG_MCUSTAT_FMC_SAFTYLOCK2_POS                 (3U)
#define DBG_MCUSTAT_FMC_SAFTYLOCK2                     ((uint32_t)0x00000008U)
#define DBG_MCUSTAT_MCUSTAT0_POS                       (8U)
#define DBG_MCUSTAT_MCUSTAT0                           ((uint32_t)0x00000100U)
#define DBG_MCUSTAT_MCUSTAT1_POS                       (9U)
#define DBG_MCUSTAT_MCUSTAT1                           ((uint32_t)0x00000200U)

/*  Bit definition for DBG_MCUCTL register  */
#define DBG_MCUCTL_EDBGRQ_POS                          (0U)
#define DBG_MCUCTL_EDBGRQ                              ((uint32_t)0x00000001U)
#define DBG_MCUCTL_RESTART_POS                         (1U)
#define DBG_MCUCTL_RESTART                             ((uint32_t)0x00000002U)
#define DBG_MCUCTL_DBG_IRQ_POS                         (8U)
#define DBG_MCUCTL_DBG_IRQ                             ((uint32_t)0x00000100U)

/*  Bit definition for DBG_FMCCTL register  */
#define DBG_FMCCTL_ERASEREQ_POS                        (0U)
#define DBG_FMCCTL_ERASEREQ                            ((uint32_t)0x00000001U)
#define DBG_FMCCTL_ERASEACK_POS                        (1U)
#define DBG_FMCCTL_ERASEACK                            ((uint32_t)0x00000002U)
#define DBG_FMCCTL_ERASEERR_POS                        (2U)
#define DBG_FMCCTL_ERASEERR                            ((uint32_t)0x00000004U)


/*******************************************************************************
                Bit definition for Peripheral DCU
*******************************************************************************/
/*  Bit definition for DCU_CTL register  */
#define DCU_CTL_MODE_POS                               (0U)
#define DCU_CTL_MODE                                   ((uint32_t)0x00000007U)
#define DCU_CTL_MODE_0                                 ((uint32_t)0x00000001U)
#define DCU_CTL_MODE_1                                 ((uint32_t)0x00000002U)
#define DCU_CTL_MODE_2                                 ((uint32_t)0x00000004U)
#define DCU_CTL_DATASIZE_POS                           (3U)
#define DCU_CTL_DATASIZE                               ((uint32_t)0x00000018U)
#define DCU_CTL_DATASIZE_0                             ((uint32_t)0x00000008U)
#define DCU_CTL_DATASIZE_1                             ((uint32_t)0x00000010U)
#define DCU_CTL_COMP_TRG_POS                           (8U)
#define DCU_CTL_COMP_TRG                               ((uint32_t)0x00000100U)
#define DCU_CTL_INTEN_POS                              (31U)
#define DCU_CTL_INTEN                                  ((uint32_t)0x80000000U)

/*  Bit definition for DCU_FLAG register  */
#define DCU_FLAG_FLAG_OP_POS                           (0U)
#define DCU_FLAG_FLAG_OP                               ((uint32_t)0x00000001U)
#define DCU_FLAG_FLAG_LS2_POS                          (1U)
#define DCU_FLAG_FLAG_LS2                              ((uint32_t)0x00000002U)
#define DCU_FLAG_FLAG_EQ2_POS                          (2U)
#define DCU_FLAG_FLAG_EQ2                              ((uint32_t)0x00000004U)
#define DCU_FLAG_FLAG_GT2_POS                          (3U)
#define DCU_FLAG_FLAG_GT2                              ((uint32_t)0x00000008U)
#define DCU_FLAG_FLAG_LS1_POS                          (4U)
#define DCU_FLAG_FLAG_LS1                              ((uint32_t)0x00000010U)
#define DCU_FLAG_FLAG_EQ1_POS                          (5U)
#define DCU_FLAG_FLAG_EQ1                              ((uint32_t)0x00000020U)
#define DCU_FLAG_FLAG_GT1_POS                          (6U)
#define DCU_FLAG_FLAG_GT1                              ((uint32_t)0x00000040U)

/*  Bit definition for DCU_DATA0 register  */
#define DCU_DATA0                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DCU_DATA1 register  */
#define DCU_DATA1                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DCU_DATA2 register  */
#define DCU_DATA2                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DCU_FLAGCLR register  */
#define DCU_FLAGCLR_CLR_OP_POS                         (0U)
#define DCU_FLAGCLR_CLR_OP                             ((uint32_t)0x00000001U)
#define DCU_FLAGCLR_CLR_LS2_POS                        (1U)
#define DCU_FLAGCLR_CLR_LS2                            ((uint32_t)0x00000002U)
#define DCU_FLAGCLR_CLR_EQ2_POS                        (2U)
#define DCU_FLAGCLR_CLR_EQ2                            ((uint32_t)0x00000004U)
#define DCU_FLAGCLR_CLR_GT2_POS                        (3U)
#define DCU_FLAGCLR_CLR_GT2                            ((uint32_t)0x00000008U)
#define DCU_FLAGCLR_CLR_LS1_POS                        (4U)
#define DCU_FLAGCLR_CLR_LS1                            ((uint32_t)0x00000010U)
#define DCU_FLAGCLR_CLR_EQ1_POS                        (5U)
#define DCU_FLAGCLR_CLR_EQ1                            ((uint32_t)0x00000020U)
#define DCU_FLAGCLR_CLR_GT1_POS                        (6U)
#define DCU_FLAGCLR_CLR_GT1                            ((uint32_t)0x00000040U)

