levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for DCU_INTSEL register  */
#define DCU_INTSEL_INT_OP_POS                          (0U)
#define DCU_INTSEL_INT_OP                              ((uint32_t)0x00000001U)
#define DCU_INTSEL_INT_LS2_POS                         (1U)
#define DCU_INTSEL_INT_LS2                             ((uint32_t)0x00000002U)
#define DCU_INTSEL_INT_EQ2_POS                         (2U)
#define DCU_INTSEL_INT_EQ2                             ((uint32_t)0x00000004U)
#define DCU_INTSEL_INT_GT2_POS                         (3U)
#define DCU_INTSEL_INT_GT2                             ((uint32_t)0x00000008U)
#define DCU_INTSEL_INT_LS1_POS                         (4U)
#define DCU_INTSEL_INT_LS1                             ((uint32_t)0x00000010U)
#define DCU_INTSEL_INT_EQ1_POS                         (5U)
#define DCU_INTSEL_INT_EQ1                             ((uint32_t)0x00000020U)
#define DCU_INTSEL_INT_GT1_POS                         (6U)
#define DCU_INTSEL_INT_GT1                             ((uint32_t)0x00000040U)
#define DCU_INTSEL_INT_WIN_POS                         (7U)
#define DCU_INTSEL_INT_WIN                             ((uint32_t)0x00000180U)
#define DCU_INTSEL_INT_WIN_0                           ((uint32_t)0x00000080U)
#define DCU_INTSEL_INT_WIN_1                           ((uint32_t)0x00000100U)


/*******************************************************************************
                Bit definition for Peripheral DMA
*******************************************************************************/
/*  Bit definition for DMA_EN register  */
#define DMA_EN_EN_POS                                  (0U)
#define DMA_EN_EN                                      ((uint32_t)0x00000001U)

/*  Bit definition for DMA_INTSTAT0 register  */
#define DMA_INTSTAT0_TRNERR_POS                        (0U)
#define DMA_INTSTAT0_TRNERR                            ((uint32_t)0x0000000FU)
#define DMA_INTSTAT0_TRNERR_0                          ((uint32_t)0x00000001U)
#define DMA_INTSTAT0_TRNERR_1                          ((uint32_t)0x00000002U)
#define DMA_INTSTAT0_TRNERR_2                          ((uint32_t)0x00000004U)
#define DMA_INTSTAT0_TRNERR_3                          ((uint32_t)0x00000008U)
#define DMA_INTSTAT0_REQERR_POS                        (16U)
#define DMA_INTSTAT0_REQERR                            ((uint32_t)0x000F0000U)
#define DMA_INTSTAT0_REQERR_0                          ((uint32_t)0x00010000U)
#define DMA_INTSTAT0_REQERR_1                          ((uint32_t)0x00020000U)
#define DMA_INTSTAT0_REQERR_2                          ((uint32_t)0x00040000U)
#define DMA_INTSTAT0_REQERR_3                          ((uint32_t)0x00080000U)

/*  Bit definition for DMA_INTSTAT1 register  */
#define DMA_INTSTAT1_TC_POS                            (0U)
#define DMA_INTSTAT1_TC                                ((uint32_t)0x0000000FU)
#define DMA_INTSTAT1_TC_0                              ((uint32_t)0x00000001U)
#define DMA_INTSTAT1_TC_1                              ((uint32_t)0x00000002U)
#define DMA_INTSTAT1_TC_2                              ((uint32_t)0x00000004U)
#define DMA_INTSTAT1_TC_3                              ((uint32_t)0x00000008U)
#define DMA_INTSTAT1_BTC_POS                           (16U)
#define DMA_INTSTAT1_BTC                               ((uint32_t)0x000F0000U)
#define DMA_INTSTAT1_BTC_0                             ((uint32_t)0x00010000U)
#define DMA_INTSTAT1_BTC_1                             ((uint32_t)0x00020000U)
#define DMA_INTSTAT1_BTC_2                             ((uint32_t)0x00040000U)
#define DMA_INTSTAT1_BTC_3                             ((uint32_t)0x00080000U)

/*  Bit definition for DMA_INTMASK0 register  */
#define DMA_INTMASK0_MSKTRNERR_POS                     (0U)
#define DMA_INTMASK0_MSKTRNERR                         ((uint32_t)0x0000000FU)
#define DMA_INTMASK0_MSKTRNERR_0                       ((uint32_t)0x00000001U)
#define DMA_INTMASK0_MSKTRNERR_1                       ((uint32_t)0x00000002U)
#define DMA_INTMASK0_MSKTRNERR_2                       ((uint32_t)0x00000004U)
#define DMA_INTMASK0_MSKTRNERR_3                       ((uint32_t)0x00000008U)
#define DMA_INTMASK0_MSKREQERR_POS                     (16U)
#define DMA_INTMASK0_MSKREQERR                         ((uint32_t)0x000F0000U)
#define DMA_INTMASK0_MSKREQERR_0                       ((uint32_t)0x00010000U)
#define DMA_INTMASK0_MSKREQERR_1                       ((uint32_t)0x00020000U)
#define DMA_INTMASK0_MSKREQERR_2                       ((uint32_t)0x00040000U)
#define DMA_INTMASK0_MSKREQERR_3                       ((uint32_t)0x00080000U)

/*  Bit definition for DMA_INTMASK1 register  */
#define DMA_INTMASK1_MSKTC_POS                         (0U)
#define DMA_INTMASK1_MSKTC                             ((uint32_t)0x0000000FU)
#define DMA_INTMASK1_MSKTC_0                           ((uint32_t)0x00000001U)
#define DMA_INTMASK1_MSKTC_1                           ((uint32_t)0x00000002U)
#define DMA_INTMASK1_MSKTC_2                           ((uint32_t)0x00000004U)
#define DMA_INTMASK1_MSKTC_3                           ((uint32_t)0x00000008U)
#define DMA_INTMASK1_MSKBTC_POS                        (16U)
#define DMA_INTMASK1_MSKBTC                            ((uint32_t)0x000F0000U)
#define DMA_INTMASK1_MSKBTC_0                          ((uint32_t)0x00010000U)
#define DMA_INTMASK1_MSKBTC_1                          ((uint32_t)0x00020000U)
#define DMA_INTMASK1_MSKBTC_2                          ((uint32_t)0x00040000U)
#define DMA_INTMASK1_MSKBTC_3                          ((uint32_t)0x00080000U)

/*  Bit definition for DMA_INTCLR0 register  */
#define DMA_INTCLR0_CLRTRNERR_POS                      (0U)
#define DMA_INTCLR0_CLRTRNERR                          ((uint32_t)0x0000000FU)
#define DMA_INTCLR0_CLRTRNERR_0                        ((uint32_t)0x00000001U)
#define DMA_INTCLR0_CLRTRNERR_1                        ((uint32_t)0x00000002U)
#define DMA_INTCLR0_CLRTRNERR_2                        ((uint32_t)0x00000004U)
#define DMA_INTCLR0_CLRTRNERR_3                        ((uint32_t)0x00000008U)
#define DMA_INTCLR0_CLRREQERR_POS                      (16U)
#define DMA_INTCLR0_CLRREQERR                          ((uint32_t)0x000F0000U)
#define DMA_INTCLR0_CLRREQERR_0                        ((uint32_t)0x00010000U)
#define DMA_INTCLR0_CLRREQERR_1                        ((uint32_t)0x00020000U)
#define DMA_INTCLR0_CLRREQERR_2                        ((uint32_t)0x00040000U)
#define DMA_INTCLR0_CLRREQERR_3                        ((uint32_t)0x00080000U)

