levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for DMA_INTCLR1 register  */
#define DMA_INTCLR1_CLRTC_POS                          (0U)
#define DMA_INTCLR1_CLRTC                              ((uint32_t)0x0000000FU)
#define DMA_INTCLR1_CLRTC_0                            ((uint32_t)0x00000001U)
#define DMA_INTCLR1_CLRTC_1                            ((uint32_t)0x00000002U)
#define DMA_INTCLR1_CLRTC_2                            ((uint32_t)0x00000004U)
#define DMA_INTCLR1_CLRTC_3                            ((uint32_t)0x00000008U)
#define DMA_INTCLR1_CLRBTC_POS                         (16U)
#define DMA_INTCLR1_CLRBTC                             ((uint32_t)0x000F0000U)
#define DMA_INTCLR1_CLRBTC_0                           ((uint32_t)0x00010000U)
#define DMA_INTCLR1_CLRBTC_1                           ((uint32_t)0x00020000U)
#define DMA_INTCLR1_CLRBTC_2                           ((uint32_t)0x00040000U)
#define DMA_INTCLR1_CLRBTC_3                           ((uint32_t)0x00080000U)

/*  Bit definition for DMA_CHEN register  */
#define DMA_CHEN_CHEN_POS                              (0U)
#define DMA_CHEN_CHEN                                  ((uint32_t)0x0000000FU)
#define DMA_CHEN_CHEN_0                                ((uint32_t)0x00000001U)
#define DMA_CHEN_CHEN_1                                ((uint32_t)0x00000002U)
#define DMA_CHEN_CHEN_2                                ((uint32_t)0x00000004U)
#define DMA_CHEN_CHEN_3                                ((uint32_t)0x00000008U)

/*  Bit definition for DMA_CHSTAT register  */
#define DMA_CHSTAT_DMAACT_POS                          (0U)
#define DMA_CHSTAT_DMAACT                              ((uint32_t)0x00000001U)
#define DMA_CHSTAT_CHACT_POS                           (16U)
#define DMA_CHSTAT_CHACT                               ((uint32_t)0x000F0000U)
#define DMA_CHSTAT_CHACT_0                             ((uint32_t)0x00010000U)
#define DMA_CHSTAT_CHACT_1                             ((uint32_t)0x00020000U)
#define DMA_CHSTAT_CHACT_2                             ((uint32_t)0x00040000U)
#define DMA_CHSTAT_CHACT_3                             ((uint32_t)0x00080000U)

/*  Bit definition for DMA_RAM_LLP register  */
#define DMA_RAM_LLP_LLP_POS                            (14U)
#define DMA_RAM_LLP_LLP                                ((uint32_t)0xFFFFC000U)
#define DMA_RAM_LLP_LLP_0                              ((uint32_t)0x00004000U)
#define DMA_RAM_LLP_LLP_1                              ((uint32_t)0x00008000U)
#define DMA_RAM_LLP_LLP_2                              ((uint32_t)0x00010000U)
#define DMA_RAM_LLP_LLP_3                              ((uint32_t)0x00020000U)
#define DMA_RAM_LLP_LLP_4                              ((uint32_t)0x00040000U)
#define DMA_RAM_LLP_LLP_5                              ((uint32_t)0x00080000U)
#define DMA_RAM_LLP_LLP_6                              ((uint32_t)0x00100000U)
#define DMA_RAM_LLP_LLP_7                              ((uint32_t)0x00200000U)
#define DMA_RAM_LLP_LLP_8                              ((uint32_t)0x00400000U)
#define DMA_RAM_LLP_LLP_9                              ((uint32_t)0x00800000U)
#define DMA_RAM_LLP_LLP_10                             ((uint32_t)0x01000000U)
#define DMA_RAM_LLP_LLP_11                             ((uint32_t)0x02000000U)
#define DMA_RAM_LLP_LLP_12                             ((uint32_t)0x04000000U)
#define DMA_RAM_LLP_LLP_13                             ((uint32_t)0x08000000U)
#define DMA_RAM_LLP_LLP_14                             ((uint32_t)0x10000000U)
#define DMA_RAM_LLP_LLP_15                             ((uint32_t)0x20000000U)
#define DMA_RAM_LLP_LLP_16                             ((uint32_t)0x40000000U)
#define DMA_RAM_LLP_LLP_17                             ((uint32_t)0x80000000U)

/*  Bit definition for DMA_ROM_LLP register  */
#define DMA_ROM_LLP_LLP_POS                            (14U)
#define DMA_ROM_LLP_LLP                                ((uint32_t)0xFFFFC000U)
#define DMA_ROM_LLP_LLP_0                              ((uint32_t)0x00004000U)
#define DMA_ROM_LLP_LLP_1                              ((uint32_t)0x00008000U)
#define DMA_ROM_LLP_LLP_2                              ((uint32_t)0x00010000U)
#define DMA_ROM_LLP_LLP_3                              ((uint32_t)0x00020000U)
#define DMA_ROM_LLP_LLP_4                              ((uint32_t)0x00040000U)
#define DMA_ROM_LLP_LLP_5                              ((uint32_t)0x00080000U)
#define DMA_ROM_LLP_LLP_6                              ((uint32_t)0x00100000U)
#define DMA_ROM_LLP_LLP_7                              ((uint32_t)0x00200000U)
#define DMA_ROM_LLP_LLP_8                              ((uint32_t)0x00400000U)
#define DMA_ROM_LLP_LLP_9                              ((uint32_t)0x00800000U)
#define DMA_ROM_LLP_LLP_10                             ((uint32_t)0x01000000U)
#define DMA_ROM_LLP_LLP_11                             ((uint32_t)0x02000000U)
#define DMA_ROM_LLP_LLP_12                             ((uint32_t)0x04000000U)
#define DMA_ROM_LLP_LLP_13                             ((uint32_t)0x08000000U)
#define DMA_ROM_LLP_LLP_14                             ((uint32_t)0x10000000U)
#define DMA_ROM_LLP_LLP_15                             ((uint32_t)0x20000000U)
#define DMA_ROM_LLP_LLP_16                             ((uint32_t)0x40000000U)
#define DMA_ROM_LLP_LLP_17                             ((uint32_t)0x80000000U)

/*  Bit definition for DMA_CHENCLR register  */
#define DMA_CHENCLR_CHENCLR_POS                        (0U)
#define DMA_CHENCLR_CHENCLR                            ((uint32_t)0x0000000FU)
#define DMA_CHENCLR_CHENCLR_0                          ((uint32_t)0x00000001U)
#define DMA_CHENCLR_CHENCLR_1                          ((uint32_t)0x00000002U)
#define DMA_CHENCLR_CHENCLR_2                          ((uint32_t)0x00000004U)
#define DMA_CHENCLR_CHENCLR_3                          ((uint32_t)0x00000008U)

/*  Bit definition for DMA_SAR0 register  */
#define DMA_SAR0                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DMA_DAR0 register  */
#define DMA_DAR0                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for DMA_CH0CTL0 register  */
#define DMA_CH0CTL0_BLKSIZE_POS                        (0U)
#define DMA_CH0CTL0_BLKSIZE                            ((uint32_t)0x000000FFU)
#define DMA_CH0CTL0_BLKSIZE_0                          ((uint32_t)0x00000001U)
#define DMA_CH0CTL0_BLKSIZE_1                          ((uint32_t)0x00000002U)
#define DMA_CH0CTL0_BLKSIZE_2                          ((uint32_t)0x00000004U)
#define DMA_CH0CTL0_BLKSIZE_3                          ((uint32_t)0x00000008U)
#define DMA_CH0CTL0_BLKSIZE_4                          ((uint32_t)0x00000010U)
#define DMA_CH0CTL0_BLKSIZE_5                          ((uint32_t)0x00000020U)
#define DMA_CH0CTL0_BLKSIZE_6                          ((uint32_t)0x00000040U)
#define DMA_CH0CTL0_BLKSIZE_7                          ((uint32_t)0x00000080U)
#define DMA_CH0CTL0_CNT_POS                            (8U)
#define DMA_CH0CTL0_CNT                                ((uint32_t)0x0003FF00U)
#define DMA_CH0CTL0_CNT_0                              ((uint32_t)0x00000100U)
#define DMA_CH0CTL0_CNT_1                              ((uint32_t)0x00000200U)
#define DMA_CH0CTL0_CNT_2                              ((uint32_t)0x00000400U)
#define DMA_CH0CTL0_CNT_3                              ((uint32_t)0x00000800U)
#define DMA_CH0CTL0_CNT_4                              ((uint32_t)0x00001000U)
#define DMA_CH0CTL0_CNT_5                              ((uint32_t)0x00002000U)
#define DMA_CH0CTL0_CNT_6                              ((uint32_t)0x00004000U)
#define DMA_CH0CTL0_CNT_7                              ((uint32_t)0x00008000U)
#define DMA_CH0CTL0_CNT_8                              ((uint32_t)0x00010000U)
#define DMA_CH0CTL0_CNT_9                              ((uint32_t)0x00020000U)
#define DMA_CH0CTL0_LLP_POS                            (18U)
#define DMA_CH0CTL0_LLP                                ((uint32_t)0x0FFC0000U)
#define DMA_CH0CTL0_LLP_0                              ((uint32_t)0x00040000U)
#define DMA_CH0CTL0_LLP_1                              ((uint32_t)0x00080000U)
#define DMA_CH0CTL0_LLP_2                              ((uint32_t)0x00100000U)
#define DMA_CH0CTL0_LLP_3                              ((uint32_t)0x00200000U)
#define DMA_CH0CTL0_LLP_4                              ((uint32_t)0x00400000U)
#define DMA_CH0CTL0_LLP_5                              ((uint32_t)0x00800000U)
#define DMA_CH0CTL0_LLP_6                              ((uint32_t)0x01000000U)
#define DMA_CH0CTL0_LLP_7                              ((uint32_t)0x02000000U)
#define DMA_CH0CTL0_LLP_8                              ((uint32_t)0x04000000U)
#define DMA_CH0CTL0_LLP_9                              ((uint32_t)0x08000000U)
#define DMA_CH0CTL0_LLPEN_POS                          (28U)
#define DMA_CH0CTL0_LLPEN                              ((uint32_t)0x10000000U)
#define DMA_CH0CTL0_LLPRUN_POS                         (29U)
#define DMA_CH0CTL0_LLPRUN                             ((uint32_t)0x20000000U)
#define DMA_CH0CTL0_HSIZE_POS                          (30U)
#define DMA_CH0CTL0_HSIZE                              ((uint32_t)0xC0000000U)
#define DMA_CH0CTL0_HSIZE_0                            ((uint32_t)0x40000000U)
#define DMA_CH0CTL0_HSIZE_1                            ((uint32_t)0x80000000U)

