levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*******************************************************************************
                Bit definition for Peripheral EFM
*******************************************************************************/
/*  Bit definition for EFM_FAPRT register  */
#define EFM_FAPRT_FAPRT_POS                            (0U)
#define EFM_FAPRT_FAPRT                                ((uint32_t)0x0000FFFFU)
#define EFM_FAPRT_FAPRT_0                              ((uint32_t)0x00000001U)
#define EFM_FAPRT_FAPRT_1                              ((uint32_t)0x00000002U)
#define EFM_FAPRT_FAPRT_2                              ((uint32_t)0x00000004U)
#define EFM_FAPRT_FAPRT_3                              ((uint32_t)0x00000008U)
#define EFM_FAPRT_FAPRT_4                              ((uint32_t)0x00000010U)
#define EFM_FAPRT_FAPRT_5                              ((uint32_t)0x00000020U)
#define EFM_FAPRT_FAPRT_6                              ((uint32_t)0x00000040U)
#define EFM_FAPRT_FAPRT_7                              ((uint32_t)0x00000080U)
#define EFM_FAPRT_FAPRT_8                              ((uint32_t)0x00000100U)
#define EFM_FAPRT_FAPRT_9                              ((uint32_t)0x00000200U)
#define EFM_FAPRT_FAPRT_10                             ((uint32_t)0x00000400U)
#define EFM_FAPRT_FAPRT_11                             ((uint32_t)0x00000800U)
#define EFM_FAPRT_FAPRT_12                             ((uint32_t)0x00001000U)
#define EFM_FAPRT_FAPRT_13                             ((uint32_t)0x00002000U)
#define EFM_FAPRT_FAPRT_14                             ((uint32_t)0x00004000U)
#define EFM_FAPRT_FAPRT_15                             ((uint32_t)0x00008000U)

/*  Bit definition for EFM_FSTP register  */
#define EFM_FSTP_FSTP_POS                              (0U)
#define EFM_FSTP_FSTP                                  ((uint32_t)0x00000001U)

/*  Bit definition for EFM_FRMC register  */
#define EFM_FRMC_FLWT_POS                              (0U)
#define EFM_FRMC_FLWT                                  ((uint32_t)0x00000007U)
#define EFM_FRMC_FLWT_0                                ((uint32_t)0x00000001U)
#define EFM_FRMC_FLWT_1                                ((uint32_t)0x00000002U)
#define EFM_FRMC_FLWT_2                                ((uint32_t)0x00000004U)
#define EFM_FRMC_ICHE_POS                              (16U)
#define EFM_FRMC_ICHE                                  ((uint32_t)0x00010000U)
#define EFM_FRMC_DCHE_POS                              (17U)
#define EFM_FRMC_DCHE                                  ((uint32_t)0x00020000U)
#define EFM_FRMC_CRST_POS                              (19U)
#define EFM_FRMC_CRST                                  ((uint32_t)0x00080000U)

/*  Bit definition for EFM_FWMC register  */
#define EFM_FWMC_PEMODE_POS                            (0U)
#define EFM_FWMC_PEMODE                                ((uint32_t)0x00000001U)
#define EFM_FWMC_PEMOD_POS                             (4U)
#define EFM_FWMC_PEMOD                                 ((uint32_t)0x00000070U)
#define EFM_FWMC_PEMOD_0                               ((uint32_t)0x00000010U)
#define EFM_FWMC_PEMOD_1                               ((uint32_t)0x00000020U)
#define EFM_FWMC_PEMOD_2                               ((uint32_t)0x00000040U)
#define EFM_FWMC_BUSHLDCTL_POS                         (8U)
#define EFM_FWMC_BUSHLDCTL                             ((uint32_t)0x00000100U)

/*  Bit definition for EFM_FSR register  */
#define EFM_FSR_PEWERR_POS                             (0U)
#define EFM_FSR_PEWERR                                 ((uint32_t)0x00000001U)
#define EFM_FSR_PEPRTERR_POS                           (1U)
#define EFM_FSR_PEPRTERR                               ((uint32_t)0x00000002U)
#define EFM_FSR_PGMISMTCH_POS                          (3U)
#define EFM_FSR_PGMISMTCH                              ((uint32_t)0x00000008U)
#define EFM_FSR_OPTEND_POS                             (4U)
#define EFM_FSR_OPTEND                                 ((uint32_t)0x00000010U)
#define EFM_FSR_RDCOLERR_POS                           (5U)
#define EFM_FSR_RDCOLERR                               ((uint32_t)0x00000020U)
#define EFM_FSR_RDY_POS                                (8U)
#define EFM_FSR_RDY                                    ((uint32_t)0x00000100U)

/*  Bit definition for EFM_FSCLR register  */
#define EFM_FSCLR_PEWERRCLR_POS                        (0U)
#define EFM_FSCLR_PEWERRCLR                            ((uint32_t)0x00000001U)
#define EFM_FSCLR_PEPRTERRCLR_POS                      (1U)
#define EFM_FSCLR_PEPRTERRCLR                          ((uint32_t)0x00000002U)
#define EFM_FSCLR_PGMISMTCHCLR_POS                     (3U)
#define EFM_FSCLR_PGMISMTCHCLR                         ((uint32_t)0x00000008U)
#define EFM_FSCLR_OPTENDCLR_POS                        (4U)
#define EFM_FSCLR_OPTENDCLR                            ((uint32_t)0x00000010U)
#define EFM_FSCLR_RDCOLERRCLR_POS                      (5U)
#define EFM_FSCLR_RDCOLERRCLR                          ((uint32_t)0x00000020U)

/*  Bit definition for EFM_FITE register  */
#define EFM_FITE_PEERRITE_POS                          (0U)
#define EFM_FITE_PEERRITE                              ((uint32_t)0x00000001U)
#define EFM_FITE_OPTENDITE_POS                         (1U)
#define EFM_FITE_OPTENDITE                             ((uint32_t)0x00000002U)
#define EFM_FITE_RDCOLERRITE_POS                       (2U)
#define EFM_FITE_RDCOLERRITE                           ((uint32_t)0x00000004U)

/*  Bit definition for EFM_FPMTSW register  */
#define EFM_FPMTSW_FPMTSW_POS                          (0U)
#define EFM_FPMTSW_FPMTSW                              ((uint32_t)0x0001FFFFU)
#define EFM_FPMTSW_FPMTSW_0                            ((uint32_t)0x00000001U)
#define EFM_FPMTSW_FPMTSW_1                            ((uint32_t)0x00000002U)
#define EFM_FPMTSW_FPMTSW_2                            ((uint32_t)0x00000004U)
#define EFM_FPMTSW_FPMTSW_3                            ((uint32_t)0x00000008U)
#define EFM_FPMTSW_FPMTSW_4                            ((uint32_t)0x00000010U)
#define EFM_FPMTSW_FPMTSW_5                            ((uint32_t)0x00000020U)
#define EFM_FPMTSW_FPMTSW_6                            ((uint32_t)0x00000040U)
#define EFM_FPMTSW_FPMTSW_7                            ((uint32_t)0x00000080U)
#define EFM_FPMTSW_FPMTSW_8                            ((uint32_t)0x00000100U)
#define EFM_FPMTSW_FPMTSW_9                            ((uint32_t)0x00000200U)
#define EFM_FPMTSW_FPMTSW_10                           ((uint32_t)0x00000400U)
#define EFM_FPMTSW_FPMTSW_11                           ((uint32_t)0x00000800U)
#define EFM_FPMTSW_FPMTSW_12                           ((uint32_t)0x00001000U)
#define EFM_FPMTSW_FPMTSW_13                           ((uint32_t)0x00002000U)
#define EFM_FPMTSW_FPMTSW_14                           ((uint32_t)0x00004000U)
#define EFM_FPMTSW_FPMTSW_15                           ((uint32_t)0x00008000U)
#define EFM_FPMTSW_FPMTSW_16                           ((uint32_t)0x00010000U)

/*  Bit definition for EFM_FPMTEW register  */
#define EFM_FPMTEW_FPMTEW_POS                          (0U)
#define EFM_FPMTEW_FPMTEW                              ((uint32_t)0x0001FFFFU)
#define EFM_FPMTEW_FPMTEW_0                            ((uint32_t)0x00000001U)
#define EFM_FPMTEW_FPMTEW_1                            ((uint32_t)0x00000002U)
#define EFM_FPMTEW_FPMTEW_2                            ((uint32_t)0x00000004U)
#define EFM_FPMTEW_FPMTEW_3                            ((uint32_t)0x00000008U)
#define EFM_FPMTEW_FPMTEW_4                            ((uint32_t)0x00000010U)
#define EFM_FPMTEW_FPMTEW_5                            ((uint32_t)0x00000020U)
#define EFM_FPMTEW_FPMTEW_6                            ((uint32_t)0x00000040U)
#define EFM_FPMTEW_FPMTEW_7                            ((uint32_t)0x00000080U)
#define EFM_FPMTEW_FPMTEW_8                            ((uint32_t)0x00000100U)
#define EFM_FPMTEW_FPMTEW_9                            ((uint32_t)0x00000200U)
#define EFM_FPMTEW_FPMTEW_10                           ((uint32_t)0x00000400U)
#define EFM_FPMTEW_FPMTEW_11                           ((uint32_t)0x00000800U)
#define EFM_FPMTEW_FPMTEW_12                           ((uint32_t)0x00001000U)
#define EFM_FPMTEW_FPMTEW_13                           ((uint32_t)0x00002000U)
#define EFM_FPMTEW_FPMTEW_14                           ((uint32_t)0x00004000U)
#define EFM_FPMTEW_FPMTEW_15                           ((uint32_t)0x00008000U)
#define EFM_FPMTEW_FPMTEW_16                           ((uint32_t)0x00010000U)

/*  Bit definition for EFM_UQID0 register  */
#define EFM_UQID0                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for EFM_UQID1 register  */
#define EFM_UQID1                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for EFM_UQID2 register  */
#define EFM_UQID2                                      ((uint32_t)0xFFFFFFFFU)

