levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for EFM_UQID3 register  */
#define EFM_UQID3                                      ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for EFM_HRCCFGR register  */
#define EFM_HRCCFGR_HRCFREQS_POS                       (0U)
#define EFM_HRCCFGR_HRCFREQS                           ((uint8_t)0x0FU)
#define EFM_HRCCFGR_HRCFREQS_0                         ((uint8_t)0x01U)
#define EFM_HRCCFGR_HRCFREQS_1                         ((uint8_t)0x02U)
#define EFM_HRCCFGR_HRCFREQS_2                         ((uint8_t)0x04U)
#define EFM_HRCCFGR_HRCFREQS_3                         ((uint8_t)0x08U)


/*******************************************************************************
                Bit definition for Peripheral EMB
*******************************************************************************/
/*  Bit definition for EMB_CTL0 register  */
#define EMB_CTL0_CMPEN_POS                             (0U)
#define EMB_CTL0_CMPEN                                 ((uint32_t)0x00000007U)
#define EMB_CTL0_CMPEN_0                               ((uint32_t)0x00000001U)
#define EMB_CTL0_CMPEN_1                               ((uint32_t)0x00000002U)
#define EMB_CTL0_CMPEN_2                               ((uint32_t)0x00000004U)
#define EMB_CTL0_OSCSTPEN_POS                          (4U)
#define EMB_CTL0_OSCSTPEN                              ((uint32_t)0x00000010U)
#define EMB_CTL0_PWMSEN0_POS                           (5U)
#define EMB_CTL0_PWMSEN0                               ((uint32_t)0x00000020U)
#define EMB_CTL0_PWMSEN1_POS                           (6U)
#define EMB_CTL0_PWMSEN1                               ((uint32_t)0x00000040U)
#define EMB_CTL0_PWMSEN2_POS                           (7U)
#define EMB_CTL0_PWMSEN2                               ((uint32_t)0x00000080U)
#define EMB_CTL0_PORTINEN0_POS                         (8U)
#define EMB_CTL0_PORTINEN0                             ((uint32_t)0x00000100U)
#define EMB_CTL0_PORTINEN1_POS                         (9U)
#define EMB_CTL0_PORTINEN1                             ((uint32_t)0x00000200U)
#define EMB_CTL0_PORTINEN2_POS                         (10U)
#define EMB_CTL0_PORTINEN2                             ((uint32_t)0x00000400U)
#define EMB_CTL0_NFSEL0_POS                            (16U)
#define EMB_CTL0_NFSEL0                                ((uint32_t)0x00030000U)
#define EMB_CTL0_NFSEL0_0                              ((uint32_t)0x00010000U)
#define EMB_CTL0_NFSEL0_1                              ((uint32_t)0x00020000U)
#define EMB_CTL0_NFEN0_POS                             (18U)
#define EMB_CTL0_NFEN0                                 ((uint32_t)0x00040000U)
#define EMB_CTL0_INVSEL0_POS                           (19U)
#define EMB_CTL0_INVSEL0                               ((uint32_t)0x00080000U)
#define EMB_CTL0_NFSEL1_POS                            (20U)
#define EMB_CTL0_NFSEL1                                ((uint32_t)0x00300000U)
#define EMB_CTL0_NFSEL1_0                              ((uint32_t)0x00100000U)
#define EMB_CTL0_NFSEL1_1                              ((uint32_t)0x00200000U)
#define EMB_CTL0_NFEN1_POS                             (22U)
#define EMB_CTL0_NFEN1                                 ((uint32_t)0x00400000U)
#define EMB_CTL0_INVSEL1_POS                           (23U)
#define EMB_CTL0_INVSEL1                               ((uint32_t)0x00800000U)
#define EMB_CTL0_NFSEL2_POS                            (24U)
#define EMB_CTL0_NFSEL2                                ((uint32_t)0x03000000U)
#define EMB_CTL0_NFSEL2_0                              ((uint32_t)0x01000000U)
#define EMB_CTL0_NFSEL2_1                              ((uint32_t)0x02000000U)
#define EMB_CTL0_NFEN2_POS                             (26U)
#define EMB_CTL0_NFEN2                                 ((uint32_t)0x04000000U)
#define EMB_CTL0_INVSEL2_POS                           (27U)
#define EMB_CTL0_INVSEL2                               ((uint32_t)0x08000000U)

/*  Bit definition for EMB_PWMLV0 register  */
#define EMB_PWMLV0_PWMLV_POS                           (0U)
#define EMB_PWMLV0_PWMLV                               ((uint32_t)0x00000007U)
#define EMB_PWMLV0_PWMLV_0                             ((uint32_t)0x00000001U)
#define EMB_PWMLV0_PWMLV_1                             ((uint32_t)0x00000002U)
#define EMB_PWMLV0_PWMLV_2                             ((uint32_t)0x00000004U)

/*  Bit definition for EMB_SOE0 register  */
#define EMB_SOE0_SOE_POS                               (0U)
#define EMB_SOE0_SOE                                   ((uint32_t)0x00000001U)

/*  Bit definition for EMB_STAT0 register  */
#define EMB_STAT0_PWMSF_POS                            (0U)
#define EMB_STAT0_PWMSF                                ((uint32_t)0x00000001U)
#define EMB_STAT0_CMPF_POS                             (1U)
#define EMB_STAT0_CMPF                                 ((uint32_t)0x00000002U)
#define EMB_STAT0_OSF_POS                              (2U)
#define EMB_STAT0_OSF                                  ((uint32_t)0x00000004U)
#define EMB_STAT0_PWMST_POS                            (3U)
#define EMB_STAT0_PWMST                                ((uint32_t)0x00000008U)
#define EMB_STAT0_PORTINF0_POS                         (8U)
#define EMB_STAT0_PORTINF0                             ((uint32_t)0x00000100U)
#define EMB_STAT0_PORTINF1_POS                         (9U)
#define EMB_STAT0_PORTINF1                             ((uint32_t)0x00000200U)
#define EMB_STAT0_PORTINF2_POS                         (10U)
#define EMB_STAT0_PORTINF2                             ((uint32_t)0x00000400U)
#define EMB_STAT0_PORTINST0_POS                        (12U)
#define EMB_STAT0_PORTINST0                            ((uint32_t)0x00001000U)
#define EMB_STAT0_PORTINST1_POS                        (13U)
#define EMB_STAT0_PORTINST1                            ((uint32_t)0x00002000U)
#define EMB_STAT0_PORTINST2_POS                        (14U)
#define EMB_STAT0_PORTINST2                            ((uint32_t)0x00004000U)

/*  Bit definition for EMB_STATCLR0 register  */
#define EMB_STATCLR0_PWMSFCLR_POS                      (0U)
#define EMB_STATCLR0_PWMSFCLR                          ((uint32_t)0x00000001U)
#define EMB_STATCLR0_CMPFCLR_POS                       (1U)
#define EMB_STATCLR0_CMPFCLR                           ((uint32_t)0x00000002U)
#define EMB_STATCLR0_OSFCLR_POS                        (2U)
#define EMB_STATCLR0_OSFCLR                            ((uint32_t)0x00000004U)
#define EMB_STATCLR0_PORTINFCLR0_POS                   (8U)
#define EMB_STATCLR0_PORTINFCLR0                       ((uint32_t)0x00000100U)
#define EMB_STATCLR0_PORTINFCLR1_POS                   (9U)
#define EMB_STATCLR0_PORTINFCLR1                       ((uint32_t)0x00000200U)
#define EMB_STATCLR0_PORTINFCLR2_POS                   (10U)
#define EMB_STATCLR0_PORTINFCLR2                       ((uint32_t)0x00000400U)

