levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for EMB_INTEN0 register  */
#define EMB_INTEN0_PWMINTEN_POS                        (0U)
#define EMB_INTEN0_PWMINTEN                            ((uint32_t)0x00000001U)
#define EMB_INTEN0_CMPINTEN_POS                        (1U)
#define EMB_INTEN0_CMPINTEN                            ((uint32_t)0x00000002U)
#define EMB_INTEN0_OSINTEN_POS                         (2U)
#define EMB_INTEN0_OSINTEN                             ((uint32_t)0x00000004U)
#define EMB_INTEN0_PORTININTEN0_POS                    (8U)
#define EMB_INTEN0_PORTININTEN0                        ((uint32_t)0x00000100U)
#define EMB_INTEN0_PORTININTEN1_POS                    (9U)
#define EMB_INTEN0_PORTININTEN1                        ((uint32_t)0x00000200U)
#define EMB_INTEN0_PORTININTEN2_POS                    (10U)
#define EMB_INTEN0_PORTININTEN2                        ((uint32_t)0x00000400U)

/*  Bit definition for EMB_CTL1 register  */
#define EMB_CTL1_CMPEN_POS                             (0U)
#define EMB_CTL1_CMPEN                                 ((uint32_t)0x00000007U)
#define EMB_CTL1_CMPEN_0                               ((uint32_t)0x00000001U)
#define EMB_CTL1_CMPEN_1                               ((uint32_t)0x00000002U)
#define EMB_CTL1_CMPEN_2                               ((uint32_t)0x00000004U)
#define EMB_CTL1_OSCSTPEN_POS                          (4U)
#define EMB_CTL1_OSCSTPEN                              ((uint32_t)0x00000010U)
#define EMB_CTL1_PORTINEN0_POS                         (8U)
#define EMB_CTL1_PORTINEN0                             ((uint32_t)0x00000100U)
#define EMB_CTL1_PORTINEN1_POS                         (9U)
#define EMB_CTL1_PORTINEN1                             ((uint32_t)0x00000200U)
#define EMB_CTL1_PORTINEN2_POS                         (10U)
#define EMB_CTL1_PORTINEN2                             ((uint32_t)0x00000400U)
#define EMB_CTL1_NFSEL0_POS                            (16U)
#define EMB_CTL1_NFSEL0                                ((uint32_t)0x00030000U)
#define EMB_CTL1_NFSEL0_0                              ((uint32_t)0x00010000U)
#define EMB_CTL1_NFSEL0_1                              ((uint32_t)0x00020000U)
#define EMB_CTL1_NFEN0_POS                             (18U)
#define EMB_CTL1_NFEN0                                 ((uint32_t)0x00040000U)
#define EMB_CTL1_INVSEL0_POS                           (19U)
#define EMB_CTL1_INVSEL0                               ((uint32_t)0x00080000U)
#define EMB_CTL1_NFSEL1_POS                            (20U)
#define EMB_CTL1_NFSEL1                                ((uint32_t)0x00300000U)
#define EMB_CTL1_NFSEL1_0                              ((uint32_t)0x00100000U)
#define EMB_CTL1_NFSEL1_1                              ((uint32_t)0x00200000U)
#define EMB_CTL1_NFEN1_POS                             (22U)
#define EMB_CTL1_NFEN1                                 ((uint32_t)0x00400000U)
#define EMB_CTL1_INVSEL1_POS                           (23U)
#define EMB_CTL1_INVSEL1                               ((uint32_t)0x00800000U)
#define EMB_CTL1_NFSEL2_POS                            (24U)
#define EMB_CTL1_NFSEL2                                ((uint32_t)0x03000000U)
#define EMB_CTL1_NFSEL2_0                              ((uint32_t)0x01000000U)
#define EMB_CTL1_NFSEL2_1                              ((uint32_t)0x02000000U)
#define EMB_CTL1_NFEN2_POS                             (26U)
#define EMB_CTL1_NFEN2                                 ((uint32_t)0x04000000U)
#define EMB_CTL1_INVSEL2_POS                           (27U)
#define EMB_CTL1_INVSEL2                               ((uint32_t)0x08000000U)

/*  Bit definition for EMB_SOE1 register  */
#define EMB_SOE1_SOE_POS                               (0U)
#define EMB_SOE1_SOE                                   ((uint32_t)0x00000001U)

/*  Bit definition for EMB_STAT1 register  */
#define EMB_STAT1_CMPF_POS                             (1U)
#define EMB_STAT1_CMPF                                 ((uint32_t)0x00000002U)
#define EMB_STAT1_OSF_POS                              (2U)
#define EMB_STAT1_OSF                                  ((uint32_t)0x00000004U)
#define EMB_STAT1_PORTINF0_POS                         (8U)
#define EMB_STAT1_PORTINF0                             ((uint32_t)0x00000100U)
#define EMB_STAT1_PORTINF1_POS                         (9U)
#define EMB_STAT1_PORTINF1                             ((uint32_t)0x00000200U)
#define EMB_STAT1_PORTINF2_POS                         (10U)
#define EMB_STAT1_PORTINF2                             ((uint32_t)0x00000400U)
#define EMB_STAT1_PORTINST0_POS                        (12U)
#define EMB_STAT1_PORTINST0                            ((uint32_t)0x00001000U)
#define EMB_STAT1_PORTINST1_POS                        (13U)
#define EMB_STAT1_PORTINST1                            ((uint32_t)0x00002000U)
#define EMB_STAT1_PORTINST2_POS                        (14U)
#define EMB_STAT1_PORTINST2                            ((uint32_t)0x00004000U)

/*  Bit definition for EMB_STATCLR1 register  */
#define EMB_STATCLR1_CMPFCLR_POS                       (1U)
#define EMB_STATCLR1_CMPFCLR                           ((uint32_t)0x00000002U)
#define EMB_STATCLR1_OSFCLR_POS                        (2U)
#define EMB_STATCLR1_OSFCLR                            ((uint32_t)0x00000004U)
#define EMB_STATCLR1_PORTINFCLR0_POS                   (8U)
#define EMB_STATCLR1_PORTINFCLR0                       ((uint32_t)0x00000100U)
#define EMB_STATCLR1_PORTINFCLR1_POS                   (9U)
#define EMB_STATCLR1_PORTINFCLR1                       ((uint32_t)0x00000200U)
#define EMB_STATCLR1_PORTINFCLR2_POS                   (10U)
#define EMB_STATCLR1_PORTINFCLR2                       ((uint32_t)0x00000400U)

/*  Bit definition for EMB_INTEN1 register  */
#define EMB_INTEN1_CMPINTEN_POS                        (1U)
#define EMB_INTEN1_CMPINTEN                            ((uint32_t)0x00000002U)
#define EMB_INTEN1_OSINTEN_POS                         (2U)
#define EMB_INTEN1_OSINTEN                             ((uint32_t)0x00000004U)
#define EMB_INTEN1_PORTININTEN0_POS                    (8U)
#define EMB_INTEN1_PORTININTEN0                        ((uint32_t)0x00000100U)
#define EMB_INTEN1_PORTININTEN1_POS                    (9U)
#define EMB_INTEN1_PORTININTEN1                        ((uint32_t)0x00000200U)
#define EMB_INTEN1_PORTININTEN2_POS                    (10U)
#define EMB_INTEN1_PORTININTEN2                        ((uint32_t)0x00000400U)

/*  Bit definition for EMB_ECSR register  */
#define EMB_ECSR_EMBVAL_POS                            (0U)
#define EMB_ECSR_EMBVAL                                ((uint32_t)0x00000003U)
#define EMB_ECSR_EMBVAL_0                              ((uint32_t)0x00000001U)
#define EMB_ECSR_EMBVAL_1                              ((uint32_t)0x00000002U)


