levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*******************************************************************************
                Bit definition for Peripheral FCM
*******************************************************************************/
/*  Bit definition for FCM_LVR register  */
#define FCM_LVR_LVR_POS                                (0U)
#define FCM_LVR_LVR                                    ((uint32_t)0x0000FFFFU)
#define FCM_LVR_LVR_0                                  ((uint32_t)0x00000001U)
#define FCM_LVR_LVR_1                                  ((uint32_t)0x00000002U)
#define FCM_LVR_LVR_2                                  ((uint32_t)0x00000004U)
#define FCM_LVR_LVR_3                                  ((uint32_t)0x00000008U)
#define FCM_LVR_LVR_4                                  ((uint32_t)0x00000010U)
#define FCM_LVR_LVR_5                                  ((uint32_t)0x00000020U)
#define FCM_LVR_LVR_6                                  ((uint32_t)0x00000040U)
#define FCM_LVR_LVR_7                                  ((uint32_t)0x00000080U)
#define FCM_LVR_LVR_8                                  ((uint32_t)0x00000100U)
#define FCM_LVR_LVR_9                                  ((uint32_t)0x00000200U)
#define FCM_LVR_LVR_10                                 ((uint32_t)0x00000400U)
#define FCM_LVR_LVR_11                                 ((uint32_t)0x00000800U)
#define FCM_LVR_LVR_12                                 ((uint32_t)0x00001000U)
#define FCM_LVR_LVR_13                                 ((uint32_t)0x00002000U)
#define FCM_LVR_LVR_14                                 ((uint32_t)0x00004000U)
#define FCM_LVR_LVR_15                                 ((uint32_t)0x00008000U)

/*  Bit definition for FCM_UVR register  */
#define FCM_UVR_UVR_POS                                (0U)
#define FCM_UVR_UVR                                    ((uint32_t)0x0000FFFFU)
#define FCM_UVR_UVR_0                                  ((uint32_t)0x00000001U)
#define FCM_UVR_UVR_1                                  ((uint32_t)0x00000002U)
#define FCM_UVR_UVR_2                                  ((uint32_t)0x00000004U)
#define FCM_UVR_UVR_3                                  ((uint32_t)0x00000008U)
#define FCM_UVR_UVR_4                                  ((uint32_t)0x00000010U)
#define FCM_UVR_UVR_5                                  ((uint32_t)0x00000020U)
#define FCM_UVR_UVR_6                                  ((uint32_t)0x00000040U)
#define FCM_UVR_UVR_7                                  ((uint32_t)0x00000080U)
#define FCM_UVR_UVR_8                                  ((uint32_t)0x00000100U)
#define FCM_UVR_UVR_9                                  ((uint32_t)0x00000200U)
#define FCM_UVR_UVR_10                                 ((uint32_t)0x00000400U)
#define FCM_UVR_UVR_11                                 ((uint32_t)0x00000800U)
#define FCM_UVR_UVR_12                                 ((uint32_t)0x00001000U)
#define FCM_UVR_UVR_13                                 ((uint32_t)0x00002000U)
#define FCM_UVR_UVR_14                                 ((uint32_t)0x00004000U)
#define FCM_UVR_UVR_15                                 ((uint32_t)0x00008000U)

/*  Bit definition for FCM_CNTR register  */
#define FCM_CNTR_CNTR_POS                              (0U)
#define FCM_CNTR_CNTR                                  ((uint32_t)0x0000FFFFU)
#define FCM_CNTR_CNTR_0                                ((uint32_t)0x00000001U)
#define FCM_CNTR_CNTR_1                                ((uint32_t)0x00000002U)
#define FCM_CNTR_CNTR_2                                ((uint32_t)0x00000004U)
#define FCM_CNTR_CNTR_3                                ((uint32_t)0x00000008U)
#define FCM_CNTR_CNTR_4                                ((uint32_t)0x00000010U)
#define FCM_CNTR_CNTR_5                                ((uint32_t)0x00000020U)
#define FCM_CNTR_CNTR_6                                ((uint32_t)0x00000040U)
#define FCM_CNTR_CNTR_7                                ((uint32_t)0x00000080U)
#define FCM_CNTR_CNTR_8                                ((uint32_t)0x00000100U)
#define FCM_CNTR_CNTR_9                                ((uint32_t)0x00000200U)
#define FCM_CNTR_CNTR_10                               ((uint32_t)0x00000400U)
#define FCM_CNTR_CNTR_11                               ((uint32_t)0x00000800U)
#define FCM_CNTR_CNTR_12                               ((uint32_t)0x00001000U)
#define FCM_CNTR_CNTR_13                               ((uint32_t)0x00002000U)
#define FCM_CNTR_CNTR_14                               ((uint32_t)0x00004000U)
#define FCM_CNTR_CNTR_15                               ((uint32_t)0x00008000U)

/*  Bit definition for FCM_STR register  */
#define FCM_STR_START_POS                              (0U)
#define FCM_STR_START                                  ((uint32_t)0x00000001U)

/*  Bit definition for FCM_MCCR register  */
#define FCM_MCCR_MDIVS_POS                             (0U)
#define FCM_MCCR_MDIVS                                 ((uint32_t)0x00000003U)
#define FCM_MCCR_MDIVS_0                               ((uint32_t)0x00000001U)
#define FCM_MCCR_MDIVS_1                               ((uint32_t)0x00000002U)
#define FCM_MCCR_MCKS_POS                              (4U)
#define FCM_MCCR_MCKS                                  ((uint32_t)0x000000F0U)
#define FCM_MCCR_MCKS_0                                ((uint32_t)0x00000010U)
#define FCM_MCCR_MCKS_1                                ((uint32_t)0x00000020U)
#define FCM_MCCR_MCKS_2                                ((uint32_t)0x00000040U)
#define FCM_MCCR_MCKS_3                                ((uint32_t)0x00000080U)

/*  Bit definition for FCM_RCCR register  */
#define FCM_RCCR_RDIVS_POS                             (0U)
#define FCM_RCCR_RDIVS                                 ((uint32_t)0x00000003U)
#define FCM_RCCR_RDIVS_0                               ((uint32_t)0x00000001U)
#define FCM_RCCR_RDIVS_1                               ((uint32_t)0x00000002U)
#define FCM_RCCR_RCKS_POS                              (3U)
#define FCM_RCCR_RCKS                                  ((uint32_t)0x00000078U)
#define FCM_RCCR_RCKS_0                                ((uint32_t)0x00000008U)
#define FCM_RCCR_RCKS_1                                ((uint32_t)0x00000010U)
#define FCM_RCCR_RCKS_2                                ((uint32_t)0x00000020U)
#define FCM_RCCR_RCKS_3                                ((uint32_t)0x00000040U)
#define FCM_RCCR_INEXS_POS                             (7U)
#define FCM_RCCR_INEXS                                 ((uint32_t)0x00000080U)
#define FCM_RCCR_DNFS_POS                              (8U)
#define FCM_RCCR_DNFS                                  ((uint32_t)0x00000300U)
#define FCM_RCCR_DNFS_0                                ((uint32_t)0x00000100U)
#define FCM_RCCR_DNFS_1                                ((uint32_t)0x00000200U)
#define FCM_RCCR_EDGES_POS                             (12U)
#define FCM_RCCR_EDGES                                 ((uint32_t)0x00003000U)
#define FCM_RCCR_EDGES_0                               ((uint32_t)0x00001000U)
#define FCM_RCCR_EDGES_1                               ((uint32_t)0x00002000U)
#define FCM_RCCR_EXREFE_POS                            (15U)
#define FCM_RCCR_EXREFE                                ((uint32_t)0x00008000U)

