levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for FCM_RIER register  */
#define FCM_RIER_ERRIE_POS                             (0U)
#define FCM_RIER_ERRIE                                 ((uint32_t)0x00000001U)
#define FCM_RIER_MENDIE_POS                            (1U)
#define FCM_RIER_MENDIE                                ((uint32_t)0x00000002U)
#define FCM_RIER_OVFIE_POS                             (2U)
#define FCM_RIER_OVFIE                                 ((uint32_t)0x00000004U)
#define FCM_RIER_ERRINTRS_POS                          (4U)
#define FCM_RIER_ERRINTRS                              ((uint32_t)0x00000010U)
#define FCM_RIER_ERRE_POS                              (7U)
#define FCM_RIER_ERRE                                  ((uint32_t)0x00000080U)

/*  Bit definition for FCM_SR register  */
#define FCM_SR_ERRF_POS                                (0U)
#define FCM_SR_ERRF                                    ((uint32_t)0x00000001U)
#define FCM_SR_MENDF_POS                               (1U)
#define FCM_SR_MENDF                                   ((uint32_t)0x00000002U)
#define FCM_SR_OVF_POS                                 (2U)
#define FCM_SR_OVF                                     ((uint32_t)0x00000004U)

/*  Bit definition for FCM_CLR register  */
#define FCM_CLR_ERRFCLR_POS                            (0U)
#define FCM_CLR_ERRFCLR                                ((uint32_t)0x00000001U)
#define FCM_CLR_MENDFCLR_POS                           (1U)
#define FCM_CLR_MENDFCLR                               ((uint32_t)0x00000002U)
#define FCM_CLR_OVFCLR_POS                             (2U)
#define FCM_CLR_OVFCLR                                 ((uint32_t)0x00000004U)


/*******************************************************************************
                Bit definition for Peripheral GPIO
*******************************************************************************/
/*  Bit definition for GPIO_PIDR register  */
#define GPIO_PIDR_PIN0_POS                             (0U)
#define GPIO_PIDR_PIN0                                 ((uint8_t)0x01U)
#define GPIO_PIDR_PIN1_POS                             (1U)
#define GPIO_PIDR_PIN1                                 ((uint8_t)0x02U)
#define GPIO_PIDR_PIN2_POS                             (2U)
#define GPIO_PIDR_PIN2                                 ((uint8_t)0x04U)
#define GPIO_PIDR_PIN3_POS                             (3U)
#define GPIO_PIDR_PIN3                                 ((uint8_t)0x08U)
#define GPIO_PIDR_PIN4_POS                             (4U)
#define GPIO_PIDR_PIN4                                 ((uint8_t)0x10U)
#define GPIO_PIDR_PIN5_POS                             (5U)
#define GPIO_PIDR_PIN5                                 ((uint8_t)0x20U)
#define GPIO_PIDR_PIN6_POS                             (6U)
#define GPIO_PIDR_PIN6                                 ((uint8_t)0x40U)
#define GPIO_PIDR_PIN7_POS                             (7U)
#define GPIO_PIDR_PIN7                                 ((uint8_t)0x80U)

/*  Bit definition for GPIO_PODR register  */
#define GPIO_PODR_POUT0_POS                            (0U)
#define GPIO_PODR_POUT0                                ((uint8_t)0x01U)
#define GPIO_PODR_POUT1_POS                            (1U)
#define GPIO_PODR_POUT1                                ((uint8_t)0x02U)
#define GPIO_PODR_POUT2_POS                            (2U)
#define GPIO_PODR_POUT2                                ((uint8_t)0x04U)
#define GPIO_PODR_POUT3_POS                            (3U)
#define GPIO_PODR_POUT3                                ((uint8_t)0x08U)
#define GPIO_PODR_POUT4_POS                            (4U)
#define GPIO_PODR_POUT4                                ((uint8_t)0x10U)
#define GPIO_PODR_POUT5_POS                            (5U)
#define GPIO_PODR_POUT5                                ((uint8_t)0x20U)
#define GPIO_PODR_POUT6_POS                            (6U)
#define GPIO_PODR_POUT6                                ((uint8_t)0x40U)
#define GPIO_PODR_POUT7_POS                            (7U)
#define GPIO_PODR_POUT7                                ((uint8_t)0x80U)

/*  Bit definition for GPIO_POER register  */
#define GPIO_POER_POUTE0_POS                           (0U)
#define GPIO_POER_POUTE0                               ((uint8_t)0x01U)
#define GPIO_POER_POUTE1_POS                           (1U)
#define GPIO_POER_POUTE1                               ((uint8_t)0x02U)
#define GPIO_POER_POUTE2_POS                           (2U)
#define GPIO_POER_POUTE2                               ((uint8_t)0x04U)
#define GPIO_POER_POUTE3_POS                           (3U)
#define GPIO_POER_POUTE3                               ((uint8_t)0x08U)
#define GPIO_POER_POUTE4_POS                           (4U)
#define GPIO_POER_POUTE4                               ((uint8_t)0x10U)
#define GPIO_POER_POUTE5_POS                           (5U)
#define GPIO_POER_POUTE5                               ((uint8_t)0x20U)
#define GPIO_POER_POUTE6_POS                           (6U)
#define GPIO_POER_POUTE6                               ((uint8_t)0x40U)
#define GPIO_POER_POUTE7_POS                           (7U)
#define GPIO_POER_POUTE7                               ((uint8_t)0x80U)

/*  Bit definition for GPIO_POSR register  */
#define GPIO_POSR_POS0_POS                             (0U)
#define GPIO_POSR_POS0                                 ((uint8_t)0x01U)
#define GPIO_POSR_POS1_POS                             (1U)
#define GPIO_POSR_POS1                                 ((uint8_t)0x02U)
#define GPIO_POSR_POS2_POS                             (2U)
#define GPIO_POSR_POS2                                 ((uint8_t)0x04U)
#define GPIO_POSR_POS3_POS                             (3U)
#define GPIO_POSR_POS3                                 ((uint8_t)0x08U)
#define GPIO_POSR_POS4_POS                             (4U)
#define GPIO_POSR_POS4                                 ((uint8_t)0x10U)
#define GPIO_POSR_POS5_POS                             (5U)
#define GPIO_POSR_POS5                                 ((uint8_t)0x20U)
#define GPIO_POSR_POS6_POS                             (6U)
#define GPIO_POSR_POS6                                 ((uint8_t)0x40U)
#define GPIO_POSR_POS7_POS                             (7U)
#define GPIO_POSR_POS7                                 ((uint8_t)0x80U)

/*  Bit definition for GPIO_PORR register  */
#define GPIO_PORR_POR0_POS                             (0U)
#define GPIO_PORR_POR0                                 ((uint8_t)0x01U)
#define GPIO_PORR_POR1_POS                             (1U)
#define GPIO_PORR_POR1                                 ((uint8_t)0x02U)
#define GPIO_PORR_POR2_POS                             (2U)
#define GPIO_PORR_POR2                                 ((uint8_t)0x04U)
#define GPIO_PORR_POR3_POS                             (3U)
#define GPIO_PORR_POR3                                 ((uint8_t)0x08U)
#define GPIO_PORR_POR4_POS                             (4U)
#define GPIO_PORR_POR4                                 ((uint8_t)0x10U)
#define GPIO_PORR_POR5_POS                             (5U)
#define GPIO_PORR_POR5                                 ((uint8_t)0x20U)
#define GPIO_PORR_POR6_POS                             (6U)
#define GPIO_PORR_POR6                                 ((uint8_t)0x40U)
#define GPIO_PORR_POR7_POS                             (7U)
#define GPIO_PORR_POR7                                 ((uint8_t)0x80U)

/*  Bit definition for GPIO_POTR register  */
#define GPIO_POTR_POT0_POS                             (0U)
#define GPIO_POTR_POT0                                 ((uint8_t)0x01U)
#define GPIO_POTR_POT1_POS                             (1U)
#define GPIO_POTR_POT1                                 ((uint8_t)0x02U)
#define GPIO_POTR_POT2_POS                             (2U)
#define GPIO_POTR_POT2                                 ((uint8_t)0x04U)
#define GPIO_POTR_POT3_POS                             (3U)
#define GPIO_POTR_POT3                                 ((uint8_t)0x08U)
#define GPIO_POTR_POT4_POS                             (4U)
#define GPIO_POTR_POT4                                 ((uint8_t)0x10U)
#define GPIO_POTR_POT5_POS                             (5U)
#define GPIO_POTR_POT5                                 ((uint8_t)0x20U)
#define GPIO_POTR_POT6_POS                             (6U)
#define GPIO_POTR_POT6                                 ((uint8_t)0x40U)
#define GPIO_POTR_POT7_POS                             (7U)
#define GPIO_POTR_POT7                                 ((uint8_t)0x80U)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE_POS                            (0U)
#define GPIO_PSPCR_SPFE                                ((uint16_t)0x001FU)
#define GPIO_PSPCR_SPFE_0                              ((uint16_t)0x0001U)
#define GPIO_PSPCR_SPFE_1                              ((uint16_t)0x0002U)
#define GPIO_PSPCR_SPFE_2                              ((uint16_t)0x0004U)
#define GPIO_PSPCR_SPFE_3                              ((uint16_t)0x0008U)
#define GPIO_PSPCR_SPFE_4                              ((uint16_t)0x0010U)

