levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for GPIO_PCCR register  */
#define GPIO_PCCR_RDWT_POS                             (14U)
#define GPIO_PCCR_RDWT                                 ((uint16_t)0xC000U)
#define GPIO_PCCR_RDWT_0                               ((uint16_t)0x4000U)
#define GPIO_PCCR_RDWT_1                               ((uint16_t)0x8000U)

/*  Bit definition for GPIO_PINAER register  */
#define GPIO_PINAER_PINAE0_POS                         (0U)
#define GPIO_PINAER_PINAE0                             ((uint16_t)0x0001U)
#define GPIO_PINAER_PINAE1_POS                         (1U)
#define GPIO_PINAER_PINAE1                             ((uint16_t)0x0002U)
#define GPIO_PINAER_PINAE2_POS                         (2U)
#define GPIO_PINAER_PINAE2                             ((uint16_t)0x0004U)
#define GPIO_PINAER_PINAE3_POS                         (3U)
#define GPIO_PINAER_PINAE3                             ((uint16_t)0x0008U)
#define GPIO_PINAER_PINAE4_POS                         (4U)
#define GPIO_PINAER_PINAE4                             ((uint16_t)0x0010U)
#define GPIO_PINAER_PINAE5_POS                         (5U)
#define GPIO_PINAER_PINAE5                             ((uint16_t)0x0020U)
#define GPIO_PINAER_PINAE7_POS                         (7U)
#define GPIO_PINAER_PINAE7                             ((uint16_t)0x0080U)
#define GPIO_PINAER_PINAE9_POS                         (9U)
#define GPIO_PINAER_PINAE9                             ((uint16_t)0x0200U)
#define GPIO_PINAER_PINAE10_POS                        (10U)
#define GPIO_PINAER_PINAE10                            ((uint16_t)0x0400U)
#define GPIO_PINAER_PINAE11_POS                        (11U)
#define GPIO_PINAER_PINAE11                            ((uint16_t)0x0800U)
#define GPIO_PINAER_PINAE13_POS                        (13U)
#define GPIO_PINAER_PINAE13                            ((uint16_t)0x2000U)
#define GPIO_PINAER_PINAE14_POS                        (14U)
#define GPIO_PINAER_PINAE14                            ((uint16_t)0x4000U)

/*  Bit definition for GPIO_PWPR register  */
#define GPIO_PWPR_WE_POS                               (0U)
#define GPIO_PWPR_WE                                   ((uint16_t)0x0001U)
#define GPIO_PWPR_WP_POS                               (8U)
#define GPIO_PWPR_WP                                   ((uint16_t)0xFF00U)
#define GPIO_PWPR_WP_0                                 ((uint16_t)0x0100U)
#define GPIO_PWPR_WP_1                                 ((uint16_t)0x0200U)
#define GPIO_PWPR_WP_2                                 ((uint16_t)0x0400U)
#define GPIO_PWPR_WP_3                                 ((uint16_t)0x0800U)
#define GPIO_PWPR_WP_4                                 ((uint16_t)0x1000U)
#define GPIO_PWPR_WP_5                                 ((uint16_t)0x2000U)
#define GPIO_PWPR_WP_6                                 ((uint16_t)0x4000U)
#define GPIO_PWPR_WP_7                                 ((uint16_t)0x8000U)

/*  Bit definition for GPIO_PCR register  */
#define GPIO_PCR_POUT_POS                              (0U)
#define GPIO_PCR_POUT                                  ((uint16_t)0x0001U)
#define GPIO_PCR_POUTE_POS                             (1U)
#define GPIO_PCR_POUTE                                 ((uint16_t)0x0002U)
#define GPIO_PCR_NOD_POS                               (2U)
#define GPIO_PCR_NOD                                   ((uint16_t)0x0004U)
#define GPIO_PCR_DRV_POS                               (4U)
#define GPIO_PCR_DRV                                   ((uint16_t)0x0010U)
#define GPIO_PCR_LTE_POS                               (5U)
#define GPIO_PCR_LTE                                   ((uint16_t)0x0020U)
#define GPIO_PCR_PUU_POS                               (6U)
#define GPIO_PCR_PUU                                   ((uint16_t)0x0040U)
#define GPIO_PCR_PIN_POS                               (8U)
#define GPIO_PCR_PIN                                   ((uint16_t)0x0100U)
#define GPIO_PCR_INVE_POS                              (9U)
#define GPIO_PCR_INVE                                  ((uint16_t)0x0200U)
#define GPIO_PCR_CINSEL_POS                            (10U)
#define GPIO_PCR_CINSEL                                ((uint16_t)0x0400U)
#define GPIO_PCR_INTE_POS                              (11U)
#define GPIO_PCR_INTE                                  ((uint16_t)0x0800U)

/*  Bit definition for GPIO_PFSR register  */
#define GPIO_PFSR_FSEL_POS                             (0U)
#define GPIO_PFSR_FSEL                                 ((uint16_t)0x0007U)
#define GPIO_PFSR_FSEL_0                               ((uint16_t)0x0001U)
#define GPIO_PFSR_FSEL_1                               ((uint16_t)0x0002U)
#define GPIO_PFSR_FSEL_2                               ((uint16_t)0x0004U)


/*******************************************************************************
                Bit definition for Peripheral I2C
*******************************************************************************/
/*  Bit definition for I2C_CR1 register  */
#define I2C_CR1_PE_POS                                 (0U)
#define I2C_CR1_PE                                     ((uint32_t)0x00000001U)
#define I2C_CR1_SMBUS_POS                              (1U)
#define I2C_CR1_SMBUS                                  ((uint32_t)0x00000002U)
#define I2C_CR1_SMBALRTEN_POS                          (2U)
#define I2C_CR1_SMBALRTEN                              ((uint32_t)0x00000004U)
#define I2C_CR1_SMBDEFAULTEN_POS                       (3U)
#define I2C_CR1_SMBDEFAULTEN                           ((uint32_t)0x00000008U)
#define I2C_CR1_SMBHOSTEN_POS                          (4U)
#define I2C_CR1_SMBHOSTEN                              ((uint32_t)0x00000010U)
#define I2C_CR1_FACKEN_POS                             (5U)
#define I2C_CR1_FACKEN                                 ((uint32_t)0x00000020U)
#define I2C_CR1_GCEN_POS                               (6U)
#define I2C_CR1_GCEN                                   ((uint32_t)0x00000040U)
#define I2C_CR1_RESTART_POS                            (7U)
#define I2C_CR1_RESTART                                ((uint32_t)0x00000080U)
#define I2C_CR1_START_POS                              (8U)
#define I2C_CR1_START                                  ((uint32_t)0x00000100U)
#define I2C_CR1_STOP_POS                               (9U)
#define I2C_CR1_STOP                                   ((uint32_t)0x00000200U)
#define I2C_CR1_ACK_POS                                (10U)
#define I2C_CR1_ACK                                    ((uint32_t)0x00000400U)
#define I2C_CR1_SWRST_POS                              (15U)
#define I2C_CR1_SWRST                                  ((uint32_t)0x00008000U)

/*  Bit definition for I2C_CR2 register  */
#define I2C_CR2_STARTIE_POS                            (0U)
#define I2C_CR2_STARTIE                                ((uint32_t)0x00000001U)
#define I2C_CR2_SLADDR0IE_POS                          (1U)
#define I2C_CR2_SLADDR0IE                              ((uint32_t)0x00000002U)
#define I2C_CR2_SLADDR1IE_POS                          (2U)
#define I2C_CR2_SLADDR1IE                              ((uint32_t)0x00000004U)
#define I2C_CR2_TENDIE_POS                             (3U)
#define I2C_CR2_TENDIE                                 ((uint32_t)0x00000008U)
#define I2C_CR2_STOPIE_POS                             (4U)
#define I2C_CR2_STOPIE                                 ((uint32_t)0x00000010U)
#define I2C_CR2_RFULLIE_POS                            (6U)
#define I2C_CR2_RFULLIE                                ((uint32_t)0x00000040U)
#define I2C_CR2_TEMPTYIE_POS                           (7U)
#define I2C_CR2_TEMPTYIE                               ((uint32_t)0x00000080U)
#define I2C_CR2_ARLOIE_POS                             (9U)
#define I2C_CR2_ARLOIE                                 ((uint32_t)0x00000200U)
#define I2C_CR2_NACKIE_POS                             (12U)
#define I2C_CR2_NACKIE                                 ((uint32_t)0x00001000U)
#define I2C_CR2_GENCALLIE_POS                          (20U)
#define I2C_CR2_GENCALLIE                              ((uint32_t)0x00100000U)
#define I2C_CR2_SMBDEFAULTIE_POS                       (21U)
#define I2C_CR2_SMBDEFAULTIE                           ((uint32_t)0x00200000U)
#define I2C_CR2_SMBHOSTIE_POS                          (22U)
#define I2C_CR2_SMBHOSTIE                              ((uint32_t)0x00400000U)
#define I2C_CR2_SMBALRTIE_POS                          (23U)
#define I2C_CR2_SMBALRTIE                              ((uint32_t)0x00800000U)

/*  Bit definition for I2C_SLR0 register  */
#define I2C_SLR0_SLADDR0_POS                           (0U)
#define I2C_SLR0_SLADDR0                               ((uint32_t)0x000003FFU)
#define I2C_SLR0_SLADDR0_0                             ((uint32_t)0x00000001U)
#define I2C_SLR0_SLADDR0_1                             ((uint32_t)0x00000002U)
#define I2C_SLR0_SLADDR0_2                             ((uint32_t)0x00000004U)
#define I2C_SLR0_SLADDR0_3                             ((uint32_t)0x00000008U)
#define I2C_SLR0_SLADDR0_4                             ((uint32_t)0x00000010U)
#define I2C_SLR0_SLADDR0_5                             ((uint32_t)0x00000020U)
#define I2C_SLR0_SLADDR0_6                             ((uint32_t)0x00000040U)
#define I2C_SLR0_SLADDR0_7                             ((uint32_t)0x00000080U)
#define I2C_SLR0_SLADDR0_8                             ((uint32_t)0x00000100U)
#define I2C_SLR0_SLADDR0_9                             ((uint32_t)0x00000200U)
#define I2C_SLR0_SLADDR0EN_POS                         (12U)
#define I2C_SLR0_SLADDR0EN                             ((uint32_t)0x00001000U)
#define I2C_SLR0_ADDRMOD0_POS                          (15U)
#define I2C_SLR0_ADDRMOD0                              ((uint32_t)0x00008000U)

