levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for I2C_SLR1 register  */
#define I2C_SLR1_SLADDR1_POS                           (0U)
#define I2C_SLR1_SLADDR1                               ((uint32_t)0x000003FFU)
#define I2C_SLR1_SLADDR1_0                             ((uint32_t)0x00000001U)
#define I2C_SLR1_SLADDR1_1                             ((uint32_t)0x00000002U)
#define I2C_SLR1_SLADDR1_2                             ((uint32_t)0x00000004U)
#define I2C_SLR1_SLADDR1_3                             ((uint32_t)0x00000008U)
#define I2C_SLR1_SLADDR1_4                             ((uint32_t)0x00000010U)
#define I2C_SLR1_SLADDR1_5                             ((uint32_t)0x00000020U)
#define I2C_SLR1_SLADDR1_6                             ((uint32_t)0x00000040U)
#define I2C_SLR1_SLADDR1_7                             ((uint32_t)0x00000080U)
#define I2C_SLR1_SLADDR1_8                             ((uint32_t)0x00000100U)
#define I2C_SLR1_SLADDR1_9                             ((uint32_t)0x00000200U)
#define I2C_SLR1_SLADDR1EN_POS                         (12U)
#define I2C_SLR1_SLADDR1EN                             ((uint32_t)0x00001000U)
#define I2C_SLR1_ADDRMOD1_POS                          (15U)
#define I2C_SLR1_ADDRMOD1                              ((uint32_t)0x00008000U)

/*  Bit definition for I2C_SR register  */
#define I2C_SR_STARTF_POS                              (0U)
#define I2C_SR_STARTF                                  ((uint32_t)0x00000001U)
#define I2C_SR_SLADDR0F_POS                            (1U)
#define I2C_SR_SLADDR0F                                ((uint32_t)0x00000002U)
#define I2C_SR_SLADDR1F_POS                            (2U)
#define I2C_SR_SLADDR1F                                ((uint32_t)0x00000004U)
#define I2C_SR_TENDF_POS                               (3U)
#define I2C_SR_TENDF                                   ((uint32_t)0x00000008U)
#define I2C_SR_STOPF_POS                               (4U)
#define I2C_SR_STOPF                                   ((uint32_t)0x00000010U)
#define I2C_SR_RFULLF_POS                              (6U)
#define I2C_SR_RFULLF                                  ((uint32_t)0x00000040U)
#define I2C_SR_TEMPTYF_POS                             (7U)
#define I2C_SR_TEMPTYF                                 ((uint32_t)0x00000080U)
#define I2C_SR_ARLOF_POS                               (9U)
#define I2C_SR_ARLOF                                   ((uint32_t)0x00000200U)
#define I2C_SR_ACKRF_POS                               (10U)
#define I2C_SR_ACKRF                                   ((uint32_t)0x00000400U)
#define I2C_SR_NACKF_POS                               (12U)
#define I2C_SR_NACKF                                   ((uint32_t)0x00001000U)
#define I2C_SR_MSL_POS                                 (16U)
#define I2C_SR_MSL                                     ((uint32_t)0x00010000U)
#define I2C_SR_BUSY_POS                                (17U)
#define I2C_SR_BUSY                                    ((uint32_t)0x00020000U)
#define I2C_SR_TRA_POS                                 (18U)
#define I2C_SR_TRA                                     ((uint32_t)0x00040000U)
#define I2C_SR_GENCALLF_POS                            (20U)
#define I2C_SR_GENCALLF                                ((uint32_t)0x00100000U)
#define I2C_SR_SMBDEFAULTF_POS                         (21U)
#define I2C_SR_SMBDEFAULTF                             ((uint32_t)0x00200000U)
#define I2C_SR_SMBHOSTF_POS                            (22U)
#define I2C_SR_SMBHOSTF                                ((uint32_t)0x00400000U)
#define I2C_SR_SMBALRTF_POS                            (23U)
#define I2C_SR_SMBALRTF                                ((uint32_t)0x00800000U)

/*  Bit definition for I2C_CLR register  */
#define I2C_CLR_STARTFCLR_POS                          (0U)
#define I2C_CLR_STARTFCLR                              ((uint32_t)0x00000001U)
#define I2C_CLR_SLADDR0FCLR_POS                        (1U)
#define I2C_CLR_SLADDR0FCLR                            ((uint32_t)0x00000002U)
#define I2C_CLR_SLADDR1FCLR_POS                        (2U)
#define I2C_CLR_SLADDR1FCLR                            ((uint32_t)0x00000004U)
#define I2C_CLR_TENDFCLR_POS                           (3U)
#define I2C_CLR_TENDFCLR                               ((uint32_t)0x00000008U)
#define I2C_CLR_STOPFCLR_POS                           (4U)
#define I2C_CLR_STOPFCLR                               ((uint32_t)0x00000010U)
#define I2C_CLR_RFULLFCLR_POS                          (6U)
#define I2C_CLR_RFULLFCLR                              ((uint32_t)0x00000040U)
#define I2C_CLR_TEMPTYFCLR_POS                         (7U)
#define I2C_CLR_TEMPTYFCLR                             ((uint32_t)0x00000080U)
#define I2C_CLR_ARLOFCLR_POS                           (9U)
#define I2C_CLR_ARLOFCLR                               ((uint32_t)0x00000200U)
#define I2C_CLR_NACKFCLR_POS                           (12U)
#define I2C_CLR_NACKFCLR                               ((uint32_t)0x00001000U)
#define I2C_CLR_GENCALLFCLR_POS                        (20U)
#define I2C_CLR_GENCALLFCLR                            ((uint32_t)0x00100000U)
#define I2C_CLR_SMBDEFAULTF_POS                        (21U)
#define I2C_CLR_SMBDEFAULTF                            ((uint32_t)0x00200000U)
#define I2C_CLR_SMBHOSTFCL_POS                         (22U)
#define I2C_CLR_SMBHOSTFCL                             ((uint32_t)0x00400000U)
#define I2C_CLR_SMBALRTFCLR_POS                        (23U)
#define I2C_CLR_SMBALRTFCLR                            ((uint32_t)0x00800000U)

/*  Bit definition for I2C_DTR register  */
#define I2C_DTR_DT_POS                                 (0U)
#define I2C_DTR_DT                                     ((uint32_t)0x000000FFU)
#define I2C_DTR_DT_0                                   ((uint32_t)0x00000001U)
#define I2C_DTR_DT_1                                   ((uint32_t)0x00000002U)
#define I2C_DTR_DT_2                                   ((uint32_t)0x00000004U)
#define I2C_DTR_DT_3                                   ((uint32_t)0x00000008U)
#define I2C_DTR_DT_4                                   ((uint32_t)0x00000010U)
#define I2C_DTR_DT_5                                   ((uint32_t)0x00000020U)
#define I2C_DTR_DT_6                                   ((uint32_t)0x00000040U)
#define I2C_DTR_DT_7                                   ((uint32_t)0x00000080U)

/*  Bit definition for I2C_DRR register  */
#define I2C_DRR_DR_POS                                 (0U)
#define I2C_DRR_DR                                     ((uint32_t)0x000000FFU)
#define I2C_DRR_DR_0                                   ((uint32_t)0x00000001U)
#define I2C_DRR_DR_1                                   ((uint32_t)0x00000002U)
#define I2C_DRR_DR_2                                   ((uint32_t)0x00000004U)
#define I2C_DRR_DR_3                                   ((uint32_t)0x00000008U)
#define I2C_DRR_DR_4                                   ((uint32_t)0x00000010U)
#define I2C_DRR_DR_5                                   ((uint32_t)0x00000020U)
#define I2C_DRR_DR_6                                   ((uint32_t)0x00000040U)
#define I2C_DRR_DR_7                                   ((uint32_t)0x00000080U)

/*  Bit definition for I2C_CCR register  */
#define I2C_CCR_SLOWW_POS                              (0U)
#define I2C_CCR_SLOWW                                  ((uint32_t)0x0000001FU)
#define I2C_CCR_SLOWW_0                                ((uint32_t)0x00000001U)
#define I2C_CCR_SLOWW_1                                ((uint32_t)0x00000002U)
#define I2C_CCR_SLOWW_2                                ((uint32_t)0x00000004U)
#define I2C_CCR_SLOWW_3                                ((uint32_t)0x00000008U)
#define I2C_CCR_SLOWW_4                                ((uint32_t)0x00000010U)
#define I2C_CCR_SHIGHW_POS                             (8U)
#define I2C_CCR_SHIGHW                                 ((uint32_t)0x00001F00U)
#define I2C_CCR_SHIGHW_0                               ((uint32_t)0x00000100U)
#define I2C_CCR_SHIGHW_1                               ((uint32_t)0x00000200U)
#define I2C_CCR_SHIGHW_2                               ((uint32_t)0x00000400U)
#define I2C_CCR_SHIGHW_3                               ((uint32_t)0x00000800U)
#define I2C_CCR_SHIGHW_4                               ((uint32_t)0x00001000U)
#define I2C_CCR_CKDIV_POS                              (16U)
#define I2C_CCR_CKDIV                                  ((uint32_t)0x00070000U)
#define I2C_CCR_CKDIV_0                                ((uint32_t)0x00010000U)
#define I2C_CCR_CKDIV_1                                ((uint32_t)0x00020000U)
#define I2C_CCR_CKDIV_2                                ((uint32_t)0x00040000U)
#define I2C_CCR_FMPE_POS                               (23U)
#define I2C_CCR_FMPE                                   ((uint32_t)0x00800000U)

/*  Bit definition for I2C_FLTR register  */
#define I2C_FLTR_DNF_POS                               (0U)
#define I2C_FLTR_DNF                                   ((uint32_t)0x00000003U)
#define I2C_FLTR_DNF_0                                 ((uint32_t)0x00000001U)
#define I2C_FLTR_DNF_1                                 ((uint32_t)0x00000002U)
#define I2C_FLTR_DNFEN_POS                             (4U)
#define I2C_FLTR_DNFEN                                 ((uint32_t)0x00000010U)
#define I2C_FLTR_ANFEN_POS                             (5U)
#define I2C_FLTR_ANFEN                                 ((uint32_t)0x00000020U)


