levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*******************************************************************************
                Bit definition for Peripheral ICG
*******************************************************************************/
/*  Bit definition for ICG_ICG0 register  */
#define ICG_ICG0_SWDTAUTST_POS                         (0U)
#define ICG_ICG0_SWDTAUTST                             ((uint32_t)0x00000001U)
#define ICG_ICG0_SWDTITS_POS                           (1U)
#define ICG_ICG0_SWDTITS                               ((uint32_t)0x00000002U)
#define ICG_ICG0_SWDTPERI_POS                          (2U)
#define ICG_ICG0_SWDTPERI                              ((uint32_t)0x0000000CU)
#define ICG_ICG0_SWDTPERI_0                            ((uint32_t)0x00000004U)
#define ICG_ICG0_SWDTPERI_1                            ((uint32_t)0x00000008U)
#define ICG_ICG0_SWDTCKS_POS                           (4U)
#define ICG_ICG0_SWDTCKS                               ((uint32_t)0x000000F0U)
#define ICG_ICG0_SWDTCKS_0                             ((uint32_t)0x00000010U)
#define ICG_ICG0_SWDTCKS_1                             ((uint32_t)0x00000020U)
#define ICG_ICG0_SWDTCKS_2                             ((uint32_t)0x00000040U)
#define ICG_ICG0_SWDTCKS_3                             ((uint32_t)0x00000080U)
#define ICG_ICG0_SWDTWDPT_POS                          (8U)
#define ICG_ICG0_SWDTWDPT                              ((uint32_t)0x00000F00U)
#define ICG_ICG0_SWDTWDPT_0                            ((uint32_t)0x00000100U)
#define ICG_ICG0_SWDTWDPT_1                            ((uint32_t)0x00000200U)
#define ICG_ICG0_SWDTWDPT_2                            ((uint32_t)0x00000400U)
#define ICG_ICG0_SWDTWDPT_3                            ((uint32_t)0x00000800U)
#define ICG_ICG0_SWDTSLPOFF_POS                        (12U)
#define ICG_ICG0_SWDTSLPOFF                            ((uint32_t)0x00001000U)
#define ICG_ICG0_HRCREQS_POS                           (16U)
#define ICG_ICG0_HRCREQS                               ((uint32_t)0x000F0000U)
#define ICG_ICG0_HRCREQS_0                             ((uint32_t)0x00010000U)
#define ICG_ICG0_HRCREQS_1                             ((uint32_t)0x00020000U)
#define ICG_ICG0_HRCREQS_2                             ((uint32_t)0x00040000U)
#define ICG_ICG0_HRCREQS_3                             ((uint32_t)0x00080000U)
#define ICG_ICG0_HRCSTOP_POS                           (20U)
#define ICG_ICG0_HRCSTOP                               ((uint32_t)0x00100000U)
#define ICG_ICG0_NMIFCLK_POS                           (26U)
#define ICG_ICG0_NMIFCLK                               ((uint32_t)0x0C000000U)
#define ICG_ICG0_NMIFCLK_0                             ((uint32_t)0x04000000U)
#define ICG_ICG0_NMIFCLK_1                             ((uint32_t)0x08000000U)
#define ICG_ICG0_NMIFEN_POS                            (28U)
#define ICG_ICG0_NMIFEN                                ((uint32_t)0x10000000U)
#define ICG_ICG0_NMITRG_POS                            (29U)
#define ICG_ICG0_NMITRG                                ((uint32_t)0x20000000U)
#define ICG_ICG0_NMIEN_POS                             (30U)
#define ICG_ICG0_NMIEN                                 ((uint32_t)0x40000000U)
#define ICG_ICG0_NMIICGNE_POS                          (31U)
#define ICG_ICG0_NMIICGNE                              ((uint32_t)0x80000000U)

/*  Bit definition for ICG_ICG1 register  */
#define ICG_ICG1_LKUPDIS_POS                           (8U)
#define ICG_ICG1_LKUPDIS                               ((uint32_t)0x00000100U)
#define ICG_ICG1_LVD0LVL_POS                           (12U)
#define ICG_ICG1_LVD0LVL                               ((uint32_t)0x00007000U)
#define ICG_ICG1_LVD0LVL_0                             ((uint32_t)0x00001000U)
#define ICG_ICG1_LVD0LVL_1                             ((uint32_t)0x00002000U)
#define ICG_ICG1_LVD0LVL_2                             ((uint32_t)0x00004000U)
#define ICG_ICG1_LVDDIS_POS                            (15U)
#define ICG_ICG1_LVDDIS                                ((uint32_t)0x00008000U)

/*  Bit definition for ICG_ICG2 register  */
#define ICG_ICG2                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG3 register  */
#define ICG_ICG3                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG4 register  */
#define ICG_ICG4                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG5 register  */
#define ICG_ICG5                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG6 register  */
#define ICG_ICG6                                       ((uint32_t)0xFFFFFFFFU)

/*  Bit definition for ICG_ICG7 register  */
#define ICG_ICG7_WDTAUTST_POS                          (0U)
#define ICG_ICG7_WDTAUTST                              ((uint32_t)0x00000001U)
#define ICG_ICG7_WDTITS_POS                            (1U)
#define ICG_ICG7_WDTITS                                ((uint32_t)0x00000002U)
#define ICG_ICG7_WDTPERI_POS                           (2U)
#define ICG_ICG7_WDTPERI                               ((uint32_t)0x0000000CU)
#define ICG_ICG7_WDTPERI_0                             ((uint32_t)0x00000004U)
#define ICG_ICG7_WDTPERI_1                             ((uint32_t)0x00000008U)
#define ICG_ICG7_WDTCKS_POS                            (4U)
#define ICG_ICG7_WDTCKS                                ((uint32_t)0x000000F0U)
#define ICG_ICG7_WDTCKS_0                              ((uint32_t)0x00000010U)
#define ICG_ICG7_WDTCKS_1                              ((uint32_t)0x00000020U)
#define ICG_ICG7_WDTCKS_2                              ((uint32_t)0x00000040U)
#define ICG_ICG7_WDTCKS_3                              ((uint32_t)0x00000080U)
#define ICG_ICG7_WDTWDPT_POS                           (8U)
#define ICG_ICG7_WDTWDPT                               ((uint32_t)0x00000F00U)
#define ICG_ICG7_WDTWDPT_0                             ((uint32_t)0x00000100U)
#define ICG_ICG7_WDTWDPT_1                             ((uint32_t)0x00000200U)
#define ICG_ICG7_WDTWDPT_2                             ((uint32_t)0x00000400U)
#define ICG_ICG7_WDTWDPT_3                             ((uint32_t)0x00000800U)
#define ICG_ICG7_WDTSLPOFF_POS                         (12U)
#define ICG_ICG7_WDTSLPOFF                             ((uint32_t)0x00001000U)


