levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*******************************************************************************
                Bit definition for Peripheral INTC
*******************************************************************************/
/*  Bit definition for INTC_NMICR register  */
#define INTC_NMICR_NMITRG_POS                          (0U)
#define INTC_NMICR_NMITRG                              ((uint32_t)0x00000001U)
#define INTC_NMICR_NMIFCLK_POS                         (4U)
#define INTC_NMICR_NMIFCLK                             ((uint32_t)0x00000030U)
#define INTC_NMICR_NMIFCLK_0                           ((uint32_t)0x00000010U)
#define INTC_NMICR_NMIFCLK_1                           ((uint32_t)0x00000020U)
#define INTC_NMICR_NMIFEN_POS                          (7U)
#define INTC_NMICR_NMIFEN                              ((uint32_t)0x00000080U)
#define INTC_NMICR_NOCSEL_POS                          (12U)
#define INTC_NMICR_NOCSEL                              ((uint32_t)0x00003000U)
#define INTC_NMICR_NOCSEL_0                            ((uint32_t)0x00001000U)
#define INTC_NMICR_NOCSEL_1                            ((uint32_t)0x00002000U)
#define INTC_NMICR_NOCEN_POS                           (15U)
#define INTC_NMICR_NOCEN                               ((uint32_t)0x00008000U)

/*  Bit definition for INTC_NMIER register  */
#define INTC_NMIER_NMIENR_POS                          (0U)
#define INTC_NMIER_NMIENR                              ((uint32_t)0x00000001U)
#define INTC_NMIER_SWDTENR_POS                         (1U)
#define INTC_NMIER_SWDTENR                             ((uint32_t)0x00000002U)
#define INTC_NMIER_PVD1ENR_POS                         (2U)
#define INTC_NMIER_PVD1ENR                             ((uint32_t)0x00000004U)
#define INTC_NMIER_PVD2ENR_POS                         (3U)
#define INTC_NMIER_PVD2ENR                             ((uint32_t)0x00000008U)
#define INTC_NMIER_XTALSTPENR_POS                      (5U)
#define INTC_NMIER_XTALSTPENR                          ((uint32_t)0x00000020U)
#define INTC_NMIER_REPENR_POS                          (8U)
#define INTC_NMIER_REPENR                              ((uint32_t)0x00000100U)
#define INTC_NMIER_WDTENR_POS                          (11U)
#define INTC_NMIER_WDTENR                              ((uint32_t)0x00000800U)

/*  Bit definition for INTC_NMIFR register  */
#define INTC_NMIFR_NMIFR_POS                           (0U)
#define INTC_NMIFR_NMIFR                               ((uint32_t)0x00000001U)
#define INTC_NMIFR_SWDTFR_POS                          (1U)
#define INTC_NMIFR_SWDTFR                              ((uint32_t)0x00000002U)
#define INTC_NMIFR_PVD1FR_POS                          (2U)
#define INTC_NMIFR_PVD1FR                              ((uint32_t)0x00000004U)
#define INTC_NMIFR_PVD2FR_POS                          (3U)
#define INTC_NMIFR_PVD2FR                              ((uint32_t)0x00000008U)
#define INTC_NMIFR_XTALSTPFR_POS                       (5U)
#define INTC_NMIFR_XTALSTPFR                           ((uint32_t)0x00000020U)
#define INTC_NMIFR_REPFR_POS                           (8U)
#define INTC_NMIFR_REPFR                               ((uint32_t)0x00000100U)
#define INTC_NMIFR_WDTFR_POS                           (11U)
#define INTC_NMIFR_WDTFR                               ((uint32_t)0x00000800U)

/*  Bit definition for INTC_NMICFR register  */
#define INTC_NMICFR_NMICFR_POS                         (0U)
#define INTC_NMICFR_NMICFR                             ((uint32_t)0x00000001U)
#define INTC_NMICFR_SWDTCFR_POS                        (1U)
#define INTC_NMICFR_SWDTCFR                            ((uint32_t)0x00000002U)
#define INTC_NMICFR_PVD1CFR_POS                        (2U)
#define INTC_NMICFR_PVD1CFR                            ((uint32_t)0x00000004U)
#define INTC_NMICFR_PVD2CFR_POS                        (3U)
#define INTC_NMICFR_PVD2CFR                            ((uint32_t)0x00000008U)
#define INTC_NMICFR_XTALSTPCFR_POS                     (5U)
#define INTC_NMICFR_XTALSTPCFR                         ((uint32_t)0x00000020U)
#define INTC_NMICFR_REPCFR_POS                         (8U)
#define INTC_NMICFR_REPCFR                             ((uint32_t)0x00000100U)
#define INTC_NMICFR_WDTCFR_POS                         (11U)
#define INTC_NMICFR_WDTCFR                             ((uint32_t)0x00000800U)

/*  Bit definition for INTC_EIRQCR register  */
#define INTC_EIRQCR_EIRQTRG_POS                        (0U)
#define INTC_EIRQCR_EIRQTRG                            ((uint32_t)0x00000003U)
#define INTC_EIRQCR_EIRQTRG_0                          ((uint32_t)0x00000001U)
#define INTC_EIRQCR_EIRQTRG_1                          ((uint32_t)0x00000002U)
#define INTC_EIRQCR_EISMPCLK_POS                       (4U)
#define INTC_EIRQCR_EISMPCLK                           ((uint32_t)0x00000030U)
#define INTC_EIRQCR_EISMPCLK_0                         ((uint32_t)0x00000010U)
#define INTC_EIRQCR_EISMPCLK_1                         ((uint32_t)0x00000020U)
#define INTC_EIRQCR_EFEN_POS                           (7U)
#define INTC_EIRQCR_EFEN                               ((uint32_t)0x00000080U)
#define INTC_EIRQCR_NOCEN_POS                          (15U)
#define INTC_EIRQCR_NOCEN                              ((uint32_t)0x00008000U)

/*  Bit definition for INTC_WUPEN register  */
#define INTC_WUPEN_EIRQWUEN_POS                        (0U)
#define INTC_WUPEN_EIRQWUEN                            ((uint32_t)0x000000FFU)
#define INTC_WUPEN_EIRQWUEN_0                          ((uint32_t)0x00000001U)
#define INTC_WUPEN_EIRQWUEN_1                          ((uint32_t)0x00000002U)
#define INTC_WUPEN_EIRQWUEN_2                          ((uint32_t)0x00000004U)
#define INTC_WUPEN_EIRQWUEN_3                          ((uint32_t)0x00000008U)
#define INTC_WUPEN_EIRQWUEN_4                          ((uint32_t)0x00000010U)
#define INTC_WUPEN_EIRQWUEN_5                          ((uint32_t)0x00000020U)
#define INTC_WUPEN_EIRQWUEN_6                          ((uint32_t)0x00000040U)
#define INTC_WUPEN_EIRQWUEN_7                          ((uint32_t)0x00000080U)
#define INTC_WUPEN_SWDTWUEN_POS                        (16U)
#define INTC_WUPEN_SWDTWUEN                            ((uint32_t)0x00010000U)
#define INTC_WUPEN_PVD1WUEN_POS                        (17U)
#define INTC_WUPEN_PVD1WUEN                            ((uint32_t)0x00020000U)
#define INTC_WUPEN_PVD2WUEN_POS                        (18U)
#define INTC_WUPEN_PVD2WUEN                            ((uint32_t)0x00040000U)
#define INTC_WUPEN_CMPI0WUEN_POS                       (19U)
#define INTC_WUPEN_CMPI0WUEN                           ((uint32_t)0x00080000U)
#define INTC_WUPEN_TMR0WUEN_POS                        (23U)
#define INTC_WUPEN_TMR0WUEN                            ((uint32_t)0x00800000U)
#define INTC_WUPEN_RXWUEN_POS                          (25U)
#define INTC_WUPEN_RXWUEN                              ((uint32_t)0x02000000U)

/*  Bit definition for INTC_EIRQFR register  */
#define INTC_EIRQFR_EIRQFR_POS                         (0U)
#define INTC_EIRQFR_EIRQFR                             ((uint32_t)0x000000FFU)
#define INTC_EIRQFR_EIRQFR_0                           ((uint32_t)0x00000001U)
#define INTC_EIRQFR_EIRQFR_1                           ((uint32_t)0x00000002U)
#define INTC_EIRQFR_EIRQFR_2                           ((uint32_t)0x00000004U)
#define INTC_EIRQFR_EIRQFR_3                           ((uint32_t)0x00000008U)
#define INTC_EIRQFR_EIRQFR_4                           ((uint32_t)0x00000010U)
#define INTC_EIRQFR_EIRQFR_5                           ((uint32_t)0x00000020U)
#define INTC_EIRQFR_EIRQFR_6                           ((uint32_t)0x00000040U)
#define INTC_EIRQFR_EIRQFR_7                           ((uint32_t)0x00000080U)

/*  Bit definition for INTC_EIRQCFR register  */
#define INTC_EIRQCFR_EIRQCFR_POS                       (0U)
#define INTC_EIRQCFR_EIRQCFR                           ((uint32_t)0x000000FFU)
#define INTC_EIRQCFR_EIRQCFR_0                         ((uint32_t)0x00000001U)
#define INTC_EIRQCFR_EIRQCFR_1                         ((uint32_t)0x00000002U)
#define INTC_EIRQCFR_EIRQCFR_2                         ((uint32_t)0x00000004U)
#define INTC_EIRQCFR_EIRQCFR_3                         ((uint32_t)0x00000008U)
#define INTC_EIRQCFR_EIRQCFR_4                         ((uint32_t)0x00000010U)
#define INTC_EIRQCFR_EIRQCFR_5                         ((uint32_t)0x00000020U)
#define INTC_EIRQCFR_EIRQCFR_6                         ((uint32_t)0x00000040U)
#define INTC_EIRQCFR_EIRQCFR_7                         ((uint32_t)0x00000080U)

/*  Bit definition for INTC_SEL register  */
#define INTC_SEL_ISEL_POS                              (0U)
#define INTC_SEL_ISEL                                  ((uint32_t)0x000001FFU)
#define INTC_SEL_ISEL_0                                ((uint32_t)0x00000001U)
#define INTC_SEL_ISEL_1                                ((uint32_t)0x00000002U)
#define INTC_SEL_ISEL_2                                ((uint32_t)0x00000004U)
#define INTC_SEL_ISEL_3                                ((uint32_t)0x00000008U)
#define INTC_SEL_ISEL_4                                ((uint32_t)0x00000010U)
#define INTC_SEL_ISEL_5                                ((uint32_t)0x00000020U)
#define INTC_SEL_ISEL_6                                ((uint32_t)0x00000040U)
#define INTC_SEL_ISEL_7                                ((uint32_t)0x00000080U)
#define INTC_SEL_ISEL_8                                ((uint32_t)0x00000100U)

/*  Bit definition for INTC_SWIER register  */
#define INTC_SWIER_SWIE0_POS                           (0U)
#define INTC_SWIER_SWIE0                               ((uint32_t)0x00000001U)
#define INTC_SWIER_SWIE1_POS                           (1U)
#define INTC_SWIER_SWIE1                               ((uint32_t)0x00000002U)
#define INTC_SWIER_SWIE2_POS                           (2U)
#define INTC_SWIER_SWIE2                               ((uint32_t)0x00000004U)
#define INTC_SWIER_SWIE3_POS                           (3U)
#define INTC_SWIER_SWIE3                               ((uint32_t)0x00000008U)
#define INTC_SWIER_SWIE4_POS                           (4U)
#define INTC_SWIER_SWIE4                               ((uint32_t)0x00000010U)
#define INTC_SWIER_SWIE5_POS                           (5U)
#define INTC_SWIER_SWIE5                               ((uint32_t)0x00000020U)
#define INTC_SWIER_SWIE6_POS                           (6U)
#define INTC_SWIER_SWIE6                               ((uint32_t)0x00000040U)
#define INTC_SWIER_SWIE7_POS                           (7U)
#define INTC_SWIER_SWIE7                               ((uint32_t)0x00000080U)
#define INTC_SWIER_SWIE8_POS                           (8U)
#define INTC_SWIER_SWIE8                               ((uint32_t)0x00000100U)
#define INTC_SWIER_SWIE9_POS                           (9U)
#define INTC_SWIER_SWIE9                               ((uint32_t)0x00000200U)
#define INTC_SWIER_SWIE10_POS                          (10U)
#define INTC_SWIER_SWIE10                              ((uint32_t)0x00000400U)
#define INTC_SWIER_SWIE11_POS                          (11U)
#define INTC_SWIER_SWIE11                              ((uint32_t)0x00000800U)
#define INTC_SWIER_SWIE12_POS                          (12U)
#define INTC_SWIER_SWIE12                              ((uint32_t)0x00001000U)
#define INTC_SWIER_SWIE13_POS                          (13U)
#define INTC_SWIER_SWIE13                              ((uint32_t)0x00002000U)
#define INTC_SWIER_SWIE14_POS                          (14U)
#define INTC_SWIER_SWIE14                              ((uint32_t)0x00004000U)
#define INTC_SWIER_SWIE15_POS                          (15U)
#define INTC_SWIER_SWIE15                              ((uint32_t)0x00008000U)

