levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for INTC_EVTER register  */
#define INTC_EVTER_EVTE0_POS                           (0U)
#define INTC_EVTER_EVTE0                               ((uint32_t)0x00000001U)
#define INTC_EVTER_EVTE1_POS                           (1U)
#define INTC_EVTER_EVTE1                               ((uint32_t)0x00000002U)
#define INTC_EVTER_EVTE2_POS                           (2U)
#define INTC_EVTER_EVTE2                               ((uint32_t)0x00000004U)
#define INTC_EVTER_EVTE3_POS                           (3U)
#define INTC_EVTER_EVTE3                               ((uint32_t)0x00000008U)
#define INTC_EVTER_EVTE4_POS                           (4U)
#define INTC_EVTER_EVTE4                               ((uint32_t)0x00000010U)
#define INTC_EVTER_EVTE5_POS                           (5U)
#define INTC_EVTER_EVTE5                               ((uint32_t)0x00000020U)
#define INTC_EVTER_EVTE6_POS                           (6U)
#define INTC_EVTER_EVTE6                               ((uint32_t)0x00000040U)
#define INTC_EVTER_EVTE7_POS                           (7U)
#define INTC_EVTER_EVTE7                               ((uint32_t)0x00000080U)
#define INTC_EVTER_EVTE8_POS                           (8U)
#define INTC_EVTER_EVTE8                               ((uint32_t)0x00000100U)
#define INTC_EVTER_EVTE9_POS                           (9U)
#define INTC_EVTER_EVTE9                               ((uint32_t)0x00000200U)
#define INTC_EVTER_EVTE10_POS                          (10U)
#define INTC_EVTER_EVTE10                              ((uint32_t)0x00000400U)
#define INTC_EVTER_EVTE11_POS                          (11U)
#define INTC_EVTER_EVTE11                              ((uint32_t)0x00000800U)
#define INTC_EVTER_EVTE12_POS                          (12U)
#define INTC_EVTER_EVTE12                              ((uint32_t)0x00001000U)
#define INTC_EVTER_EVTE13_POS                          (13U)
#define INTC_EVTER_EVTE13                              ((uint32_t)0x00002000U)
#define INTC_EVTER_EVTE14_POS                          (14U)
#define INTC_EVTER_EVTE14                              ((uint32_t)0x00004000U)
#define INTC_EVTER_EVTE15_POS                          (15U)
#define INTC_EVTER_EVTE15                              ((uint32_t)0x00008000U)

/*  Bit definition for INTC_IER register  */
#define INTC_IER_IER0_POS                              (0U)
#define INTC_IER_IER0                                  ((uint32_t)0x00000001U)
#define INTC_IER_IER1_POS                              (1U)
#define INTC_IER_IER1                                  ((uint32_t)0x00000002U)
#define INTC_IER_IER2_POS                              (2U)
#define INTC_IER_IER2                                  ((uint32_t)0x00000004U)
#define INTC_IER_IER3_POS                              (3U)
#define INTC_IER_IER3                                  ((uint32_t)0x00000008U)
#define INTC_IER_IER4_POS                              (4U)
#define INTC_IER_IER4                                  ((uint32_t)0x00000010U)
#define INTC_IER_IER5_POS                              (5U)
#define INTC_IER_IER5                                  ((uint32_t)0x00000020U)
#define INTC_IER_IER6_POS                              (6U)
#define INTC_IER_IER6                                  ((uint32_t)0x00000040U)
#define INTC_IER_IER7_POS                              (7U)
#define INTC_IER_IER7                                  ((uint32_t)0x00000080U)
#define INTC_IER_IER8_POS                              (8U)
#define INTC_IER_IER8                                  ((uint32_t)0x00000100U)
#define INTC_IER_IER9_POS                              (9U)
#define INTC_IER_IER9                                  ((uint32_t)0x00000200U)
#define INTC_IER_IER10_POS                             (10U)
#define INTC_IER_IER10                                 ((uint32_t)0x00000400U)
#define INTC_IER_IER11_POS                             (11U)
#define INTC_IER_IER11                                 ((uint32_t)0x00000800U)
#define INTC_IER_IER12_POS                             (12U)
#define INTC_IER_IER12                                 ((uint32_t)0x00001000U)
#define INTC_IER_IER13_POS                             (13U)
#define INTC_IER_IER13                                 ((uint32_t)0x00002000U)
#define INTC_IER_IER14_POS                             (14U)
#define INTC_IER_IER14                                 ((uint32_t)0x00004000U)
#define INTC_IER_IER15_POS                             (15U)
#define INTC_IER_IER15                                 ((uint32_t)0x00008000U)


/*******************************************************************************
                Bit definition for Peripheral PWC
*******************************************************************************/
/*  Bit definition for PWC_STPMCR register  */
#define PWC_STPMCR_FLNWT_POS                           (0U)
#define PWC_STPMCR_FLNWT                               ((uint8_t)0x01U)
#define PWC_STPMCR_CKSMRC_POS                          (1U)
#define PWC_STPMCR_CKSMRC                              ((uint8_t)0x02U)
#define PWC_STPMCR_HAPORDIS_POS                        (3U)
#define PWC_STPMCR_HAPORDIS                            ((uint8_t)0x08U)
#define PWC_STPMCR_STPDAS_POS                          (6U)
#define PWC_STPMCR_STPDAS                              ((uint8_t)0x40U)
#define PWC_STPMCR_STOP_POS                            (7U)
#define PWC_STPMCR_STOP                                ((uint8_t)0x80U)

/*  Bit definition for PWC_PWRC register  */
#define PWC_PWRC_PWDRV_POS                             (0U)
#define PWC_PWRC_PWDRV                                 ((uint16_t)0x003FU)
#define PWC_PWRC_PWDRV_0                               ((uint16_t)0x0001U)
#define PWC_PWRC_PWDRV_1                               ((uint16_t)0x0002U)
#define PWC_PWRC_PWDRV_2                               ((uint16_t)0x0004U)
#define PWC_PWRC_PWDRV_3                               ((uint16_t)0x0008U)
#define PWC_PWRC_PWDRV_4                               ((uint16_t)0x0010U)
#define PWC_PWRC_PWDRV_5                               ((uint16_t)0x0020U)
#define PWC_PWRC_ACTV_POS                              (6U)
#define PWC_PWRC_ACTV                                  ((uint16_t)0x0040U)
#define PWC_PWRC_DVS_POS                               (7U)
#define PWC_PWRC_DVS                                   ((uint16_t)0x0080U)
#define PWC_PWRC_VHRCE_POS                             (8U)
#define PWC_PWRC_VHRCE                                 ((uint16_t)0x0100U)
#define PWC_PWRC_VPLLE_POS                             (9U)
#define PWC_PWRC_VPLLE                                 ((uint16_t)0x0200U)
#define PWC_PWRC_HCHDTDIS_POS                          (10U)
#define PWC_PWRC_HCHDTDIS                              ((uint16_t)0x0400U)
#define PWC_PWRC_PLHDTDIS_POS                          (11U)
#define PWC_PWRC_PLHDTDIS                              ((uint16_t)0x0800U)
#define PWC_PWRC_HDTDIS_POS                            (12U)
#define PWC_PWRC_HDTDIS                                ((uint16_t)0x1000U)
#define PWC_PWRC_HRCPWRDY_POS                          (13U)
#define PWC_PWRC_HRCPWRDY                              ((uint16_t)0x2000U)
#define PWC_PWRC_PLLPWRDY_POS                          (14U)
#define PWC_PWRC_PLLPWRDY                              ((uint16_t)0x4000U)

/*  Bit definition for PWC_PWRMONR register  */
#define PWC_PWRMONR_PWMONSEL_POS                       (0U)
#define PWC_PWRMONR_PWMONSEL                           ((uint8_t)0x01U)
#define PWC_PWRMONR_PWMONE_POS                         (1U)
#define PWC_PWRMONR_PWMONE                             ((uint8_t)0x02U)

/*  Bit definition for PWC_RAMCR register  */
#define PWC_RAMCR_RPERDIS_POS                          (4U)
#define PWC_RAMCR_RPERDIS                              ((uint8_t)0x10U)
#define PWC_RAMCR_SRPEF_POS                            (5U)
#define PWC_RAMCR_SRPEF                                ((uint8_t)0x20U)
#define PWC_RAMCR_HRPEF_POS                            (6U)
#define PWC_RAMCR_HRPEF                                ((uint8_t)0x40U)
#define PWC_RAMCR_CRPEF_POS                            (7U)
#define PWC_RAMCR_CRPEF                                ((uint8_t)0x80U)

