levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for PWC_LVDCR0 register  */
#define PWC_LVDCR0_L1IEGS_POS                          (2U)
#define PWC_LVDCR0_L1IEGS                              ((uint32_t)0x0000000CU)
#define PWC_LVDCR0_L1IEGS_0                            ((uint32_t)0x00000004U)
#define PWC_LVDCR0_L1IEGS_1                            ((uint32_t)0x00000008U)
#define PWC_LVDCR0_L1LVL_POS                           (4U)
#define PWC_LVDCR0_L1LVL                               ((uint32_t)0x000000F0U)
#define PWC_LVDCR0_L1LVL_0                             ((uint32_t)0x00000010U)
#define PWC_LVDCR0_L1LVL_1                             ((uint32_t)0x00000020U)
#define PWC_LVDCR0_L1LVL_2                             ((uint32_t)0x00000040U)
#define PWC_LVDCR0_L1LVL_3                             ((uint32_t)0x00000080U)
#define PWC_LVDCR0_L1NFS_POS                           (8U)
#define PWC_LVDCR0_L1NFS                               ((uint32_t)0x00000300U)
#define PWC_LVDCR0_L1NFS_0                             ((uint32_t)0x00000100U)
#define PWC_LVDCR0_L1NFS_1                             ((uint32_t)0x00000200U)
#define PWC_LVDCR0_L1NFDIS_POS                         (10U)
#define PWC_LVDCR0_L1NFDIS                             ((uint32_t)0x00000400U)
#define PWC_LVDCR0_L1NMIS_POS                          (11U)
#define PWC_LVDCR0_L1NMIS                              ((uint32_t)0x00000800U)
#define PWC_LVDCR0_L1IRS_POS                           (12U)
#define PWC_LVDCR0_L1IRS                               ((uint32_t)0x00001000U)
#define PWC_LVDCR0_L1IRE_POS                           (13U)
#define PWC_LVDCR0_L1IRE                               ((uint32_t)0x00002000U)
#define PWC_LVDCR0_L1CMPOE_POS                         (14U)
#define PWC_LVDCR0_L1CMPOE                             ((uint32_t)0x00004000U)
#define PWC_LVDCR0_L1EN_POS                            (15U)
#define PWC_LVDCR0_L1EN                                ((uint32_t)0x00008000U)
#define PWC_LVDCR0_EXVCCINEN_POS                       (16U)
#define PWC_LVDCR0_EXVCCINEN                           ((uint32_t)0x00010000U)
#define PWC_LVDCR0_L2IEGS_POS                          (18U)
#define PWC_LVDCR0_L2IEGS                              ((uint32_t)0x000C0000U)
#define PWC_LVDCR0_L2IEGS_0                            ((uint32_t)0x00040000U)
#define PWC_LVDCR0_L2IEGS_1                            ((uint32_t)0x00080000U)
#define PWC_LVDCR0_L2LVL_POS                           (20U)
#define PWC_LVDCR0_L2LVL                               ((uint32_t)0x00F00000U)
#define PWC_LVDCR0_L2LVL_0                             ((uint32_t)0x00100000U)
#define PWC_LVDCR0_L2LVL_1                             ((uint32_t)0x00200000U)
#define PWC_LVDCR0_L2LVL_2                             ((uint32_t)0x00400000U)
#define PWC_LVDCR0_L2LVL_3                             ((uint32_t)0x00800000U)
#define PWC_LVDCR0_L2NFS_POS                           (24U)
#define PWC_LVDCR0_L2NFS                               ((uint32_t)0x03000000U)
#define PWC_LVDCR0_L2NFS_0                             ((uint32_t)0x01000000U)
#define PWC_LVDCR0_L2NFS_1                             ((uint32_t)0x02000000U)
#define PWC_LVDCR0_L2NFDIS_POS                         (26U)
#define PWC_LVDCR0_L2NFDIS                             ((uint32_t)0x04000000U)
#define PWC_LVDCR0_L2NMIS_POS                          (27U)
#define PWC_LVDCR0_L2NMIS                              ((uint32_t)0x08000000U)
#define PWC_LVDCR0_L2IRS_POS                           (28U)
#define PWC_LVDCR0_L2IRS                               ((uint32_t)0x10000000U)
#define PWC_LVDCR0_L2IRE_POS                           (29U)
#define PWC_LVDCR0_L2IRE                               ((uint32_t)0x20000000U)
#define PWC_LVDCR0_L2CMPOE_POS                         (30U)
#define PWC_LVDCR0_L2CMPOE                             ((uint32_t)0x40000000U)
#define PWC_LVDCR0_L2EN_POS                            (31U)
#define PWC_LVDCR0_L2EN                                ((uint32_t)0x80000000U)

/*  Bit definition for PWC_LVDCSR1 register  */
#define PWC_LVDCSR1_L1MON_POS                          (0U)
#define PWC_LVDCSR1_L1MON                              ((uint8_t)0x01U)
#define PWC_LVDCSR1_L2MON_POS                          (1U)
#define PWC_LVDCSR1_L2MON                              ((uint8_t)0x02U)
#define PWC_LVDCSR1_L1DETF_POS                         (2U)
#define PWC_LVDCSR1_L1DETF                             ((uint8_t)0x04U)
#define PWC_LVDCSR1_L2DETF_POS                         (3U)
#define PWC_LVDCSR1_L2DETF                             ((uint8_t)0x08U)
#define PWC_LVDCSR1_L0MON_POS                          (4U)
#define PWC_LVDCSR1_L0MON                              ((uint8_t)0x10U)
#define PWC_LVDCSR1_L0CMPOE_POS                        (7U)
#define PWC_LVDCSR1_L0CMPOE                            ((uint8_t)0x80U)

/*  Bit definition for PWC_FPRC register  */
#define PWC_FPRC_CKRWE_POS                             (0U)
#define PWC_FPRC_CKRWE                                 ((uint16_t)0x0001U)
#define PWC_FPRC_PWRWE_POS                             (1U)
#define PWC_FPRC_PWRWE                                 ((uint16_t)0x0002U)
#define PWC_FPRC_FPRCB2_POS                            (2U)
#define PWC_FPRC_FPRCB2                                ((uint16_t)0x0004U)
#define PWC_FPRC_LVRWE_POS                             (3U)
#define PWC_FPRC_LVRWE                                 ((uint16_t)0x0008U)
#define PWC_FPRC_FPRCB4_POS                            (4U)
#define PWC_FPRC_FPRCB4                                ((uint16_t)0x0010U)
#define PWC_FPRC_FPRCB5_POS                            (5U)
#define PWC_FPRC_FPRCB5                                ((uint16_t)0x0020U)
#define PWC_FPRC_FPRCB6_POS                            (6U)
#define PWC_FPRC_FPRCB6                                ((uint16_t)0x0040U)
#define PWC_FPRC_FPRCB7_POS                            (7U)
#define PWC_FPRC_FPRCB7                                ((uint16_t)0x0080U)
#define PWC_FPRC_FPRCWE_POS                            (8U)
#define PWC_FPRC_FPRCWE                                ((uint16_t)0xFF00U)
#define PWC_FPRC_FPRCWE_0                              ((uint16_t)0x0100U)
#define PWC_FPRC_FPRCWE_1                              ((uint16_t)0x0200U)
#define PWC_FPRC_FPRCWE_2                              ((uint16_t)0x0400U)
#define PWC_FPRC_FPRCWE_3                              ((uint16_t)0x0800U)
#define PWC_FPRC_FPRCWE_4                              ((uint16_t)0x1000U)
#define PWC_FPRC_FPRCWE_5                              ((uint16_t)0x2000U)
#define PWC_FPRC_FPRCWE_6                              ((uint16_t)0x4000U)
#define PWC_FPRC_FPRCWE_7                              ((uint16_t)0x8000U)

/*  Bit definition for PWC_DBGC register  */
#define PWC_DBGC_DBGEN_POS                             (0U)
#define PWC_DBGC_DBGEN                                 ((uint16_t)0x0001U)
#define PWC_DBGC_TRSTF_POS                             (15U)
#define PWC_DBGC_TRSTF                                 ((uint16_t)0x8000U)

/*  Bit definition for PWC_RSTF0 register  */
#define PWC_RSTF0_PORF_POS                             (0U)
#define PWC_RSTF0_PORF                                 ((uint16_t)0x0001U)
#define PWC_RSTF0_PINRF_POS                            (1U)
#define PWC_RSTF0_PINRF                                ((uint16_t)0x0002U)
#define PWC_RSTF0_LV0RF_POS                            (2U)
#define PWC_RSTF0_LV0RF                                ((uint16_t)0x0004U)
#define PWC_RSTF0_LV1RF_POS                            (3U)
#define PWC_RSTF0_LV1RF                                ((uint16_t)0x0008U)
#define PWC_RSTF0_LV2RF_POS                            (4U)
#define PWC_RSTF0_LV2RF                                ((uint16_t)0x0010U)
#define PWC_RSTF0_SWDRF_POS                            (5U)
#define PWC_RSTF0_SWDRF                                ((uint16_t)0x0020U)
#define PWC_RSTF0_WDRF_POS                             (6U)
#define PWC_RSTF0_WDRF                                 ((uint16_t)0x0040U)
#define PWC_RSTF0_CKFERF_POS                           (7U)
#define PWC_RSTF0_CKFERF                               ((uint16_t)0x0080U)
#define PWC_RSTF0_SWRF_POS                             (8U)
#define PWC_RSTF0_SWRF                                 ((uint16_t)0x0100U)
#define PWC_RSTF0_RAMPERF_POS                          (10U)
#define PWC_RSTF0_RAMPERF                              ((uint16_t)0x0400U)
#define PWC_RSTF0_CPULKUPRF_POS                        (12U)
#define PWC_RSTF0_CPULKUPRF                            ((uint16_t)0x1000U)
#define PWC_RSTF0_XTALERF_POS                          (13U)
#define PWC_RSTF0_XTALERF                              ((uint16_t)0x2000U)
#define PWC_RSTF0_MULTIRF_POS                          (14U)
#define PWC_RSTF0_MULTIRF                              ((uint16_t)0x4000U)
#define PWC_RSTF0_CLRF_POS                             (15U)
#define PWC_RSTF0_CLRF                                 ((uint16_t)0x8000U)


