levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for SPI_CFG2 register  */
#define SPI_CFG2_CPHA_POS                              (0U)
#define SPI_CFG2_CPHA                                  ((uint32_t)0x00000001U)
#define SPI_CFG2_CPOL_POS                              (1U)
#define SPI_CFG2_CPOL                                  ((uint32_t)0x00000002U)
#define SPI_CFG2_MBR_POS                               (2U)
#define SPI_CFG2_MBR                                   ((uint32_t)0x0000001CU)
#define SPI_CFG2_MBR_0                                 ((uint32_t)0x00000004U)
#define SPI_CFG2_MBR_1                                 ((uint32_t)0x00000008U)
#define SPI_CFG2_MBR_2                                 ((uint32_t)0x00000010U)
#define SPI_CFG2_DSIZE_POS                             (8U)
#define SPI_CFG2_DSIZE                                 ((uint32_t)0x00000100U)
#define SPI_CFG2_LSBF_POS                              (12U)
#define SPI_CFG2_LSBF                                  ((uint32_t)0x00001000U)


/*******************************************************************************
                Bit definition for Peripheral SWDT
*******************************************************************************/
/*  Bit definition for SWDT_SR register  */
#define SWDT_SR_CNT_POS                                (0U)
#define SWDT_SR_CNT                                    ((uint32_t)0x0000FFFFU)
#define SWDT_SR_CNT_0                                  ((uint32_t)0x00000001U)
#define SWDT_SR_CNT_1                                  ((uint32_t)0x00000002U)
#define SWDT_SR_CNT_2                                  ((uint32_t)0x00000004U)
#define SWDT_SR_CNT_3                                  ((uint32_t)0x00000008U)
#define SWDT_SR_CNT_4                                  ((uint32_t)0x00000010U)
#define SWDT_SR_CNT_5                                  ((uint32_t)0x00000020U)
#define SWDT_SR_CNT_6                                  ((uint32_t)0x00000040U)
#define SWDT_SR_CNT_7                                  ((uint32_t)0x00000080U)
#define SWDT_SR_CNT_8                                  ((uint32_t)0x00000100U)
#define SWDT_SR_CNT_9                                  ((uint32_t)0x00000200U)
#define SWDT_SR_CNT_10                                 ((uint32_t)0x00000400U)
#define SWDT_SR_CNT_11                                 ((uint32_t)0x00000800U)
#define SWDT_SR_CNT_12                                 ((uint32_t)0x00001000U)
#define SWDT_SR_CNT_13                                 ((uint32_t)0x00002000U)
#define SWDT_SR_CNT_14                                 ((uint32_t)0x00004000U)
#define SWDT_SR_CNT_15                                 ((uint32_t)0x00008000U)
#define SWDT_SR_UDF_POS                                (16U)
#define SWDT_SR_UDF                                    ((uint32_t)0x00010000U)
#define SWDT_SR_REF_POS                                (17U)
#define SWDT_SR_REF                                    ((uint32_t)0x00020000U)

/*  Bit definition for SWDT_RR register  */
#define SWDT_RR_RF_POS                                 (0U)
#define SWDT_RR_RF                                     ((uint32_t)0x0000FFFFU)
#define SWDT_RR_RF_0                                   ((uint32_t)0x00000001U)
#define SWDT_RR_RF_1                                   ((uint32_t)0x00000002U)
#define SWDT_RR_RF_2                                   ((uint32_t)0x00000004U)
#define SWDT_RR_RF_3                                   ((uint32_t)0x00000008U)
#define SWDT_RR_RF_4                                   ((uint32_t)0x00000010U)
#define SWDT_RR_RF_5                                   ((uint32_t)0x00000020U)
#define SWDT_RR_RF_6                                   ((uint32_t)0x00000040U)
#define SWDT_RR_RF_7                                   ((uint32_t)0x00000080U)
#define SWDT_RR_RF_8                                   ((uint32_t)0x00000100U)
#define SWDT_RR_RF_9                                   ((uint32_t)0x00000200U)
#define SWDT_RR_RF_10                                  ((uint32_t)0x00000400U)
#define SWDT_RR_RF_11                                  ((uint32_t)0x00000800U)
#define SWDT_RR_RF_12                                  ((uint32_t)0x00001000U)
#define SWDT_RR_RF_13                                  ((uint32_t)0x00002000U)
#define SWDT_RR_RF_14                                  ((uint32_t)0x00004000U)
#define SWDT_RR_RF_15                                  ((uint32_t)0x00008000U)


/*******************************************************************************
                Bit definition for Peripheral TMR0
*******************************************************************************/
/*  Bit definition for TMR0_CNTAR register  */
#define TMR0_CNTAR_CNTA_POS                            (0U)
#define TMR0_CNTAR_CNTA                                ((uint32_t)0x0000FFFFU)
#define TMR0_CNTAR_CNTA_0                              ((uint32_t)0x00000001U)
#define TMR0_CNTAR_CNTA_1                              ((uint32_t)0x00000002U)
#define TMR0_CNTAR_CNTA_2                              ((uint32_t)0x00000004U)
#define TMR0_CNTAR_CNTA_3                              ((uint32_t)0x00000008U)
#define TMR0_CNTAR_CNTA_4                              ((uint32_t)0x00000010U)
#define TMR0_CNTAR_CNTA_5                              ((uint32_t)0x00000020U)
#define TMR0_CNTAR_CNTA_6                              ((uint32_t)0x00000040U)
#define TMR0_CNTAR_CNTA_7                              ((uint32_t)0x00000080U)
#define TMR0_CNTAR_CNTA_8                              ((uint32_t)0x00000100U)
#define TMR0_CNTAR_CNTA_9                              ((uint32_t)0x00000200U)
#define TMR0_CNTAR_CNTA_10                             ((uint32_t)0x00000400U)
#define TMR0_CNTAR_CNTA_11                             ((uint32_t)0x00000800U)
#define TMR0_CNTAR_CNTA_12                             ((uint32_t)0x00001000U)
#define TMR0_CNTAR_CNTA_13                             ((uint32_t)0x00002000U)
#define TMR0_CNTAR_CNTA_14                             ((uint32_t)0x00004000U)
#define TMR0_CNTAR_CNTA_15                             ((uint32_t)0x00008000U)

/*  Bit definition for TMR0_CNTBR register  */
#define TMR0_CNTBR_CNTB_POS                            (0U)
#define TMR0_CNTBR_CNTB                                ((uint32_t)0x0000FFFFU)
#define TMR0_CNTBR_CNTB_0                              ((uint32_t)0x00000001U)
#define TMR0_CNTBR_CNTB_1                              ((uint32_t)0x00000002U)
#define TMR0_CNTBR_CNTB_2                              ((uint32_t)0x00000004U)
#define TMR0_CNTBR_CNTB_3                              ((uint32_t)0x00000008U)
#define TMR0_CNTBR_CNTB_4                              ((uint32_t)0x00000010U)
#define TMR0_CNTBR_CNTB_5                              ((uint32_t)0x00000020U)
#define TMR0_CNTBR_CNTB_6                              ((uint32_t)0x00000040U)
#define TMR0_CNTBR_CNTB_7                              ((uint32_t)0x00000080U)
#define TMR0_CNTBR_CNTB_8                              ((uint32_t)0x00000100U)
#define TMR0_CNTBR_CNTB_9                              ((uint32_t)0x00000200U)
#define TMR0_CNTBR_CNTB_10                             ((uint32_t)0x00000400U)
#define TMR0_CNTBR_CNTB_11                             ((uint32_t)0x00000800U)
#define TMR0_CNTBR_CNTB_12                             ((uint32_t)0x00001000U)
#define TMR0_CNTBR_CNTB_13                             ((uint32_t)0x00002000U)
#define TMR0_CNTBR_CNTB_14                             ((uint32_t)0x00004000U)
#define TMR0_CNTBR_CNTB_15                             ((uint32_t)0x00008000U)

/*  Bit definition for TMR0_CMPAR register  */
#define TMR0_CMPAR_CMPA_POS                            (0U)
#define TMR0_CMPAR_CMPA                                ((uint32_t)0x0000FFFFU)
#define TMR0_CMPAR_CMPA_0                              ((uint32_t)0x00000001U)
#define TMR0_CMPAR_CMPA_1                              ((uint32_t)0x00000002U)
#define TMR0_CMPAR_CMPA_2                              ((uint32_t)0x00000004U)
#define TMR0_CMPAR_CMPA_3                              ((uint32_t)0x00000008U)
#define TMR0_CMPAR_CMPA_4                              ((uint32_t)0x00000010U)
#define TMR0_CMPAR_CMPA_5                              ((uint32_t)0x00000020U)
#define TMR0_CMPAR_CMPA_6                              ((uint32_t)0x00000040U)
#define TMR0_CMPAR_CMPA_7                              ((uint32_t)0x00000080U)
#define TMR0_CMPAR_CMPA_8                              ((uint32_t)0x00000100U)
#define TMR0_CMPAR_CMPA_9                              ((uint32_t)0x00000200U)
#define TMR0_CMPAR_CMPA_10                             ((uint32_t)0x00000400U)
#define TMR0_CMPAR_CMPA_11                             ((uint32_t)0x00000800U)
#define TMR0_CMPAR_CMPA_12                             ((uint32_t)0x00001000U)
#define TMR0_CMPAR_CMPA_13                             ((uint32_t)0x00002000U)
#define TMR0_CMPAR_CMPA_14                             ((uint32_t)0x00004000U)
#define TMR0_CMPAR_CMPA_15                             ((uint32_t)0x00008000U)

/*  Bit definition for TMR0_CMPBR register  */
#define TMR0_CMPBR_CMPB_POS                            (0U)
#define TMR0_CMPBR_CMPB                                ((uint32_t)0x0000FFFFU)
#define TMR0_CMPBR_CMPB_0                              ((uint32_t)0x00000001U)
#define TMR0_CMPBR_CMPB_1                              ((uint32_t)0x00000002U)
#define TMR0_CMPBR_CMPB_2                              ((uint32_t)0x00000004U)
#define TMR0_CMPBR_CMPB_3                              ((uint32_t)0x00000008U)
#define TMR0_CMPBR_CMPB_4                              ((uint32_t)0x00000010U)
#define TMR0_CMPBR_CMPB_5                              ((uint32_t)0x00000020U)
#define TMR0_CMPBR_CMPB_6                              ((uint32_t)0x00000040U)
#define TMR0_CMPBR_CMPB_7                              ((uint32_t)0x00000080U)
#define TMR0_CMPBR_CMPB_8                              ((uint32_t)0x00000100U)
#define TMR0_CMPBR_CMPB_9                              ((uint32_t)0x00000200U)
#define TMR0_CMPBR_CMPB_10                             ((uint32_t)0x00000400U)
#define TMR0_CMPBR_CMPB_11                             ((uint32_t)0x00000800U)
#define TMR0_CMPBR_CMPB_12                             ((uint32_t)0x00001000U)
#define TMR0_CMPBR_CMPB_13                             ((uint32_t)0x00002000U)
#define TMR0_CMPBR_CMPB_14                             ((uint32_t)0x00004000U)
#define TMR0_CMPBR_CMPB_15                             ((uint32_t)0x00008000U)

/*  Bit definition for TMR0_BCONR register  */
#define TMR0_BCONR_CSTA_POS                            (0U)
#define TMR0_BCONR_CSTA                                ((uint32_t)0x00000001U)
#define TMR0_BCONR_CAPMDA_POS                          (1U)
#define TMR0_BCONR_CAPMDA                              ((uint32_t)0x00000002U)
#define TMR0_BCONR_INTENA_POS                          (2U)
#define TMR0_BCONR_INTENA                              ((uint32_t)0x00000004U)
#define TMR0_BCONR_CKDIVA_POS                          (4U)
#define TMR0_BCONR_CKDIVA                              ((uint32_t)0x000000F0U)
#define TMR0_BCONR_CKDIVA_0                            ((uint32_t)0x00000010U)
#define TMR0_BCONR_CKDIVA_1                            ((uint32_t)0x00000020U)
#define TMR0_BCONR_CKDIVA_2                            ((uint32_t)0x00000040U)
#define TMR0_BCONR_CKDIVA_3                            ((uint32_t)0x00000080U)
#define TMR0_BCONR_SYNSA_POS                           (8U)
#define TMR0_BCONR_SYNSA                               ((uint32_t)0x00000100U)
#define TMR0_BCONR_SYNCLKA_POS                         (9U)
#define TMR0_BCONR_SYNCLKA                             ((uint32_t)0x00000200U)
#define TMR0_BCONR_ASYNCLKA_POS                        (10U)
#define TMR0_BCONR_ASYNCLKA                            ((uint32_t)0x00000400U)
#define TMR0_BCONR_HSTAA_POS                           (12U)
#define TMR0_BCONR_HSTAA                               ((uint32_t)0x00001000U)
#define TMR0_BCONR_HSTPA_POS                           (13U)
#define TMR0_BCONR_HSTPA                               ((uint32_t)0x00002000U)
#define TMR0_BCONR_HCLEA_POS                           (14U)
#define TMR0_BCONR_HCLEA                               ((uint32_t)0x00004000U)
#define TMR0_BCONR_HICPA_POS                           (15U)
#define TMR0_BCONR_HICPA                               ((uint32_t)0x00008000U)
#define TMR0_BCONR_CSTB_POS                            (16U)
#define TMR0_BCONR_CSTB                                ((uint32_t)0x00010000U)
#define TMR0_BCONR_CAPMDB_POS                          (17U)
#define TMR0_BCONR_CAPMDB                              ((uint32_t)0x00020000U)
#define TMR0_BCONR_INTENB_POS                          (18U)
#define TMR0_BCONR_INTENB                              ((uint32_t)0x00040000U)
#define TMR0_BCONR_CKDIVB_POS                          (20U)
#define TMR0_BCONR_CKDIVB                              ((uint32_t)0x00F00000U)
#define TMR0_BCONR_CKDIVB_0                            ((uint32_t)0x00100000U)
#define TMR0_BCONR_CKDIVB_1                            ((uint32_t)0x00200000U)
#define TMR0_BCONR_CKDIVB_2                            ((uint32_t)0x00400000U)
#define TMR0_BCONR_CKDIVB_3                            ((uint32_t)0x00800000U)
#define TMR0_BCONR_SYNSB_POS                           (24U)
#define TMR0_BCONR_SYNSB                               ((uint32_t)0x01000000U)
#define TMR0_BCONR_SYNCLKB_POS                         (25U)
#define TMR0_BCONR_SYNCLKB                             ((uint32_t)0x02000000U)
#define TMR0_BCONR_ASYNCLKB_POS                        (26U)
#define TMR0_BCONR_ASYNCLKB                            ((uint32_t)0x04000000U)
#define TMR0_BCONR_HSTAB_POS                           (28U)
#define TMR0_BCONR_HSTAB                               ((uint32_t)0x10000000U)
#define TMR0_BCONR_HSTPB_POS                           (29U)
#define TMR0_BCONR_HSTPB                               ((uint32_t)0x20000000U)
#define TMR0_BCONR_HCLEB_POS                           (30U)
#define TMR0_BCONR_HCLEB                               ((uint32_t)0x40000000U)
#define TMR0_BCONR_HICPB_POS                           (31U)
#define TMR0_BCONR_HICPB                               ((uint32_t)0x80000000U)

/*  Bit definition for TMR0_STFLR register  */
#define TMR0_STFLR_CMFA_POS                            (0U)
#define TMR0_STFLR_CMFA                                ((uint32_t)0x00000001U)
#define TMR0_STFLR_CMFB_POS                            (16U)
#define TMR0_STFLR_CMFB                                ((uint32_t)0x00010000U)


