levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for TMR4_CNTR register  */
#define TMR4_CNTR                                      ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_CCSR register  */
#define TMR4_CCSR_CKDIV_POS                            (0U)
#define TMR4_CCSR_CKDIV                                ((uint16_t)0x000FU)
#define TMR4_CCSR_CKDIV_0                              ((uint16_t)0x0001U)
#define TMR4_CCSR_CKDIV_1                              ((uint16_t)0x0002U)
#define TMR4_CCSR_CKDIV_2                              ((uint16_t)0x0004U)
#define TMR4_CCSR_CKDIV_3                              ((uint16_t)0x0008U)
#define TMR4_CCSR_CLEAR_POS                            (4U)
#define TMR4_CCSR_CLEAR                                ((uint16_t)0x0010U)
#define TMR4_CCSR_MODE_POS                             (5U)
#define TMR4_CCSR_MODE                                 ((uint16_t)0x0020U)
#define TMR4_CCSR_STOP_POS                             (6U)
#define TMR4_CCSR_STOP                                 ((uint16_t)0x0040U)
#define TMR4_CCSR_BUFEN_POS                            (7U)
#define TMR4_CCSR_BUFEN                                ((uint16_t)0x0080U)
#define TMR4_CCSR_IRQPEN_POS                           (8U)
#define TMR4_CCSR_IRQPEN                               ((uint16_t)0x0100U)
#define TMR4_CCSR_IRQPF_POS                            (9U)
#define TMR4_CCSR_IRQPF                                ((uint16_t)0x0200U)
#define TMR4_CCSR_IRQZEN_POS                           (13U)
#define TMR4_CCSR_IRQZEN                               ((uint16_t)0x2000U)
#define TMR4_CCSR_IRQZF_POS                            (14U)
#define TMR4_CCSR_IRQZF                                ((uint16_t)0x4000U)
#define TMR4_CCSR_ECKEN_POS                            (15U)
#define TMR4_CCSR_ECKEN                                ((uint16_t)0x8000U)

/*  Bit definition for TMR4_CVPR register  */
#define TMR4_CVPR_ZIM_POS                              (0U)
#define TMR4_CVPR_ZIM                                  ((uint16_t)0x000FU)
#define TMR4_CVPR_ZIM_0                                ((uint16_t)0x0001U)
#define TMR4_CVPR_ZIM_1                                ((uint16_t)0x0002U)
#define TMR4_CVPR_ZIM_2                                ((uint16_t)0x0004U)
#define TMR4_CVPR_ZIM_3                                ((uint16_t)0x0008U)
#define TMR4_CVPR_PIM_POS                              (4U)
#define TMR4_CVPR_PIM                                  ((uint16_t)0x00F0U)
#define TMR4_CVPR_PIM_0                                ((uint16_t)0x0010U)
#define TMR4_CVPR_PIM_1                                ((uint16_t)0x0020U)
#define TMR4_CVPR_PIM_2                                ((uint16_t)0x0040U)
#define TMR4_CVPR_PIM_3                                ((uint16_t)0x0080U)
#define TMR4_CVPR_ZIC_POS                              (8U)
#define TMR4_CVPR_ZIC                                  ((uint16_t)0x0F00U)
#define TMR4_CVPR_ZIC_0                                ((uint16_t)0x0100U)
#define TMR4_CVPR_ZIC_1                                ((uint16_t)0x0200U)
#define TMR4_CVPR_ZIC_2                                ((uint16_t)0x0400U)
#define TMR4_CVPR_ZIC_3                                ((uint16_t)0x0800U)
#define TMR4_CVPR_PIC_POS                              (12U)
#define TMR4_CVPR_PIC                                  ((uint16_t)0xF000U)
#define TMR4_CVPR_PIC_0                                ((uint16_t)0x1000U)
#define TMR4_CVPR_PIC_1                                ((uint16_t)0x2000U)
#define TMR4_CVPR_PIC_2                                ((uint16_t)0x4000U)
#define TMR4_CVPR_PIC_3                                ((uint16_t)0x8000U)

/*  Bit definition for TMR4_PFSRU register  */
#define TMR4_PFSRU                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PDARU register  */
#define TMR4_PDARU                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PDBRU register  */
#define TMR4_PDBRU                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PFSRV register  */
#define TMR4_PFSRV                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PDARV register  */
#define TMR4_PDARV                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PDBRV register  */
#define TMR4_PDBRV                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PFSRW register  */
#define TMR4_PFSRW                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PDARW register  */
#define TMR4_PDARW                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_PDBRW register  */
#define TMR4_PDBRW                                     ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_POCR register  */
#define TMR4_POCR_DIVCK_POS                            (0U)
#define TMR4_POCR_DIVCK                                ((uint16_t)0x0007U)
#define TMR4_POCR_DIVCK_0                              ((uint16_t)0x0001U)
#define TMR4_POCR_DIVCK_1                              ((uint16_t)0x0002U)
#define TMR4_POCR_DIVCK_2                              ((uint16_t)0x0004U)
#define TMR4_POCR_PWMMD_POS                            (4U)
#define TMR4_POCR_PWMMD                                ((uint16_t)0x0030U)
#define TMR4_POCR_PWMMD_0                              ((uint16_t)0x0010U)
#define TMR4_POCR_PWMMD_1                              ((uint16_t)0x0020U)
#define TMR4_POCR_LVLS_POS                             (6U)
#define TMR4_POCR_LVLS                                 ((uint16_t)0x00C0U)
#define TMR4_POCR_LVLS_0                               ((uint16_t)0x0040U)
#define TMR4_POCR_LVLS_1                               ((uint16_t)0x0080U)

/*  Bit definition for TMR4_RCSR register  */
#define TMR4_RCSR_RTIDU_POS                            (0U)
#define TMR4_RCSR_RTIDU                                ((uint16_t)0x0001U)
#define TMR4_RCSR_RTIDV_POS                            (1U)
#define TMR4_RCSR_RTIDV                                ((uint16_t)0x0002U)
#define TMR4_RCSR_RTIDW_POS                            (2U)
#define TMR4_RCSR_RTIDW                                ((uint16_t)0x0004U)
#define TMR4_RCSR_RTIFU_POS                            (4U)
#define TMR4_RCSR_RTIFU                                ((uint16_t)0x0010U)
#define TMR4_RCSR_RTICU_POS                            (5U)
#define TMR4_RCSR_RTICU                                ((uint16_t)0x0020U)
#define TMR4_RCSR_RTEU_POS                             (6U)
#define TMR4_RCSR_RTEU                                 ((uint16_t)0x0040U)
#define TMR4_RCSR_RTSU_POS                             (7U)
#define TMR4_RCSR_RTSU                                 ((uint16_t)0x0080U)
#define TMR4_RCSR_RTIFV_POS                            (8U)
#define TMR4_RCSR_RTIFV                                ((uint16_t)0x0100U)
#define TMR4_RCSR_RTICV_POS                            (9U)
#define TMR4_RCSR_RTICV                                ((uint16_t)0x0200U)
#define TMR4_RCSR_RTEV_POS                             (10U)
#define TMR4_RCSR_RTEV                                 ((uint16_t)0x0400U)
#define TMR4_RCSR_RTSV_POS                             (11U)
#define TMR4_RCSR_RTSV                                 ((uint16_t)0x0800U)
#define TMR4_RCSR_RTIFW_POS                            (12U)
#define TMR4_RCSR_RTIFW                                ((uint16_t)0x1000U)
#define TMR4_RCSR_RTICW_POS                            (13U)
#define TMR4_RCSR_RTICW                                ((uint16_t)0x2000U)
#define TMR4_RCSR_RTEW_POS                             (14U)
#define TMR4_RCSR_RTEW                                 ((uint16_t)0x4000U)
#define TMR4_RCSR_RTSW_POS                             (15U)
#define TMR4_RCSR_RTSW                                 ((uint16_t)0x8000U)

/*  Bit definition for TMR4_SCCRUH register  */
#define TMR4_SCCRUH                                    ((uint16_t)0xFFFFU)

