levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for TMR4_SCCRUL register  */
#define TMR4_SCCRUL                                    ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRVH register  */
#define TMR4_SCCRVH                                    ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRVL register  */
#define TMR4_SCCRVL                                    ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRWH register  */
#define TMR4_SCCRWH                                    ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCCRWL register  */
#define TMR4_SCCRWL                                    ((uint16_t)0xFFFFU)

/*  Bit definition for TMR4_SCSR register  */
#define TMR4_SCSR_BUFEN_POS                            (0U)
#define TMR4_SCSR_BUFEN                                ((uint16_t)0x0003U)
#define TMR4_SCSR_BUFEN_0                              ((uint16_t)0x0001U)
#define TMR4_SCSR_BUFEN_1                              ((uint16_t)0x0002U)
#define TMR4_SCSR_EVTOS_POS                            (2U)
#define TMR4_SCSR_EVTOS                                ((uint16_t)0x001CU)
#define TMR4_SCSR_EVTOS_0                              ((uint16_t)0x0004U)
#define TMR4_SCSR_EVTOS_1                              ((uint16_t)0x0008U)
#define TMR4_SCSR_EVTOS_2                              ((uint16_t)0x0010U)
#define TMR4_SCSR_LMC_POS                              (5U)
#define TMR4_SCSR_LMC                                  ((uint16_t)0x0020U)
#define TMR4_SCSR_EVTMS_POS                            (8U)
#define TMR4_SCSR_EVTMS                                ((uint16_t)0x0100U)
#define TMR4_SCSR_EVTDS_POS                            (9U)
#define TMR4_SCSR_EVTDS                                ((uint16_t)0x0200U)
#define TMR4_SCSR_DEN_POS                              (12U)
#define TMR4_SCSR_DEN                                  ((uint16_t)0x1000U)
#define TMR4_SCSR_PEN_POS                              (13U)
#define TMR4_SCSR_PEN                                  ((uint16_t)0x2000U)
#define TMR4_SCSR_UEN_POS                              (14U)
#define TMR4_SCSR_UEN                                  ((uint16_t)0x4000U)
#define TMR4_SCSR_ZEN_POS                              (15U)
#define TMR4_SCSR_ZEN                                  ((uint16_t)0x8000U)

/*  Bit definition for TMR4_SCMR register  */
#define TMR4_SCMR_AMC_POS                              (0U)
#define TMR4_SCMR_AMC                                  ((uint16_t)0x000FU)
#define TMR4_SCMR_AMC_0                                ((uint16_t)0x0001U)
#define TMR4_SCMR_AMC_1                                ((uint16_t)0x0002U)
#define TMR4_SCMR_AMC_2                                ((uint16_t)0x0004U)
#define TMR4_SCMR_AMC_3                                ((uint16_t)0x0008U)
#define TMR4_SCMR_MZCE_POS                             (6U)
#define TMR4_SCMR_MZCE                                 ((uint16_t)0x0040U)
#define TMR4_SCMR_MPCE_POS                             (7U)
#define TMR4_SCMR_MPCE                                 ((uint16_t)0x0080U)

/*  Bit definition for TMR4_PSCR register  */
#define TMR4_PSCR_OEUH_POS                             (0U)
#define TMR4_PSCR_OEUH                                 ((uint32_t)0x00000001U)
#define TMR4_PSCR_OEUL_POS                             (1U)
#define TMR4_PSCR_OEUL                                 ((uint32_t)0x00000002U)
#define TMR4_PSCR_OEVH_POS                             (2U)
#define TMR4_PSCR_OEVH                                 ((uint32_t)0x00000004U)
#define TMR4_PSCR_OEVL_POS                             (3U)
#define TMR4_PSCR_OEVL                                 ((uint32_t)0x00000008U)
#define TMR4_PSCR_OEWH_POS                             (4U)
#define TMR4_PSCR_OEWH                                 ((uint32_t)0x00000010U)
#define TMR4_PSCR_OEWL_POS                             (5U)
#define TMR4_PSCR_OEWL                                 ((uint32_t)0x00000020U)
#define TMR4_PSCR_ODT_POS                              (6U)
#define TMR4_PSCR_ODT                                  ((uint32_t)0x000000C0U)
#define TMR4_PSCR_ODT_0                                ((uint32_t)0x00000040U)
#define TMR4_PSCR_ODT_1                                ((uint32_t)0x00000080U)
#define TMR4_PSCR_MOE_POS                              (8U)
#define TMR4_PSCR_MOE                                  ((uint32_t)0x00000100U)
#define TMR4_PSCR_AOE_POS                              (9U)
#define TMR4_PSCR_AOE                                  ((uint32_t)0x00000200U)
#define TMR4_PSCR_OSUH_POS                             (16U)
#define TMR4_PSCR_OSUH                                 ((uint32_t)0x00030000U)
#define TMR4_PSCR_OSUH_0                               ((uint32_t)0x00010000U)
#define TMR4_PSCR_OSUH_1                               ((uint32_t)0x00020000U)
#define TMR4_PSCR_OSUL_POS                             (18U)
#define TMR4_PSCR_OSUL                                 ((uint32_t)0x000C0000U)
#define TMR4_PSCR_OSUL_0                               ((uint32_t)0x00040000U)
#define TMR4_PSCR_OSUL_1                               ((uint32_t)0x00080000U)
#define TMR4_PSCR_OSVH_POS                             (20U)
#define TMR4_PSCR_OSVH                                 ((uint32_t)0x00300000U)
#define TMR4_PSCR_OSVH_0                               ((uint32_t)0x00100000U)
#define TMR4_PSCR_OSVH_1                               ((uint32_t)0x00200000U)
#define TMR4_PSCR_OSVL_POS                             (22U)
#define TMR4_PSCR_OSVL                                 ((uint32_t)0x00C00000U)
#define TMR4_PSCR_OSVL_0                               ((uint32_t)0x00400000U)
#define TMR4_PSCR_OSVL_1                               ((uint32_t)0x00800000U)
#define TMR4_PSCR_OSWH_POS                             (24U)
#define TMR4_PSCR_OSWH                                 ((uint32_t)0x03000000U)
#define TMR4_PSCR_OSWH_0                               ((uint32_t)0x01000000U)
#define TMR4_PSCR_OSWH_1                               ((uint32_t)0x02000000U)
#define TMR4_PSCR_OSWL_POS                             (26U)
#define TMR4_PSCR_OSWL                                 ((uint32_t)0x0C000000U)
#define TMR4_PSCR_OSWL_0                               ((uint32_t)0x04000000U)
#define TMR4_PSCR_OSWL_1                               ((uint32_t)0x08000000U)

/*  Bit definition for TMR4_SCER register  */
#define TMR4_SCER_EVTRS_POS                            (0U)
#define TMR4_SCER_EVTRS                                ((uint16_t)0x0007U)
#define TMR4_SCER_EVTRS_0                              ((uint16_t)0x0001U)
#define TMR4_SCER_EVTRS_1                              ((uint16_t)0x0002U)
#define TMR4_SCER_EVTRS_2                              ((uint16_t)0x0004U)
#define TMR4_SCER_PCTS_POS                             (3U)
#define TMR4_SCER_PCTS                                 ((uint16_t)0x0008U)


