levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*******************************************************************************
                Bit definition for Peripheral TMRA
*******************************************************************************/
/*  Bit definition for TMRA_CNTER register  */
#define TMRA_CNTER_CNT_POS                             (0U)
#define TMRA_CNTER_CNT                                 ((uint16_t)0xFFFFU)
#define TMRA_CNTER_CNT_0                               ((uint16_t)0x0001U)
#define TMRA_CNTER_CNT_1                               ((uint16_t)0x0002U)
#define TMRA_CNTER_CNT_2                               ((uint16_t)0x0004U)
#define TMRA_CNTER_CNT_3                               ((uint16_t)0x0008U)
#define TMRA_CNTER_CNT_4                               ((uint16_t)0x0010U)
#define TMRA_CNTER_CNT_5                               ((uint16_t)0x0020U)
#define TMRA_CNTER_CNT_6                               ((uint16_t)0x0040U)
#define TMRA_CNTER_CNT_7                               ((uint16_t)0x0080U)
#define TMRA_CNTER_CNT_8                               ((uint16_t)0x0100U)
#define TMRA_CNTER_CNT_9                               ((uint16_t)0x0200U)
#define TMRA_CNTER_CNT_10                              ((uint16_t)0x0400U)
#define TMRA_CNTER_CNT_11                              ((uint16_t)0x0800U)
#define TMRA_CNTER_CNT_12                              ((uint16_t)0x1000U)
#define TMRA_CNTER_CNT_13                              ((uint16_t)0x2000U)
#define TMRA_CNTER_CNT_14                              ((uint16_t)0x4000U)
#define TMRA_CNTER_CNT_15                              ((uint16_t)0x8000U)

/*  Bit definition for TMRA_PERAR register  */
#define TMRA_PERAR_PER_POS                             (0U)
#define TMRA_PERAR_PER                                 ((uint16_t)0xFFFFU)
#define TMRA_PERAR_PER_0                               ((uint16_t)0x0001U)
#define TMRA_PERAR_PER_1                               ((uint16_t)0x0002U)
#define TMRA_PERAR_PER_2                               ((uint16_t)0x0004U)
#define TMRA_PERAR_PER_3                               ((uint16_t)0x0008U)
#define TMRA_PERAR_PER_4                               ((uint16_t)0x0010U)
#define TMRA_PERAR_PER_5                               ((uint16_t)0x0020U)
#define TMRA_PERAR_PER_6                               ((uint16_t)0x0040U)
#define TMRA_PERAR_PER_7                               ((uint16_t)0x0080U)
#define TMRA_PERAR_PER_8                               ((uint16_t)0x0100U)
#define TMRA_PERAR_PER_9                               ((uint16_t)0x0200U)
#define TMRA_PERAR_PER_10                              ((uint16_t)0x0400U)
#define TMRA_PERAR_PER_11                              ((uint16_t)0x0800U)
#define TMRA_PERAR_PER_12                              ((uint16_t)0x1000U)
#define TMRA_PERAR_PER_13                              ((uint16_t)0x2000U)
#define TMRA_PERAR_PER_14                              ((uint16_t)0x4000U)
#define TMRA_PERAR_PER_15                              ((uint16_t)0x8000U)

/*  Bit definition for TMRA_CMPAR register  */
#define TMRA_CMPAR_CMP_POS                             (0U)
#define TMRA_CMPAR_CMP                                 ((uint16_t)0xFFFFU)
#define TMRA_CMPAR_CMP_0                               ((uint16_t)0x0001U)
#define TMRA_CMPAR_CMP_1                               ((uint16_t)0x0002U)
#define TMRA_CMPAR_CMP_2                               ((uint16_t)0x0004U)
#define TMRA_CMPAR_CMP_3                               ((uint16_t)0x0008U)
#define TMRA_CMPAR_CMP_4                               ((uint16_t)0x0010U)
#define TMRA_CMPAR_CMP_5                               ((uint16_t)0x0020U)
#define TMRA_CMPAR_CMP_6                               ((uint16_t)0x0040U)
#define TMRA_CMPAR_CMP_7                               ((uint16_t)0x0080U)
#define TMRA_CMPAR_CMP_8                               ((uint16_t)0x0100U)
#define TMRA_CMPAR_CMP_9                               ((uint16_t)0x0200U)
#define TMRA_CMPAR_CMP_10                              ((uint16_t)0x0400U)
#define TMRA_CMPAR_CMP_11                              ((uint16_t)0x0800U)
#define TMRA_CMPAR_CMP_12                              ((uint16_t)0x1000U)
#define TMRA_CMPAR_CMP_13                              ((uint16_t)0x2000U)
#define TMRA_CMPAR_CMP_14                              ((uint16_t)0x4000U)
#define TMRA_CMPAR_CMP_15                              ((uint16_t)0x8000U)

/*  Bit definition for TMRA_BCSTR register  */
#define TMRA_BCSTR_START_POS                           (0U)
#define TMRA_BCSTR_START                               ((uint16_t)0x0001U)
#define TMRA_BCSTR_DIR_POS                             (1U)
#define TMRA_BCSTR_DIR                                 ((uint16_t)0x0002U)
#define TMRA_BCSTR_MODE_POS                            (2U)
#define TMRA_BCSTR_MODE                                ((uint16_t)0x0004U)
#define TMRA_BCSTR_SYNST_POS                           (3U)
#define TMRA_BCSTR_SYNST                               ((uint16_t)0x0008U)
#define TMRA_BCSTR_CKDIV_POS                           (4U)
#define TMRA_BCSTR_CKDIV                               ((uint16_t)0x00F0U)
#define TMRA_BCSTR_CKDIV_0                             ((uint16_t)0x0010U)
#define TMRA_BCSTR_CKDIV_1                             ((uint16_t)0x0020U)
#define TMRA_BCSTR_CKDIV_2                             ((uint16_t)0x0040U)
#define TMRA_BCSTR_CKDIV_3                             ((uint16_t)0x0080U)
#define TMRA_BCSTR_OVSTP_POS                           (8U)
#define TMRA_BCSTR_OVSTP                               ((uint16_t)0x0100U)
#define TMRA_BCSTR_INENOVF_POS                         (12U)
#define TMRA_BCSTR_INENOVF                             ((uint16_t)0x1000U)
#define TMRA_BCSTR_INENUDF_POS                         (13U)
#define TMRA_BCSTR_INENUDF                             ((uint16_t)0x2000U)
#define TMRA_BCSTR_OVFF_POS                            (14U)
#define TMRA_BCSTR_OVFF                                ((uint16_t)0x4000U)
#define TMRA_BCSTR_UDFF_POS                            (15U)
#define TMRA_BCSTR_UDFF                                ((uint16_t)0x8000U)

