levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for TMRA_PCONR register  */
#define TMRA_PCONR_STAC_POS                            (0U)
#define TMRA_PCONR_STAC                                ((uint16_t)0x0003U)
#define TMRA_PCONR_STAC_0                              ((uint16_t)0x0001U)
#define TMRA_PCONR_STAC_1                              ((uint16_t)0x0002U)
#define TMRA_PCONR_STPC_POS                            (2U)
#define TMRA_PCONR_STPC                                ((uint16_t)0x000CU)
#define TMRA_PCONR_STPC_0                              ((uint16_t)0x0004U)
#define TMRA_PCONR_STPC_1                              ((uint16_t)0x0008U)
#define TMRA_PCONR_CMPC_POS                            (4U)
#define TMRA_PCONR_CMPC                                ((uint16_t)0x0030U)
#define TMRA_PCONR_CMPC_0                              ((uint16_t)0x0010U)
#define TMRA_PCONR_CMPC_1                              ((uint16_t)0x0020U)
#define TMRA_PCONR_PERC_POS                            (6U)
#define TMRA_PCONR_PERC                                ((uint16_t)0x00C0U)
#define TMRA_PCONR_PERC_0                              ((uint16_t)0x0040U)
#define TMRA_PCONR_PERC_1                              ((uint16_t)0x0080U)
#define TMRA_PCONR_FORC_POS                            (8U)
#define TMRA_PCONR_FORC                                ((uint16_t)0x0300U)
#define TMRA_PCONR_FORC_0                              ((uint16_t)0x0100U)
#define TMRA_PCONR_FORC_1                              ((uint16_t)0x0200U)
#define TMRA_PCONR_OUTEN_POS                           (12U)
#define TMRA_PCONR_OUTEN                               ((uint16_t)0x1000U)


/*******************************************************************************
                Bit definition for Peripheral TMRB
*******************************************************************************/
/*  Bit definition for TMRB_CNTER register  */
#define TMRB_CNTER_CNT_POS                             (0U)
#define TMRB_CNTER_CNT                                 ((uint16_t)0xFFFFU)
#define TMRB_CNTER_CNT_0                               ((uint16_t)0x0001U)
#define TMRB_CNTER_CNT_1                               ((uint16_t)0x0002U)
#define TMRB_CNTER_CNT_2                               ((uint16_t)0x0004U)
#define TMRB_CNTER_CNT_3                               ((uint16_t)0x0008U)
#define TMRB_CNTER_CNT_4                               ((uint16_t)0x0010U)
#define TMRB_CNTER_CNT_5                               ((uint16_t)0x0020U)
#define TMRB_CNTER_CNT_6                               ((uint16_t)0x0040U)
#define TMRB_CNTER_CNT_7                               ((uint16_t)0x0080U)
#define TMRB_CNTER_CNT_8                               ((uint16_t)0x0100U)
#define TMRB_CNTER_CNT_9                               ((uint16_t)0x0200U)
#define TMRB_CNTER_CNT_10                              ((uint16_t)0x0400U)
#define TMRB_CNTER_CNT_11                              ((uint16_t)0x0800U)
#define TMRB_CNTER_CNT_12                              ((uint16_t)0x1000U)
#define TMRB_CNTER_CNT_13                              ((uint16_t)0x2000U)
#define TMRB_CNTER_CNT_14                              ((uint16_t)0x4000U)
#define TMRB_CNTER_CNT_15                              ((uint16_t)0x8000U)

/*  Bit definition for TMRB_PERAR register  */
#define TMRB_PERAR_PER_POS                             (0U)
#define TMRB_PERAR_PER                                 ((uint16_t)0xFFFFU)
#define TMRB_PERAR_PER_0                               ((uint16_t)0x0001U)
#define TMRB_PERAR_PER_1                               ((uint16_t)0x0002U)
#define TMRB_PERAR_PER_2                               ((uint16_t)0x0004U)
#define TMRB_PERAR_PER_3                               ((uint16_t)0x0008U)
#define TMRB_PERAR_PER_4                               ((uint16_t)0x0010U)
#define TMRB_PERAR_PER_5                               ((uint16_t)0x0020U)
#define TMRB_PERAR_PER_6                               ((uint16_t)0x0040U)
#define TMRB_PERAR_PER_7                               ((uint16_t)0x0080U)
#define TMRB_PERAR_PER_8                               ((uint16_t)0x0100U)
#define TMRB_PERAR_PER_9                               ((uint16_t)0x0200U)
#define TMRB_PERAR_PER_10                              ((uint16_t)0x0400U)
#define TMRB_PERAR_PER_11                              ((uint16_t)0x0800U)
#define TMRB_PERAR_PER_12                              ((uint16_t)0x1000U)
#define TMRB_PERAR_PER_13                              ((uint16_t)0x2000U)
#define TMRB_PERAR_PER_14                              ((uint16_t)0x4000U)
#define TMRB_PERAR_PER_15                              ((uint16_t)0x8000U)

/*  Bit definition for TMRB_CMPAR register  */
#define TMRB_CMPAR_CMP_POS                             (0U)
#define TMRB_CMPAR_CMP                                 ((uint16_t)0xFFFFU)
#define TMRB_CMPAR_CMP_0                               ((uint16_t)0x0001U)
#define TMRB_CMPAR_CMP_1                               ((uint16_t)0x0002U)
#define TMRB_CMPAR_CMP_2                               ((uint16_t)0x0004U)
#define TMRB_CMPAR_CMP_3                               ((uint16_t)0x0008U)
#define TMRB_CMPAR_CMP_4                               ((uint16_t)0x0010U)
#define TMRB_CMPAR_CMP_5                               ((uint16_t)0x0020U)
#define TMRB_CMPAR_CMP_6                               ((uint16_t)0x0040U)
#define TMRB_CMPAR_CMP_7                               ((uint16_t)0x0080U)
#define TMRB_CMPAR_CMP_8                               ((uint16_t)0x0100U)
#define TMRB_CMPAR_CMP_9                               ((uint16_t)0x0200U)
#define TMRB_CMPAR_CMP_10                              ((uint16_t)0x0400U)
#define TMRB_CMPAR_CMP_11                              ((uint16_t)0x0800U)
#define TMRB_CMPAR_CMP_12                              ((uint16_t)0x1000U)
#define TMRB_CMPAR_CMP_13                              ((uint16_t)0x2000U)
#define TMRB_CMPAR_CMP_14                              ((uint16_t)0x4000U)
#define TMRB_CMPAR_CMP_15                              ((uint16_t)0x8000U)

/*  Bit definition for TMRB_BCSTR register  */
#define TMRB_BCSTR_START_POS                           (0U)
#define TMRB_BCSTR_START                               ((uint16_t)0x0001U)
#define TMRB_BCSTR_DIR_POS                             (1U)
#define TMRB_BCSTR_DIR                                 ((uint16_t)0x0002U)
#define TMRB_BCSTR_MODE_POS                            (2U)
#define TMRB_BCSTR_MODE                                ((uint16_t)0x0004U)
#define TMRB_BCSTR_CKDIV_POS                           (4U)
#define TMRB_BCSTR_CKDIV                               ((uint16_t)0x00F0U)
#define TMRB_BCSTR_CKDIV_0                             ((uint16_t)0x0010U)
#define TMRB_BCSTR_CKDIV_1                             ((uint16_t)0x0020U)
#define TMRB_BCSTR_CKDIV_2                             ((uint16_t)0x0040U)
#define TMRB_BCSTR_CKDIV_3                             ((uint16_t)0x0080U)
#define TMRB_BCSTR_OVSTP_POS                           (8U)
#define TMRB_BCSTR_OVSTP                               ((uint16_t)0x0100U)
#define TMRB_BCSTR_INENOVF_POS                         (12U)
#define TMRB_BCSTR_INENOVF                             ((uint16_t)0x1000U)
#define TMRB_BCSTR_INENUDF_POS                         (13U)
#define TMRB_BCSTR_INENUDF                             ((uint16_t)0x2000U)
#define TMRB_BCSTR_OVFF_POS                            (14U)
#define TMRB_BCSTR_OVFF                                ((uint16_t)0x4000U)
#define TMRB_BCSTR_UDFF_POS                            (15U)
#define TMRB_BCSTR_UDFF                                ((uint16_t)0x8000U)

/*  Bit definition for TMRB_HCONR register  */
#define TMRB_HCONR_HSTA0_POS                           (0U)
#define TMRB_HCONR_HSTA0                               ((uint16_t)0x0001U)
#define TMRB_HCONR_HSTA1_POS                           (1U)
#define TMRB_HCONR_HSTA1                               ((uint16_t)0x0002U)
#define TMRB_HCONR_HSTA2_POS                           (2U)
#define TMRB_HCONR_HSTA2                               ((uint16_t)0x0004U)
#define TMRB_HCONR_HSTP0_POS                           (4U)
#define TMRB_HCONR_HSTP0                               ((uint16_t)0x0010U)
#define TMRB_HCONR_HSTP1_POS                           (5U)
#define TMRB_HCONR_HSTP1                               ((uint16_t)0x0020U)
#define TMRB_HCONR_HSTP2_POS                           (6U)
#define TMRB_HCONR_HSTP2                               ((uint16_t)0x0040U)
#define TMRB_HCONR_HCLE0_POS                           (8U)
#define TMRB_HCONR_HCLE0                               ((uint16_t)0x0100U)
#define TMRB_HCONR_HCLE1_POS                           (9U)
#define TMRB_HCONR_HCLE1                               ((uint16_t)0x0200U)
#define TMRB_HCONR_HCLE2_POS                           (10U)
#define TMRB_HCONR_HCLE2                               ((uint16_t)0x0400U)
#define TMRB_HCONR_HCLE5_POS                           (14U)
#define TMRB_HCONR_HCLE5                               ((uint16_t)0x4000U)
#define TMRB_HCONR_HCLE6_POS                           (15U)
#define TMRB_HCONR_HCLE6                               ((uint16_t)0x8000U)

/*  Bit definition for TMRB_HCUPR register  */
#define TMRB_HCUPR_HCUP8_POS                           (8U)
#define TMRB_HCUPR_HCUP8                               ((uint16_t)0x0100U)
#define TMRB_HCUPR_HCUP9_POS                           (9U)
#define TMRB_HCUPR_HCUP9                               ((uint16_t)0x0200U)
#define TMRB_HCUPR_HCUP10_POS                          (10U)
#define TMRB_HCUPR_HCUP10                              ((uint16_t)0x0400U)

/*  Bit definition for TMRB_HCDOR register  */
#define TMRB_HCDOR_HCDO8_POS                           (8U)
#define TMRB_HCDOR_HCDO8                               ((uint16_t)0x0100U)
#define TMRB_HCDOR_HCDO9_POS                           (9U)
#define TMRB_HCDOR_HCDO9                               ((uint16_t)0x0200U)
#define TMRB_HCDOR_HCDO10_POS                          (10U)
#define TMRB_HCDOR_HCDO10                              ((uint16_t)0x0400U)

/*  Bit definition for TMRB_ICONR register  */
#define TMRB_ICONR_ITEN1_POS                           (0U)
#define TMRB_ICONR_ITEN1                               ((uint16_t)0x0001U)
#define TMRB_ICONR_ITEN2_POS                           (1U)
#define TMRB_ICONR_ITEN2                               ((uint16_t)0x0002U)
#define TMRB_ICONR_ITEN3_POS                           (2U)
#define TMRB_ICONR_ITEN3                               ((uint16_t)0x0004U)
#define TMRB_ICONR_ITEN4_POS                           (3U)
#define TMRB_ICONR_ITEN4                               ((uint16_t)0x0008U)
#define TMRB_ICONR_ITEN5_POS                           (4U)
#define TMRB_ICONR_ITEN5                               ((uint16_t)0x0010U)
#define TMRB_ICONR_ITEN6_POS                           (5U)
#define TMRB_ICONR_ITEN6                               ((uint16_t)0x0020U)

/*  Bit definition for TMRB_ECONR register  */
#define TMRB_ECONR_ETEN1_POS                           (0U)
#define TMRB_ECONR_ETEN1                               ((uint16_t)0x0001U)
#define TMRB_ECONR_ETEN2_POS                           (1U)
#define TMRB_ECONR_ETEN2                               ((uint16_t)0x0002U)
#define TMRB_ECONR_ETEN3_POS                           (2U)
#define TMRB_ECONR_ETEN3                               ((uint16_t)0x0004U)
#define TMRB_ECONR_ETEN4_POS                           (3U)
#define TMRB_ECONR_ETEN4                               ((uint16_t)0x0008U)
#define TMRB_ECONR_ETEN5_POS                           (4U)
#define TMRB_ECONR_ETEN5                               ((uint16_t)0x0010U)
#define TMRB_ECONR_ETEN6_POS                           (5U)
#define TMRB_ECONR_ETEN6                               ((uint16_t)0x0020U)

/*  Bit definition for TMRB_STFLR register  */
#define TMRB_STFLR_CMPF1_POS                           (0U)
#define TMRB_STFLR_CMPF1                               ((uint16_t)0x0001U)
#define TMRB_STFLR_CMPF2_POS                           (1U)
#define TMRB_STFLR_CMPF2                               ((uint16_t)0x0002U)
#define TMRB_STFLR_CMPF3_POS                           (2U)
#define TMRB_STFLR_CMPF3                               ((uint16_t)0x0004U)
#define TMRB_STFLR_CMPF4_POS                           (3U)
#define TMRB_STFLR_CMPF4                               ((uint16_t)0x0008U)
#define TMRB_STFLR_CMPF5_POS                           (4U)
#define TMRB_STFLR_CMPF5                               ((uint16_t)0x0010U)
#define TMRB_STFLR_CMPF6_POS                           (5U)
#define TMRB_STFLR_CMPF6                               ((uint16_t)0x0020U)

/*  Bit definition for TMRB_BCONR register  */
#define TMRB_BCONR_BEN_POS                             (0U)
#define TMRB_BCONR_BEN                                 ((uint16_t)0x0001U)
#define TMRB_BCONR_BSE0_POS                            (1U)
#define TMRB_BCONR_BSE0                                ((uint16_t)0x0002U)
#define TMRB_BCONR_BSE1_POS                            (2U)
#define TMRB_BCONR_BSE1                                ((uint16_t)0x0004U)

