levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
/*  Bit definition for USART_CR2 register  */
#define USART_CR2_MPE_POS                              (0U)
#define USART_CR2_MPE                                  ((uint32_t)0x00000001U)
#define USART_CR2_CLKC_POS                             (11U)
#define USART_CR2_CLKC                                 ((uint32_t)0x00001800U)
#define USART_CR2_CLKC_0                               ((uint32_t)0x00000800U)
#define USART_CR2_CLKC_1                               ((uint32_t)0x00001000U)
#define USART_CR2_STOP_POS                             (13U)
#define USART_CR2_STOP                                 ((uint32_t)0x00002000U)

/*  Bit definition for USART_CR3 register  */
#define USART_CR3_HDSEL_POS                            (3U)
#define USART_CR3_HDSEL                                ((uint32_t)0x00000008U)
#define USART_CR3_CTSE_POS                             (9U)
#define USART_CR3_CTSE                                 ((uint32_t)0x00000200U)

/*  Bit definition for USART_PR register  */
#define USART_PR_PSC_POS                               (0U)
#define USART_PR_PSC                                   ((uint32_t)0x00000003U)
#define USART_PR_PSC_0                                 ((uint32_t)0x00000001U)
#define USART_PR_PSC_1                                 ((uint32_t)0x00000002U)


/*******************************************************************************
                Bit definition for Peripheral WDT
*******************************************************************************/
/*  Bit definition for WDT_CR register  */
#define WDT_CR_PERI_POS                                (0U)
#define WDT_CR_PERI                                    ((uint32_t)0x00000003U)
#define WDT_CR_PERI_0                                  ((uint32_t)0x00000001U)
#define WDT_CR_PERI_1                                  ((uint32_t)0x00000002U)
#define WDT_CR_CKS_POS                                 (4U)
#define WDT_CR_CKS                                     ((uint32_t)0x000000F0U)
#define WDT_CR_CKS_0                                   ((uint32_t)0x00000010U)
#define WDT_CR_CKS_1                                   ((uint32_t)0x00000020U)
#define WDT_CR_CKS_2                                   ((uint32_t)0x00000040U)
#define WDT_CR_CKS_3                                   ((uint32_t)0x00000080U)
#define WDT_CR_WDPT_POS                                (8U)
#define WDT_CR_WDPT                                    ((uint32_t)0x00000F00U)
#define WDT_CR_WDPT_0                                  ((uint32_t)0x00000100U)
#define WDT_CR_WDPT_1                                  ((uint32_t)0x00000200U)
#define WDT_CR_WDPT_2                                  ((uint32_t)0x00000400U)
#define WDT_CR_WDPT_3                                  ((uint32_t)0x00000800U)
#define WDT_CR_SLPOFF_POS                              (16U)
#define WDT_CR_SLPOFF                                  ((uint32_t)0x00010000U)
#define WDT_CR_ITS_POS                                 (31U)
#define WDT_CR_ITS                                     ((uint32_t)0x80000000U)

/*  Bit definition for WDT_SR register  */
#define WDT_SR_CNT_POS                                 (0U)
#define WDT_SR_CNT                                     ((uint32_t)0x0000FFFFU)
#define WDT_SR_CNT_0                                   ((uint32_t)0x00000001U)
#define WDT_SR_CNT_1                                   ((uint32_t)0x00000002U)
#define WDT_SR_CNT_2                                   ((uint32_t)0x00000004U)
#define WDT_SR_CNT_3                                   ((uint32_t)0x00000008U)
#define WDT_SR_CNT_4                                   ((uint32_t)0x00000010U)
#define WDT_SR_CNT_5                                   ((uint32_t)0x00000020U)
#define WDT_SR_CNT_6                                   ((uint32_t)0x00000040U)
#define WDT_SR_CNT_7                                   ((uint32_t)0x00000080U)
#define WDT_SR_CNT_8                                   ((uint32_t)0x00000100U)
#define WDT_SR_CNT_9                                   ((uint32_t)0x00000200U)
#define WDT_SR_CNT_10                                  ((uint32_t)0x00000400U)
#define WDT_SR_CNT_11                                  ((uint32_t)0x00000800U)
#define WDT_SR_CNT_12                                  ((uint32_t)0x00001000U)
#define WDT_SR_CNT_13                                  ((uint32_t)0x00002000U)
#define WDT_SR_CNT_14                                  ((uint32_t)0x00004000U)
#define WDT_SR_CNT_15                                  ((uint32_t)0x00008000U)
#define WDT_SR_UDF_POS                                 (16U)
#define WDT_SR_UDF                                     ((uint32_t)0x00010000U)
#define WDT_SR_REF_POS                                 (17U)
#define WDT_SR_REF                                     ((uint32_t)0x00020000U)

/*  Bit definition for WDT_RR register  */
#define WDT_RR_RF_POS                                  (0U)
#define WDT_RR_RF                                      ((uint32_t)0x0000FFFFU)
#define WDT_RR_RF_0                                    ((uint32_t)0x00000001U)
#define WDT_RR_RF_1                                    ((uint32_t)0x00000002U)
#define WDT_RR_RF_2                                    ((uint32_t)0x00000004U)
#define WDT_RR_RF_3                                    ((uint32_t)0x00000008U)
#define WDT_RR_RF_4                                    ((uint32_t)0x00000010U)
#define WDT_RR_RF_5                                    ((uint32_t)0x00000020U)
#define WDT_RR_RF_6                                    ((uint32_t)0x00000040U)
#define WDT_RR_RF_7                                    ((uint32_t)0x00000080U)
#define WDT_RR_RF_8                                    ((uint32_t)0x00000100U)
#define WDT_RR_RF_9                                    ((uint32_t)0x00000200U)
#define WDT_RR_RF_10                                   ((uint32_t)0x00000400U)
#define WDT_RR_RF_11                                   ((uint32_t)0x00000800U)
#define WDT_RR_RF_12                                   ((uint32_t)0x00001000U)
#define WDT_RR_RF_13                                   ((uint32_t)0x00002000U)
#define WDT_RR_RF_14                                   ((uint32_t)0x00004000U)
#define WDT_RR_RF_15                                   ((uint32_t)0x00008000U)




/******************************************************************************/
/*             Device Specific Registers bit_band structure                   */
/******************************************************************************/

typedef struct
{
    __IO uint32_t STRT;
    uint32_t RESERVED0[7];
} stc_adc_str_bit_t;

typedef struct
{
    __IO uint32_t MS0;
    __IO uint32_t MS1;
    uint32_t RESERVED0[2];
    __IO uint32_t ACCSEL0;
    __IO uint32_t ACCSEL1;
    __IO uint32_t CLREN;
    __IO uint32_t DFMT;
    __IO uint32_t AVCNT0;
    __IO uint32_t AVCNT1;
    __IO uint32_t AVCNT2;
    uint32_t RESERVED1[5];
} stc_adc_cr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t RSCHSEL;
    uint32_t RESERVED1[13];
} stc_adc_cr1_bit_t;

typedef struct
{
    __IO uint32_t TRGSELA0;
    __IO uint32_t TRGSELA1;
    uint32_t RESERVED0[5];
    __IO uint32_t TRGENA;
    __IO uint32_t TRGSELB0;
    __IO uint32_t TRGSELB1;
    uint32_t RESERVED1[5];
    __IO uint32_t TRGENB;
} stc_adc_trgsr_bit_t;

typedef struct
{
    __IO uint32_t CHSELA0;
    __IO uint32_t CHSELA1;
    __IO uint32_t CHSELA2;
    __IO uint32_t CHSELA3;
    __IO uint32_t CHSELA4;
    __IO uint32_t CHSELA5;
    __IO uint32_t CHSELA6;
    __IO uint32_t CHSELA7;
    __IO uint32_t CHSELA8;
    __IO uint32_t CHSELA9;
    uint32_t RESERVED0[6];
} stc_adc_chselra0_bit_t;

typedef struct
{
    __IO uint32_t CHSELB0;
    __IO uint32_t CHSELB1;
    __IO uint32_t CHSELB2;
    __IO uint32_t CHSELB3;
    __IO uint32_t CHSELB4;
    __IO uint32_t CHSELB5;
    __IO uint32_t CHSELB6;
    __IO uint32_t CHSELB7;
    __IO uint32_t CHSELB8;
    __IO uint32_t CHSELB9;
    uint32_t RESERVED0[6];
} stc_adc_chselrb0_bit_t;

typedef struct
{
    __IO uint32_t AVCHSEL0;
    __IO uint32_t AVCHSEL1;
    __IO uint32_t AVCHSEL2;
    __IO uint32_t AVCHSEL3;
    __IO uint32_t AVCHSEL4;
    __IO uint32_t AVCHSEL5;
    __IO uint32_t AVCHSEL6;
    __IO uint32_t AVCHSEL7;
    __IO uint32_t AVCHSEL8;
    __IO uint32_t AVCHSEL9;
    uint32_t RESERVED0[6];
} stc_adc_avchselr0_bit_t;

typedef struct
{
    __IO uint32_t EXCHSEL;
    uint32_t RESERVED0[7];
} stc_adc_exchselr_bit_t;

typedef struct
{
    __IO uint32_t SHT0;
    __IO uint32_t SHT1;
    __IO uint32_t SHT2;
    __IO uint32_t SHT3;
    __IO uint32_t SHT4;
    __IO uint32_t SHT5;
    __IO uint32_t SHT6;
    __IO uint32_t SHT7;
    __IO uint32_t SHSEL0;
    __IO uint32_t SHSEL1;
    __IO uint32_t SHSEL2;
    uint32_t RESERVED0[4];
    __IO uint32_t SHMD;
} stc_adc_shcr_bit_t;

typedef struct
{
    uint32_t ADC_SSTR0_0;
    uint32_t ADC_SSTR0_1;
    uint32_t ADC_SSTR0_2;
    uint32_t ADC_SSTR0_3;
    uint32_t ADC_SSTR0_4;
    uint32_t ADC_SSTR0_5;
    uint32_t ADC_SSTR0_6;
    uint32_t ADC_SSTR0_7;
} stc_adc_sstr0_bit_t;

typedef struct
{
    uint32_t ADC_SSTR1_0;
    uint32_t ADC_SSTR1_1;
    uint32_t ADC_SSTR1_2;
    uint32_t ADC_SSTR1_3;
    uint32_t ADC_SSTR1_4;
    uint32_t ADC_SSTR1_5;
    uint32_t ADC_SSTR1_6;
    uint32_t ADC_SSTR1_7;
} stc_adc_sstr1_bit_t;

typedef struct
{
    uint32_t ADC_SSTR2_0;
    uint32_t ADC_SSTR2_1;
    uint32_t ADC_SSTR2_2;
    uint32_t ADC_SSTR2_3;
    uint32_t ADC_SSTR2_4;
    uint32_t ADC_SSTR2_5;
    uint32_t ADC_SSTR2_6;
    uint32_t ADC_SSTR2_7;
} stc_adc_sstr2_bit_t;

typedef struct
{
    uint32_t ADC_SSTR3_0;
    uint32_t ADC_SSTR3_1;
    uint32_t ADC_SSTR3_2;
    uint32_t ADC_SSTR3_3;
    uint32_t ADC_SSTR3_4;
    uint32_t ADC_SSTR3_5;
    uint32_t ADC_SSTR3_6;
    uint32_t ADC_SSTR3_7;
} stc_adc_sstr3_bit_t;

typedef struct
{
    uint32_t ADC_SSTR4_0;
    uint32_t ADC_SSTR4_1;
    uint32_t ADC_SSTR4_2;
    uint32_t ADC_SSTR4_3;
    uint32_t ADC_SSTR4_4;
    uint32_t ADC_SSTR4_5;
    uint32_t ADC_SSTR4_6;
    uint32_t ADC_SSTR4_7;
} stc_adc_sstr4_bit_t;

typedef struct
{
    uint32_t ADC_SSTR5_0;
    uint32_t ADC_SSTR5_1;
    uint32_t ADC_SSTR5_2;
    uint32_t ADC_SSTR5_3;
    uint32_t ADC_SSTR5_4;
    uint32_t ADC_SSTR5_5;
    uint32_t ADC_SSTR5_6;
    uint32_t ADC_SSTR5_7;
} stc_adc_sstr5_bit_t;

typedef struct
{
    uint32_t ADC_SSTR6_0;
    uint32_t ADC_SSTR6_1;
    uint32_t ADC_SSTR6_2;
    uint32_t ADC_SSTR6_3;
    uint32_t ADC_SSTR6_4;
    uint32_t ADC_SSTR6_5;
    uint32_t ADC_SSTR6_6;
    uint32_t ADC_SSTR6_7;
} stc_adc_sstr6_bit_t;

typedef struct
{
    uint32_t ADC_SSTR7_0;
    uint32_t ADC_SSTR7_1;
    uint32_t ADC_SSTR7_2;
    uint32_t ADC_SSTR7_3;
    uint32_t ADC_SSTR7_4;
    uint32_t ADC_SSTR7_5;
    uint32_t ADC_SSTR7_6;
    uint32_t ADC_SSTR7_7;
} stc_adc_sstr7_bit_t;

typedef struct
{
    uint32_t ADC_SSTR8_0;
    uint32_t ADC_SSTR8_1;
    uint32_t ADC_SSTR8_2;
    uint32_t ADC_SSTR8_3;
    uint32_t ADC_SSTR8_4;
    uint32_t ADC_SSTR8_5;
    uint32_t ADC_SSTR8_6;
    uint32_t ADC_SSTR8_7;
} stc_adc_sstr8_bit_t;

typedef struct
{
    uint32_t ADC_SSTR9_0;
    uint32_t ADC_SSTR9_1;
    uint32_t ADC_SSTR9_2;
    uint32_t ADC_SSTR9_3;
    uint32_t ADC_SSTR9_4;
    uint32_t ADC_SSTR9_5;
    uint32_t ADC_SSTR9_6;
    uint32_t ADC_SSTR9_7;
} stc_adc_sstr9_bit_t;

typedef struct
{
    __IO uint32_t EOCAF;
    __IO uint32_t EOCBF;
    uint32_t RESERVED0[2];
    __IO uint32_t SASTPDF;
    uint32_t RESERVED1[3];
} stc_adc_isr_bit_t;

typedef struct
{
    __IO uint32_t EOCAIEN;
    __IO uint32_t EOCBIEN;
    uint32_t RESERVED0[6];
} stc_adc_icr_bit_t;

typedef struct
{
    __IO uint32_t CLREOCAF;
    __IO uint32_t CLREOCBF;
    uint32_t RESERVED0[2];
    __IO uint32_t CLRSASTPDF;
    uint32_t RESERVED1[3];
} stc_adc_isclrr_bit_t;

typedef struct
{
    uint32_t ADC_DR0_0;
    uint32_t ADC_DR0_1;
    uint32_t ADC_DR0_2;
    uint32_t ADC_DR0_3;
    uint32_t ADC_DR0_4;
    uint32_t ADC_DR0_5;
    uint32_t ADC_DR0_6;
    uint32_t ADC_DR0_7;
    uint32_t ADC_DR0_8;
    uint32_t ADC_DR0_9;
    uint32_t ADC_DR0_10;
    uint32_t ADC_DR0_11;
    uint32_t ADC_DR0_12;
    uint32_t ADC_DR0_13;
    uint32_t ADC_DR0_14;
    uint32_t ADC_DR0_15;
} stc_adc_dr0_bit_t;

typedef struct
{
    uint32_t ADC_DR1_0;
    uint32_t ADC_DR1_1;
    uint32_t ADC_DR1_2;
    uint32_t ADC_DR1_3;
    uint32_t ADC_DR1_4;
    uint32_t ADC_DR1_5;
    uint32_t ADC_DR1_6;
    uint32_t ADC_DR1_7;
    uint32_t ADC_DR1_8;
    uint32_t ADC_DR1_9;
    uint32_t ADC_DR1_10;
    uint32_t ADC_DR1_11;
    uint32_t ADC_DR1_12;
    uint32_t ADC_DR1_13;
    uint32_t ADC_DR1_14;
    uint32_t ADC_DR1_15;
} stc_adc_dr1_bit_t;

typedef struct
{
    uint32_t ADC_DR2_0;
    uint32_t ADC_DR2_1;
    uint32_t ADC_DR2_2;
    uint32_t ADC_DR2_3;
    uint32_t ADC_DR2_4;
    uint32_t ADC_DR2_5;
    uint32_t ADC_DR2_6;
    uint32_t ADC_DR2_7;
    uint32_t ADC_DR2_8;
    uint32_t ADC_DR2_9;
    uint32_t ADC_DR2_10;
    uint32_t ADC_DR2_11;
    uint32_t ADC_DR2_12;
    uint32_t ADC_DR2_13;
    uint32_t ADC_DR2_14;
    uint32_t ADC_DR2_15;
} stc_adc_dr2_bit_t;

typedef struct
{
    uint32_t ADC_DR3_0;
    uint32_t ADC_DR3_1;
    uint32_t ADC_DR3_2;
    uint32_t ADC_DR3_3;
    uint32_t ADC_DR3_4;
    uint32_t ADC_DR3_5;
    uint32_t ADC_DR3_6;
    uint32_t ADC_DR3_7;
    uint32_t ADC_DR3_8;
    uint32_t ADC_DR3_9;
    uint32_t ADC_DR3_10;
    uint32_t ADC_DR3_11;
    uint32_t ADC_DR3_12;
    uint32_t ADC_DR3_13;
    uint32_t ADC_DR3_14;
    uint32_t ADC_DR3_15;
} stc_adc_dr3_bit_t;

typedef struct
{
    uint32_t ADC_DR4_0;
    uint32_t ADC_DR4_1;
    uint32_t ADC_DR4_2;
    uint32_t ADC_DR4_3;
    uint32_t ADC_DR4_4;
    uint32_t ADC_DR4_5;
    uint32_t ADC_DR4_6;
    uint32_t ADC_DR4_7;
    uint32_t ADC_DR4_8;
    uint32_t ADC_DR4_9;
    uint32_t ADC_DR4_10;
    uint32_t ADC_DR4_11;
    uint32_t ADC_DR4_12;
    uint32_t ADC_DR4_13;
    uint32_t ADC_DR4_14;
    uint32_t ADC_DR4_15;
} stc_adc_dr4_bit_t;

typedef struct
{
    uint32_t ADC_DR5_0;
    uint32_t ADC_DR5_1;
    uint32_t ADC_DR5_2;
    uint32_t ADC_DR5_3;
    uint32_t ADC_DR5_4;
    uint32_t ADC_DR5_5;
    uint32_t ADC_DR5_6;
    uint32_t ADC_DR5_7;
    uint32_t ADC_DR5_8;
    uint32_t ADC_DR5_9;
    uint32_t ADC_DR5_10;
    uint32_t ADC_DR5_11;
    uint32_t ADC_DR5_12;
    uint32_t ADC_DR5_13;
    uint32_t ADC_DR5_14;
    uint32_t ADC_DR5_15;
} stc_adc_dr5_bit_t;

typedef struct
{
    uint32_t ADC_DR6_0;
    uint32_t ADC_DR6_1;
    uint32_t ADC_DR6_2;
    uint32_t ADC_DR6_3;
    uint32_t ADC_DR6_4;
    uint32_t ADC_DR6_5;
    uint32_t ADC_DR6_6;
    uint32_t ADC_DR6_7;
    uint32_t ADC_DR6_8;
    uint32_t ADC_DR6_9;
    uint32_t ADC_DR6_10;
    uint32_t ADC_DR6_11;
    uint32_t ADC_DR6_12;
    uint32_t ADC_DR6_13;
    uint32_t ADC_DR6_14;
    uint32_t ADC_DR6_15;
} stc_adc_dr6_bit_t;

typedef struct
{
    uint32_t ADC_DR7_0;
    uint32_t ADC_DR7_1;
    uint32_t ADC_DR7_2;
    uint32_t ADC_DR7_3;
    uint32_t ADC_DR7_4;
    uint32_t ADC_DR7_5;
    uint32_t ADC_DR7_6;
    uint32_t ADC_DR7_7;
    uint32_t ADC_DR7_8;
    uint32_t ADC_DR7_9;
    uint32_t ADC_DR7_10;
    uint32_t ADC_DR7_11;
    uint32_t ADC_DR7_12;
    uint32_t ADC_DR7_13;
    uint32_t ADC_DR7_14;
    uint32_t ADC_DR7_15;
} stc_adc_dr7_bit_t;

typedef struct
{
    uint32_t ADC_DR8_0;
    uint32_t ADC_DR8_1;
    uint32_t ADC_DR8_2;
    uint32_t ADC_DR8_3;
    uint32_t ADC_DR8_4;
    uint32_t ADC_DR8_5;
    uint32_t ADC_DR8_6;
    uint32_t ADC_DR8_7;
    uint32_t ADC_DR8_8;
    uint32_t ADC_DR8_9;
    uint32_t ADC_DR8_10;
    uint32_t ADC_DR8_11;
    uint32_t ADC_DR8_12;
    uint32_t ADC_DR8_13;
    uint32_t ADC_DR8_14;
    uint32_t ADC_DR8_15;
} stc_adc_dr8_bit_t;

typedef struct
{
    uint32_t ADC_DR9_0;
    uint32_t ADC_DR9_1;
    uint32_t ADC_DR9_2;
    uint32_t ADC_DR9_3;
    uint32_t ADC_DR9_4;
    uint32_t ADC_DR9_5;
    uint32_t ADC_DR9_6;
    uint32_t ADC_DR9_7;
    uint32_t ADC_DR9_8;
    uint32_t ADC_DR9_9;
    uint32_t ADC_DR9_10;
    uint32_t ADC_DR9_11;
    uint32_t ADC_DR9_12;
    uint32_t ADC_DR9_13;
    uint32_t ADC_DR9_14;
    uint32_t ADC_DR9_15;
} stc_adc_dr9_bit_t;

typedef struct
{
    __IO uint32_t STRG;
    uint32_t RESERVED0[31];
} stc_aos_intc_strgcr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_tmr00_htssr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_tmr01_htssr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_tmra0_htssr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_tmra1_htssr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_tmrb_htssr_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_adc_itrgselr0_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_adc_itrgselr1_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_dma0_trgsel_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_dma1_trgsel_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_dma2_trgsel_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_dma3_trgsel_bit_t;

typedef struct
{
    __IO uint32_t TRGSEL0;
    __IO uint32_t TRGSEL1;
    __IO uint32_t TRGSEL2;
    __IO uint32_t TRGSEL3;
    __IO uint32_t TRGSEL4;
    __IO uint32_t TRGSEL5;
    __IO uint32_t TRGSEL6;
    __IO uint32_t TRGSEL7;
    __IO uint32_t TRGSEL8;
    uint32_t RESERVED0[23];
} stc_aos_dcu_trgsel_bit_t;

typedef struct
{
    __IO uint32_t CENB;
    __IO uint32_t CWDE;
    uint32_t RESERVED0[5];
    __IO uint32_t CMON;
} stc_cmp_mdr_bit_t;

typedef struct
{
    __IO uint32_t FCKS0;
    __IO uint32_t FCKS1;
    uint32_t RESERVED0[2];
    __IO uint32_t EDGS0;
    __IO uint32_t EDGS1;
    __IO uint32_t CIEN;
    uint32_t RESERVED1[1];
} stc_cmp_fir_bit_t;

typedef struct
{
    __IO uint32_t COEN;
    __IO uint32_t COPS;
    __IO uint32_t CPOE;
    __IO uint32_t TWOE;
    __IO uint32_t TWOL;
    uint32_t RESERVED0[3];
} stc_cmp_ocr_bit_t;

typedef struct
{
    __IO uint32_t RVSL0;
    __IO uint32_t RVSL1;
    __IO uint32_t RVSL2;
    uint32_t RESERVED0[1];
    __IO uint32_t CVSL0;
    __IO uint32_t CVSL1;
    __IO uint32_t CVSL2;
    __IO uint32_t CVSL3;
} stc_cmp_vsr_bit_t;

typedef struct
{
    __IO uint32_t CTWS0;
    __IO uint32_t CTWS1;
    __IO uint32_t CTWS2;
    __IO uint32_t CTWS3;
    __IO uint32_t CTWS4;
    __IO uint32_t CTWS5;
    __IO uint32_t CTWS6;
    __IO uint32_t CTWS7;
} stc_cmp_twr1_bit_t;

typedef struct
{
    __IO uint32_t CTWP0;
    __IO uint32_t CTWP1;
    __IO uint32_t CTWP2;
    __IO uint32_t CTWP3;
    __IO uint32_t CTWP4;
    __IO uint32_t CTWP5;
    __IO uint32_t CTWP6;
    __IO uint32_t CTWP7;
} stc_cmp_twr2_bit_t;

typedef struct
{
    __IO uint32_t ADCKSEL0;
    __IO uint32_t ADCKSEL1;
    __IO uint32_t ADCKSEL2;
    uint32_t RESERVED0[5];
} stc_cmu_adcksel_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDF;
    uint32_t RESERVED0[7];
} stc_cmu_xtalstdsr_bit_t;

typedef struct
{
    __IO uint32_t PCLK1S0;
    __IO uint32_t PCLK1S1;
    __IO uint32_t PCLK1S2;
    uint32_t RESERVED0[9];
    __IO uint32_t PCLK4S0;
    __IO uint32_t PCLK4S1;
    __IO uint32_t PCLK4S2;
    uint32_t RESERVED1[9];
    __IO uint32_t HCLKS0;
    __IO uint32_t HCLKS1;
    __IO uint32_t HCLKS2;
    uint32_t RESERVED2[5];
} stc_cmu_scfgr_bit_t;

typedef struct
{
    __IO uint32_t CKSW0;
    __IO uint32_t CKSW1;
    __IO uint32_t CKSW2;
    uint32_t RESERVED0[5];
} stc_cmu_ckswr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTP;
    uint32_t RESERVED0[7];
} stc_cmu_xtalcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t XTALDRV0;
    __IO uint32_t XTALDRV1;
    __IO uint32_t XTALMS;
    __IO uint32_t SUPDRV;
} stc_cmu_xtalcfgr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTB0;
    __IO uint32_t XTALSTB1;
    __IO uint32_t XTALSTB2;
    uint32_t RESERVED0[5];
} stc_cmu_xtalstbcr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_hrccr_bit_t;

typedef struct
{
    __IO uint32_t HRCFREQS0;
    __IO uint32_t HRCFREQS1;
    __IO uint32_t HRCFREQS2;
    __IO uint32_t HRCFREQS3;
    uint32_t RESERVED0[4];
} stc_cmu_hrccfgr_bit_t;

typedef struct
{
    __IO uint32_t HRCSTBF;
    uint32_t RESERVED0[2];
    __IO uint32_t XTALSTBF;
    uint32_t RESERVED1[1];
    __IO uint32_t PLLSTBF;
    uint32_t RESERVED2[2];
} stc_cmu_oscstbsr_bit_t;

typedef struct
{
    __IO uint32_t MCO1SEL0;
    __IO uint32_t MCO1SEL1;
    __IO uint32_t MCO1SEL2;
    __IO uint32_t MCO1SEL3;
    __IO uint32_t MCO1DIV0;
    __IO uint32_t MCO1DIV1;
    __IO uint32_t MCO1DIV2;
    __IO uint32_t MCO1EN;
} stc_cmu_mcocfgr_bit_t;

typedef struct
{
    __IO uint32_t XTALSTDIE;
    __IO uint32_t XTALSTDRE;
    __IO uint32_t XTALSTDRIS;
    uint32_t RESERVED0[4];
    __IO uint32_t XTALSTDE;
} stc_cmu_xtalstdcr_bit_t;

