levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
typedef struct
{
    __IO uint32_t ADC;
    __IO uint32_t CTC;
    __IO uint32_t CMP;
    uint32_t RESERVED0[1];
    __IO uint32_t AOS;
    __IO uint32_t DMA;
    uint32_t RESERVED1[1];
    __IO uint32_t CRC;
    __IO uint32_t TIMA1;
    __IO uint32_t TIMA2;
    __IO uint32_t TIMA3;
    __IO uint32_t TIMA4;
    uint32_t RESERVED2[4];
    __IO uint32_t TIM0_1;
    __IO uint32_t TIM0_2;
    __IO uint32_t TIM4_1;
    __IO uint32_t TIMB_1;
    __IO uint32_t EMB;
    __IO uint32_t FCM;
    __IO uint32_t DCU;
    uint32_t RESERVED3[1];
    __IO uint32_t UART1;
    __IO uint32_t UART2;
    __IO uint32_t UART3;
    __IO uint32_t UART4;
    __IO uint32_t IIC_1;
    __IO uint32_t SPI_1;
    uint32_t RESERVED4[2];
} stc_cmu_fcg_bit_t;

typedef struct
{
    __IO uint32_t LRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_lrccr_bit_t;

typedef struct
{
    __IO uint32_t MRCSTP;
    uint32_t RESERVED0[7];
} stc_cmu_mrccr_bit_t;

typedef struct
{
    __IO uint32_t PLLM0;
    __IO uint32_t PLLM1;
    __IO uint32_t PLLM2;
    uint32_t RESERVED0[4];
    __IO uint32_t PLLSRC;
    __IO uint32_t PLLN0;
    __IO uint32_t PLLN1;
    __IO uint32_t PLLN2;
    __IO uint32_t PLLN3;
    __IO uint32_t PLLN4;
    __IO uint32_t PLLN5;
    uint32_t RESERVED1[14];
    __IO uint32_t PLLP0;
    __IO uint32_t PLLP1;
    uint32_t RESERVED2[2];
} stc_cmu_pllcfgr_bit_t;

typedef struct
{
    __IO uint32_t PLLOFF;
    uint32_t RESERVED0[7];
} stc_cmu_pllcr_bit_t;

typedef struct
{
    __IO uint32_t TPIUCKS0;
    __IO uint32_t TPIUCKS1;
    uint32_t RESERVED0[5];
    __IO uint32_t TPIUCKOE;
} stc_cmu_tpiuckcfgr_bit_t;

typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t FLAG;
    uint32_t RESERVED0[30];
} stc_crc_cr_bit_t;

typedef struct
{
    uint32_t CRC_RESLT_0;
    uint32_t CRC_RESLT_1;
    uint32_t CRC_RESLT_2;
    uint32_t CRC_RESLT_3;
    uint32_t CRC_RESLT_4;
    uint32_t CRC_RESLT_5;
    uint32_t CRC_RESLT_6;
    uint32_t CRC_RESLT_7;
    uint32_t CRC_RESLT_8;
    uint32_t CRC_RESLT_9;
    uint32_t CRC_RESLT_10;
    uint32_t CRC_RESLT_11;
    uint32_t CRC_RESLT_12;
    uint32_t CRC_RESLT_13;
    uint32_t CRC_RESLT_14;
    uint32_t CRC_RESLT_15;
    uint32_t CRC_RESLT_16;
    uint32_t CRC_RESLT_17;
    uint32_t CRC_RESLT_18;
    uint32_t CRC_RESLT_19;
    uint32_t CRC_RESLT_20;
    uint32_t CRC_RESLT_21;
    uint32_t CRC_RESLT_22;
    uint32_t CRC_RESLT_23;
    uint32_t CRC_RESLT_24;
    uint32_t CRC_RESLT_25;
    uint32_t CRC_RESLT_26;
    uint32_t CRC_RESLT_27;
    uint32_t CRC_RESLT_28;
    uint32_t CRC_RESLT_29;
    uint32_t CRC_RESLT_30;
    uint32_t CRC_RESLT_31;
} stc_crc_reslt_bit_t;

typedef struct
{
    uint32_t CRC_DAT0_0;
    uint32_t CRC_DAT0_1;
    uint32_t CRC_DAT0_2;
    uint32_t CRC_DAT0_3;
    uint32_t CRC_DAT0_4;
    uint32_t CRC_DAT0_5;
    uint32_t CRC_DAT0_6;
    uint32_t CRC_DAT0_7;
    uint32_t CRC_DAT0_8;
    uint32_t CRC_DAT0_9;
    uint32_t CRC_DAT0_10;
    uint32_t CRC_DAT0_11;
    uint32_t CRC_DAT0_12;
    uint32_t CRC_DAT0_13;
    uint32_t CRC_DAT0_14;
    uint32_t CRC_DAT0_15;
    uint32_t CRC_DAT0_16;
    uint32_t CRC_DAT0_17;
    uint32_t CRC_DAT0_18;
    uint32_t CRC_DAT0_19;
    uint32_t CRC_DAT0_20;
    uint32_t CRC_DAT0_21;
    uint32_t CRC_DAT0_22;
    uint32_t CRC_DAT0_23;
    uint32_t CRC_DAT0_24;
    uint32_t CRC_DAT0_25;
    uint32_t CRC_DAT0_26;
    uint32_t CRC_DAT0_27;
    uint32_t CRC_DAT0_28;
    uint32_t CRC_DAT0_29;
    uint32_t CRC_DAT0_30;
    uint32_t CRC_DAT0_31;
} stc_crc_dat0_bit_t;

typedef struct
{
    uint32_t CRC_DAT1_0;
    uint32_t CRC_DAT1_1;
    uint32_t CRC_DAT1_2;
    uint32_t CRC_DAT1_3;
    uint32_t CRC_DAT1_4;
    uint32_t CRC_DAT1_5;
    uint32_t CRC_DAT1_6;
    uint32_t CRC_DAT1_7;
    uint32_t CRC_DAT1_8;
    uint32_t CRC_DAT1_9;
    uint32_t CRC_DAT1_10;
    uint32_t CRC_DAT1_11;
    uint32_t CRC_DAT1_12;
    uint32_t CRC_DAT1_13;
    uint32_t CRC_DAT1_14;
    uint32_t CRC_DAT1_15;
    uint32_t CRC_DAT1_16;
    uint32_t CRC_DAT1_17;
    uint32_t CRC_DAT1_18;
    uint32_t CRC_DAT1_19;
    uint32_t CRC_DAT1_20;
    uint32_t CRC_DAT1_21;
    uint32_t CRC_DAT1_22;
    uint32_t CRC_DAT1_23;
    uint32_t CRC_DAT1_24;
    uint32_t CRC_DAT1_25;
    uint32_t CRC_DAT1_26;
    uint32_t CRC_DAT1_27;
    uint32_t CRC_DAT1_28;
    uint32_t CRC_DAT1_29;
    uint32_t CRC_DAT1_30;
    uint32_t CRC_DAT1_31;
} stc_crc_dat1_bit_t;

typedef struct
{
    uint32_t CRC_DAT2_0;
    uint32_t CRC_DAT2_1;
    uint32_t CRC_DAT2_2;
    uint32_t CRC_DAT2_3;
    uint32_t CRC_DAT2_4;
    uint32_t CRC_DAT2_5;
    uint32_t CRC_DAT2_6;
    uint32_t CRC_DAT2_7;
    uint32_t CRC_DAT2_8;
    uint32_t CRC_DAT2_9;
    uint32_t CRC_DAT2_10;
    uint32_t CRC_DAT2_11;
    uint32_t CRC_DAT2_12;
    uint32_t CRC_DAT2_13;
    uint32_t CRC_DAT2_14;
    uint32_t CRC_DAT2_15;
    uint32_t CRC_DAT2_16;
    uint32_t CRC_DAT2_17;
    uint32_t CRC_DAT2_18;
    uint32_t CRC_DAT2_19;
    uint32_t CRC_DAT2_20;
    uint32_t CRC_DAT2_21;
    uint32_t CRC_DAT2_22;
    uint32_t CRC_DAT2_23;
    uint32_t CRC_DAT2_24;
    uint32_t CRC_DAT2_25;
    uint32_t CRC_DAT2_26;
    uint32_t CRC_DAT2_27;
    uint32_t CRC_DAT2_28;
    uint32_t CRC_DAT2_29;
    uint32_t CRC_DAT2_30;
    uint32_t CRC_DAT2_31;
} stc_crc_dat2_bit_t;

typedef struct
{
    uint32_t CRC_DAT3_0;
    uint32_t CRC_DAT3_1;
    uint32_t CRC_DAT3_2;
    uint32_t CRC_DAT3_3;
    uint32_t CRC_DAT3_4;
    uint32_t CRC_DAT3_5;
    uint32_t CRC_DAT3_6;
    uint32_t CRC_DAT3_7;
    uint32_t CRC_DAT3_8;
    uint32_t CRC_DAT3_9;
    uint32_t CRC_DAT3_10;
    uint32_t CRC_DAT3_11;
    uint32_t CRC_DAT3_12;
    uint32_t CRC_DAT3_13;
    uint32_t CRC_DAT3_14;
    uint32_t CRC_DAT3_15;
    uint32_t CRC_DAT3_16;
    uint32_t CRC_DAT3_17;
    uint32_t CRC_DAT3_18;
    uint32_t CRC_DAT3_19;
    uint32_t CRC_DAT3_20;
    uint32_t CRC_DAT3_21;
    uint32_t CRC_DAT3_22;
    uint32_t CRC_DAT3_23;
    uint32_t CRC_DAT3_24;
    uint32_t CRC_DAT3_25;
    uint32_t CRC_DAT3_26;
    uint32_t CRC_DAT3_27;
    uint32_t CRC_DAT3_28;
    uint32_t CRC_DAT3_29;
    uint32_t CRC_DAT3_30;
    uint32_t CRC_DAT3_31;
} stc_crc_dat3_bit_t;

typedef struct
{
    uint32_t CRC_DAT4_0;
    uint32_t CRC_DAT4_1;
    uint32_t CRC_DAT4_2;
    uint32_t CRC_DAT4_3;
    uint32_t CRC_DAT4_4;
    uint32_t CRC_DAT4_5;
    uint32_t CRC_DAT4_6;
    uint32_t CRC_DAT4_7;
    uint32_t CRC_DAT4_8;
    uint32_t CRC_DAT4_9;
    uint32_t CRC_DAT4_10;
    uint32_t CRC_DAT4_11;
    uint32_t CRC_DAT4_12;
    uint32_t CRC_DAT4_13;
    uint32_t CRC_DAT4_14;
    uint32_t CRC_DAT4_15;
    uint32_t CRC_DAT4_16;
    uint32_t CRC_DAT4_17;
    uint32_t CRC_DAT4_18;
    uint32_t CRC_DAT4_19;
    uint32_t CRC_DAT4_20;
    uint32_t CRC_DAT4_21;
    uint32_t CRC_DAT4_22;
    uint32_t CRC_DAT4_23;
    uint32_t CRC_DAT4_24;
    uint32_t CRC_DAT4_25;
    uint32_t CRC_DAT4_26;
    uint32_t CRC_DAT4_27;
    uint32_t CRC_DAT4_28;
    uint32_t CRC_DAT4_29;
    uint32_t CRC_DAT4_30;
    uint32_t CRC_DAT4_31;
} stc_crc_dat4_bit_t;

typedef struct
{
    uint32_t CRC_DAT5_0;
    uint32_t CRC_DAT5_1;
    uint32_t CRC_DAT5_2;
    uint32_t CRC_DAT5_3;
    uint32_t CRC_DAT5_4;
    uint32_t CRC_DAT5_5;
    uint32_t CRC_DAT5_6;
    uint32_t CRC_DAT5_7;
    uint32_t CRC_DAT5_8;
    uint32_t CRC_DAT5_9;
    uint32_t CRC_DAT5_10;
    uint32_t CRC_DAT5_11;
    uint32_t CRC_DAT5_12;
    uint32_t CRC_DAT5_13;
    uint32_t CRC_DAT5_14;
    uint32_t CRC_DAT5_15;
    uint32_t CRC_DAT5_16;
    uint32_t CRC_DAT5_17;
    uint32_t CRC_DAT5_18;
    uint32_t CRC_DAT5_19;
    uint32_t CRC_DAT5_20;
    uint32_t CRC_DAT5_21;
    uint32_t CRC_DAT5_22;
    uint32_t CRC_DAT5_23;
    uint32_t CRC_DAT5_24;
    uint32_t CRC_DAT5_25;
    uint32_t CRC_DAT5_26;
    uint32_t CRC_DAT5_27;
    uint32_t CRC_DAT5_28;
    uint32_t CRC_DAT5_29;
    uint32_t CRC_DAT5_30;
    uint32_t CRC_DAT5_31;
} stc_crc_dat5_bit_t;

typedef struct
{
    uint32_t CRC_DAT6_0;
    uint32_t CRC_DAT6_1;
    uint32_t CRC_DAT6_2;
    uint32_t CRC_DAT6_3;
    uint32_t CRC_DAT6_4;
    uint32_t CRC_DAT6_5;
    uint32_t CRC_DAT6_6;
    uint32_t CRC_DAT6_7;
    uint32_t CRC_DAT6_8;
    uint32_t CRC_DAT6_9;
    uint32_t CRC_DAT6_10;
    uint32_t CRC_DAT6_11;
    uint32_t CRC_DAT6_12;
    uint32_t CRC_DAT6_13;
    uint32_t CRC_DAT6_14;
    uint32_t CRC_DAT6_15;
    uint32_t CRC_DAT6_16;
    uint32_t CRC_DAT6_17;
    uint32_t CRC_DAT6_18;
    uint32_t CRC_DAT6_19;
    uint32_t CRC_DAT6_20;
    uint32_t CRC_DAT6_21;
    uint32_t CRC_DAT6_22;
    uint32_t CRC_DAT6_23;
    uint32_t CRC_DAT6_24;
    uint32_t CRC_DAT6_25;
    uint32_t CRC_DAT6_26;
    uint32_t CRC_DAT6_27;
    uint32_t CRC_DAT6_28;
    uint32_t CRC_DAT6_29;
    uint32_t CRC_DAT6_30;
    uint32_t CRC_DAT6_31;
} stc_crc_dat6_bit_t;

typedef struct
{
    uint32_t CRC_DAT7_0;
    uint32_t CRC_DAT7_1;
    uint32_t CRC_DAT7_2;
    uint32_t CRC_DAT7_3;
    uint32_t CRC_DAT7_4;
    uint32_t CRC_DAT7_5;
    uint32_t CRC_DAT7_6;
    uint32_t CRC_DAT7_7;
    uint32_t CRC_DAT7_8;
    uint32_t CRC_DAT7_9;
    uint32_t CRC_DAT7_10;
    uint32_t CRC_DAT7_11;
    uint32_t CRC_DAT7_12;
    uint32_t CRC_DAT7_13;
    uint32_t CRC_DAT7_14;
    uint32_t CRC_DAT7_15;
    uint32_t CRC_DAT7_16;
    uint32_t CRC_DAT7_17;
    uint32_t CRC_DAT7_18;
    uint32_t CRC_DAT7_19;
    uint32_t CRC_DAT7_20;
    uint32_t CRC_DAT7_21;
    uint32_t CRC_DAT7_22;
    uint32_t CRC_DAT7_23;
    uint32_t CRC_DAT7_24;
    uint32_t CRC_DAT7_25;
    uint32_t CRC_DAT7_26;
    uint32_t CRC_DAT7_27;
    uint32_t CRC_DAT7_28;
    uint32_t CRC_DAT7_29;
    uint32_t CRC_DAT7_30;
    uint32_t CRC_DAT7_31;
} stc_crc_dat7_bit_t;

typedef struct
{
    uint32_t CRC_DAT8_0;
    uint32_t CRC_DAT8_1;
    uint32_t CRC_DAT8_2;
    uint32_t CRC_DAT8_3;
    uint32_t CRC_DAT8_4;
    uint32_t CRC_DAT8_5;
    uint32_t CRC_DAT8_6;
    uint32_t CRC_DAT8_7;
    uint32_t CRC_DAT8_8;
    uint32_t CRC_DAT8_9;
    uint32_t CRC_DAT8_10;
    uint32_t CRC_DAT8_11;
    uint32_t CRC_DAT8_12;
    uint32_t CRC_DAT8_13;
    uint32_t CRC_DAT8_14;
    uint32_t CRC_DAT8_15;
    uint32_t CRC_DAT8_16;
    uint32_t CRC_DAT8_17;
    uint32_t CRC_DAT8_18;
    uint32_t CRC_DAT8_19;
    uint32_t CRC_DAT8_20;
    uint32_t CRC_DAT8_21;
    uint32_t CRC_DAT8_22;
    uint32_t CRC_DAT8_23;
    uint32_t CRC_DAT8_24;
    uint32_t CRC_DAT8_25;
    uint32_t CRC_DAT8_26;
    uint32_t CRC_DAT8_27;
    uint32_t CRC_DAT8_28;
    uint32_t CRC_DAT8_29;
    uint32_t CRC_DAT8_30;
    uint32_t CRC_DAT8_31;
} stc_crc_dat8_bit_t;

typedef struct
{
    uint32_t CRC_DAT9_0;
    uint32_t CRC_DAT9_1;
    uint32_t CRC_DAT9_2;
    uint32_t CRC_DAT9_3;
    uint32_t CRC_DAT9_4;
    uint32_t CRC_DAT9_5;
    uint32_t CRC_DAT9_6;
    uint32_t CRC_DAT9_7;
    uint32_t CRC_DAT9_8;
    uint32_t CRC_DAT9_9;
    uint32_t CRC_DAT9_10;
    uint32_t CRC_DAT9_11;
    uint32_t CRC_DAT9_12;
    uint32_t CRC_DAT9_13;
    uint32_t CRC_DAT9_14;
    uint32_t CRC_DAT9_15;
    uint32_t CRC_DAT9_16;
    uint32_t CRC_DAT9_17;
    uint32_t CRC_DAT9_18;
    uint32_t CRC_DAT9_19;
    uint32_t CRC_DAT9_20;
    uint32_t CRC_DAT9_21;
    uint32_t CRC_DAT9_22;
    uint32_t CRC_DAT9_23;
    uint32_t CRC_DAT9_24;
    uint32_t CRC_DAT9_25;
    uint32_t CRC_DAT9_26;
    uint32_t CRC_DAT9_27;
    uint32_t CRC_DAT9_28;
    uint32_t CRC_DAT9_29;
    uint32_t CRC_DAT9_30;
    uint32_t CRC_DAT9_31;
} stc_crc_dat9_bit_t;

typedef struct
{
    uint32_t CRC_DAT10_0;
    uint32_t CRC_DAT10_1;
    uint32_t CRC_DAT10_2;
    uint32_t CRC_DAT10_3;
    uint32_t CRC_DAT10_4;
    uint32_t CRC_DAT10_5;
    uint32_t CRC_DAT10_6;
    uint32_t CRC_DAT10_7;
    uint32_t CRC_DAT10_8;
    uint32_t CRC_DAT10_9;
    uint32_t CRC_DAT10_10;
    uint32_t CRC_DAT10_11;
    uint32_t CRC_DAT10_12;
    uint32_t CRC_DAT10_13;
    uint32_t CRC_DAT10_14;
    uint32_t CRC_DAT10_15;
    uint32_t CRC_DAT10_16;
    uint32_t CRC_DAT10_17;
    uint32_t CRC_DAT10_18;
    uint32_t CRC_DAT10_19;
    uint32_t CRC_DAT10_20;
    uint32_t CRC_DAT10_21;
    uint32_t CRC_DAT10_22;
    uint32_t CRC_DAT10_23;
    uint32_t CRC_DAT10_24;
    uint32_t CRC_DAT10_25;
    uint32_t CRC_DAT10_26;
    uint32_t CRC_DAT10_27;
    uint32_t CRC_DAT10_28;
    uint32_t CRC_DAT10_29;
    uint32_t CRC_DAT10_30;
    uint32_t CRC_DAT10_31;
} stc_crc_dat10_bit_t;

typedef struct
{
    uint32_t CRC_DAT11_0;
    uint32_t CRC_DAT11_1;
    uint32_t CRC_DAT11_2;
    uint32_t CRC_DAT11_3;
    uint32_t CRC_DAT11_4;
    uint32_t CRC_DAT11_5;
    uint32_t CRC_DAT11_6;
    uint32_t CRC_DAT11_7;
    uint32_t CRC_DAT11_8;
    uint32_t CRC_DAT11_9;
    uint32_t CRC_DAT11_10;
    uint32_t CRC_DAT11_11;
    uint32_t CRC_DAT11_12;
    uint32_t CRC_DAT11_13;
    uint32_t CRC_DAT11_14;
    uint32_t CRC_DAT11_15;
    uint32_t CRC_DAT11_16;
    uint32_t CRC_DAT11_17;
    uint32_t CRC_DAT11_18;
    uint32_t CRC_DAT11_19;
    uint32_t CRC_DAT11_20;
    uint32_t CRC_DAT11_21;
    uint32_t CRC_DAT11_22;
    uint32_t CRC_DAT11_23;
    uint32_t CRC_DAT11_24;
    uint32_t CRC_DAT11_25;
    uint32_t CRC_DAT11_26;
    uint32_t CRC_DAT11_27;
    uint32_t CRC_DAT11_28;
    uint32_t CRC_DAT11_29;
    uint32_t CRC_DAT11_30;
    uint32_t CRC_DAT11_31;
} stc_crc_dat11_bit_t;

typedef struct
{
    uint32_t CRC_DAT12_0;
    uint32_t CRC_DAT12_1;
    uint32_t CRC_DAT12_2;
    uint32_t CRC_DAT12_3;
    uint32_t CRC_DAT12_4;
    uint32_t CRC_DAT12_5;
    uint32_t CRC_DAT12_6;
    uint32_t CRC_DAT12_7;
    uint32_t CRC_DAT12_8;
    uint32_t CRC_DAT12_9;
    uint32_t CRC_DAT12_10;
    uint32_t CRC_DAT12_11;
    uint32_t CRC_DAT12_12;
    uint32_t CRC_DAT12_13;
    uint32_t CRC_DAT12_14;
    uint32_t CRC_DAT12_15;
    uint32_t CRC_DAT12_16;
    uint32_t CRC_DAT12_17;
    uint32_t CRC_DAT12_18;
    uint32_t CRC_DAT12_19;
    uint32_t CRC_DAT12_20;
    uint32_t CRC_DAT12_21;
    uint32_t CRC_DAT12_22;
    uint32_t CRC_DAT12_23;
    uint32_t CRC_DAT12_24;
    uint32_t CRC_DAT12_25;
    uint32_t CRC_DAT12_26;
    uint32_t CRC_DAT12_27;
    uint32_t CRC_DAT12_28;
    uint32_t CRC_DAT12_29;
    uint32_t CRC_DAT12_30;
    uint32_t CRC_DAT12_31;
} stc_crc_dat12_bit_t;

typedef struct
{
    uint32_t CRC_DAT13_0;
    uint32_t CRC_DAT13_1;
    uint32_t CRC_DAT13_2;
    uint32_t CRC_DAT13_3;
    uint32_t CRC_DAT13_4;
    uint32_t CRC_DAT13_5;
    uint32_t CRC_DAT13_6;
    uint32_t CRC_DAT13_7;
    uint32_t CRC_DAT13_8;
    uint32_t CRC_DAT13_9;
    uint32_t CRC_DAT13_10;
    uint32_t CRC_DAT13_11;
    uint32_t CRC_DAT13_12;
    uint32_t CRC_DAT13_13;
    uint32_t CRC_DAT13_14;
    uint32_t CRC_DAT13_15;
    uint32_t CRC_DAT13_16;
    uint32_t CRC_DAT13_17;
    uint32_t CRC_DAT13_18;
    uint32_t CRC_DAT13_19;
    uint32_t CRC_DAT13_20;
    uint32_t CRC_DAT13_21;
    uint32_t CRC_DAT13_22;
    uint32_t CRC_DAT13_23;
    uint32_t CRC_DAT13_24;
    uint32_t CRC_DAT13_25;
    uint32_t CRC_DAT13_26;
    uint32_t CRC_DAT13_27;
    uint32_t CRC_DAT13_28;
    uint32_t CRC_DAT13_29;
    uint32_t CRC_DAT13_30;
    uint32_t CRC_DAT13_31;
} stc_crc_dat13_bit_t;

typedef struct
{
    uint32_t CRC_DAT14_0;
    uint32_t CRC_DAT14_1;
    uint32_t CRC_DAT14_2;
    uint32_t CRC_DAT14_3;
    uint32_t CRC_DAT14_4;
    uint32_t CRC_DAT14_5;
    uint32_t CRC_DAT14_6;
    uint32_t CRC_DAT14_7;
    uint32_t CRC_DAT14_8;
    uint32_t CRC_DAT14_9;
    uint32_t CRC_DAT14_10;
    uint32_t CRC_DAT14_11;
    uint32_t CRC_DAT14_12;
    uint32_t CRC_DAT14_13;
    uint32_t CRC_DAT14_14;
    uint32_t CRC_DAT14_15;
    uint32_t CRC_DAT14_16;
    uint32_t CRC_DAT14_17;
    uint32_t CRC_DAT14_18;
    uint32_t CRC_DAT14_19;
    uint32_t CRC_DAT14_20;
    uint32_t CRC_DAT14_21;
    uint32_t CRC_DAT14_22;
    uint32_t CRC_DAT14_23;
    uint32_t CRC_DAT14_24;
    uint32_t CRC_DAT14_25;
    uint32_t CRC_DAT14_26;
    uint32_t CRC_DAT14_27;
    uint32_t CRC_DAT14_28;
    uint32_t CRC_DAT14_29;
    uint32_t CRC_DAT14_30;
    uint32_t CRC_DAT14_31;
} stc_crc_dat14_bit_t;

typedef struct
{
    uint32_t CRC_DAT15_0;
    uint32_t CRC_DAT15_1;
    uint32_t CRC_DAT15_2;
    uint32_t CRC_DAT15_3;
    uint32_t CRC_DAT15_4;
    uint32_t CRC_DAT15_5;
    uint32_t CRC_DAT15_6;
    uint32_t CRC_DAT15_7;
    uint32_t CRC_DAT15_8;
    uint32_t CRC_DAT15_9;
    uint32_t CRC_DAT15_10;
    uint32_t CRC_DAT15_11;
    uint32_t CRC_DAT15_12;
    uint32_t CRC_DAT15_13;
    uint32_t CRC_DAT15_14;
    uint32_t CRC_DAT15_15;
    uint32_t CRC_DAT15_16;
    uint32_t CRC_DAT15_17;
    uint32_t CRC_DAT15_18;
    uint32_t CRC_DAT15_19;
    uint32_t CRC_DAT15_20;
    uint32_t CRC_DAT15_21;
    uint32_t CRC_DAT15_22;
    uint32_t CRC_DAT15_23;
    uint32_t CRC_DAT15_24;
    uint32_t CRC_DAT15_25;
    uint32_t CRC_DAT15_26;
    uint32_t CRC_DAT15_27;
    uint32_t CRC_DAT15_28;
    uint32_t CRC_DAT15_29;
    uint32_t CRC_DAT15_30;
    uint32_t CRC_DAT15_31;
} stc_crc_dat15_bit_t;

typedef struct
{
    uint32_t CRC_DAT16_0;
    uint32_t CRC_DAT16_1;
    uint32_t CRC_DAT16_2;
    uint32_t CRC_DAT16_3;
    uint32_t CRC_DAT16_4;
    uint32_t CRC_DAT16_5;
    uint32_t CRC_DAT16_6;
    uint32_t CRC_DAT16_7;
    uint32_t CRC_DAT16_8;
    uint32_t CRC_DAT16_9;
    uint32_t CRC_DAT16_10;
    uint32_t CRC_DAT16_11;
    uint32_t CRC_DAT16_12;
    uint32_t CRC_DAT16_13;
    uint32_t CRC_DAT16_14;
    uint32_t CRC_DAT16_15;
    uint32_t CRC_DAT16_16;
    uint32_t CRC_DAT16_17;
    uint32_t CRC_DAT16_18;
    uint32_t CRC_DAT16_19;
    uint32_t CRC_DAT16_20;
    uint32_t CRC_DAT16_21;
    uint32_t CRC_DAT16_22;
    uint32_t CRC_DAT16_23;
    uint32_t CRC_DAT16_24;
    uint32_t CRC_DAT16_25;
    uint32_t CRC_DAT16_26;
    uint32_t CRC_DAT16_27;
    uint32_t CRC_DAT16_28;
    uint32_t CRC_DAT16_29;
    uint32_t CRC_DAT16_30;
    uint32_t CRC_DAT16_31;
} stc_crc_dat16_bit_t;

typedef struct
{
    uint32_t CRC_DAT17_0;
    uint32_t CRC_DAT17_1;
    uint32_t CRC_DAT17_2;
    uint32_t CRC_DAT17_3;
    uint32_t CRC_DAT17_4;
    uint32_t CRC_DAT17_5;
    uint32_t CRC_DAT17_6;
    uint32_t CRC_DAT17_7;
    uint32_t CRC_DAT17_8;
    uint32_t CRC_DAT17_9;
    uint32_t CRC_DAT17_10;
    uint32_t CRC_DAT17_11;
    uint32_t CRC_DAT17_12;
    uint32_t CRC_DAT17_13;
    uint32_t CRC_DAT17_14;
    uint32_t CRC_DAT17_15;
    uint32_t CRC_DAT17_16;
    uint32_t CRC_DAT17_17;
    uint32_t CRC_DAT17_18;
    uint32_t CRC_DAT17_19;
    uint32_t CRC_DAT17_20;
    uint32_t CRC_DAT17_21;
    uint32_t CRC_DAT17_22;
    uint32_t CRC_DAT17_23;
    uint32_t CRC_DAT17_24;
    uint32_t CRC_DAT17_25;
    uint32_t CRC_DAT17_26;
    uint32_t CRC_DAT17_27;
    uint32_t CRC_DAT17_28;
    uint32_t CRC_DAT17_29;
    uint32_t CRC_DAT17_30;
    uint32_t CRC_DAT17_31;
} stc_crc_dat17_bit_t;

typedef struct
{
    uint32_t CRC_DAT18_0;
    uint32_t CRC_DAT18_1;
    uint32_t CRC_DAT18_2;
    uint32_t CRC_DAT18_3;
    uint32_t CRC_DAT18_4;
    uint32_t CRC_DAT18_5;
    uint32_t CRC_DAT18_6;
    uint32_t CRC_DAT18_7;
    uint32_t CRC_DAT18_8;
    uint32_t CRC_DAT18_9;
    uint32_t CRC_DAT18_10;
    uint32_t CRC_DAT18_11;
    uint32_t CRC_DAT18_12;
    uint32_t CRC_DAT18_13;
    uint32_t CRC_DAT18_14;
    uint32_t CRC_DAT18_15;
    uint32_t CRC_DAT18_16;
    uint32_t CRC_DAT18_17;
    uint32_t CRC_DAT18_18;
    uint32_t CRC_DAT18_19;
    uint32_t CRC_DAT18_20;
    uint32_t CRC_DAT18_21;
    uint32_t CRC_DAT18_22;
    uint32_t CRC_DAT18_23;
    uint32_t CRC_DAT18_24;
    uint32_t CRC_DAT18_25;
    uint32_t CRC_DAT18_26;
    uint32_t CRC_DAT18_27;
    uint32_t CRC_DAT18_28;
    uint32_t CRC_DAT18_29;
    uint32_t CRC_DAT18_30;
    uint32_t CRC_DAT18_31;
} stc_crc_dat18_bit_t;

typedef struct
{
    uint32_t CRC_DAT19_0;
    uint32_t CRC_DAT19_1;
    uint32_t CRC_DAT19_2;
    uint32_t CRC_DAT19_3;
    uint32_t CRC_DAT19_4;
    uint32_t CRC_DAT19_5;
    uint32_t CRC_DAT19_6;
    uint32_t CRC_DAT19_7;
    uint32_t CRC_DAT19_8;
    uint32_t CRC_DAT19_9;
    uint32_t CRC_DAT19_10;
    uint32_t CRC_DAT19_11;
    uint32_t CRC_DAT19_12;
    uint32_t CRC_DAT19_13;
    uint32_t CRC_DAT19_14;
    uint32_t CRC_DAT19_15;
    uint32_t CRC_DAT19_16;
    uint32_t CRC_DAT19_17;
    uint32_t CRC_DAT19_18;
    uint32_t CRC_DAT19_19;
    uint32_t CRC_DAT19_20;
    uint32_t CRC_DAT19_21;
    uint32_t CRC_DAT19_22;
    uint32_t CRC_DAT19_23;
    uint32_t CRC_DAT19_24;
    uint32_t CRC_DAT19_25;
    uint32_t CRC_DAT19_26;
    uint32_t CRC_DAT19_27;
    uint32_t CRC_DAT19_28;
    uint32_t CRC_DAT19_29;
    uint32_t CRC_DAT19_30;
    uint32_t CRC_DAT19_31;
} stc_crc_dat19_bit_t;

typedef struct
{
    uint32_t CRC_DAT20_0;
    uint32_t CRC_DAT20_1;
    uint32_t CRC_DAT20_2;
    uint32_t CRC_DAT20_3;
    uint32_t CRC_DAT20_4;
    uint32_t CRC_DAT20_5;
    uint32_t CRC_DAT20_6;
    uint32_t CRC_DAT20_7;
    uint32_t CRC_DAT20_8;
    uint32_t CRC_DAT20_9;
    uint32_t CRC_DAT20_10;
    uint32_t CRC_DAT20_11;
    uint32_t CRC_DAT20_12;
    uint32_t CRC_DAT20_13;
    uint32_t CRC_DAT20_14;
    uint32_t CRC_DAT20_15;
    uint32_t CRC_DAT20_16;
    uint32_t CRC_DAT20_17;
    uint32_t CRC_DAT20_18;
    uint32_t CRC_DAT20_19;
    uint32_t CRC_DAT20_20;
    uint32_t CRC_DAT20_21;
    uint32_t CRC_DAT20_22;
    uint32_t CRC_DAT20_23;
    uint32_t CRC_DAT20_24;
    uint32_t CRC_DAT20_25;
    uint32_t CRC_DAT20_26;
    uint32_t CRC_DAT20_27;
    uint32_t CRC_DAT20_28;
    uint32_t CRC_DAT20_29;
    uint32_t CRC_DAT20_30;
    uint32_t CRC_DAT20_31;
} stc_crc_dat20_bit_t;

typedef struct
{
    uint32_t CRC_DAT21_0;
    uint32_t CRC_DAT21_1;
    uint32_t CRC_DAT21_2;
    uint32_t CRC_DAT21_3;
    uint32_t CRC_DAT21_4;
    uint32_t CRC_DAT21_5;
    uint32_t CRC_DAT21_6;
    uint32_t CRC_DAT21_7;
    uint32_t CRC_DAT21_8;
    uint32_t CRC_DAT21_9;
    uint32_t CRC_DAT21_10;
    uint32_t CRC_DAT21_11;
    uint32_t CRC_DAT21_12;
    uint32_t CRC_DAT21_13;
    uint32_t CRC_DAT21_14;
    uint32_t CRC_DAT21_15;
    uint32_t CRC_DAT21_16;
    uint32_t CRC_DAT21_17;
    uint32_t CRC_DAT21_18;
    uint32_t CRC_DAT21_19;
    uint32_t CRC_DAT21_20;
    uint32_t CRC_DAT21_21;
    uint32_t CRC_DAT21_22;
    uint32_t CRC_DAT21_23;
    uint32_t CRC_DAT21_24;
    uint32_t CRC_DAT21_25;
    uint32_t CRC_DAT21_26;
    uint32_t CRC_DAT21_27;
    uint32_t CRC_DAT21_28;
    uint32_t CRC_DAT21_29;
    uint32_t CRC_DAT21_30;
    uint32_t CRC_DAT21_31;
} stc_crc_dat21_bit_t;

typedef struct
{
    uint32_t CRC_DAT22_0;
    uint32_t CRC_DAT22_1;
    uint32_t CRC_DAT22_2;
    uint32_t CRC_DAT22_3;
    uint32_t CRC_DAT22_4;
    uint32_t CRC_DAT22_5;
    uint32_t CRC_DAT22_6;
    uint32_t CRC_DAT22_7;
    uint32_t CRC_DAT22_8;
    uint32_t CRC_DAT22_9;
    uint32_t CRC_DAT22_10;
    uint32_t CRC_DAT22_11;
    uint32_t CRC_DAT22_12;
    uint32_t CRC_DAT22_13;
    uint32_t CRC_DAT22_14;
    uint32_t CRC_DAT22_15;
    uint32_t CRC_DAT22_16;
    uint32_t CRC_DAT22_17;
    uint32_t CRC_DAT22_18;
    uint32_t CRC_DAT22_19;
    uint32_t CRC_DAT22_20;
    uint32_t CRC_DAT22_21;
    uint32_t CRC_DAT22_22;
    uint32_t CRC_DAT22_23;
    uint32_t CRC_DAT22_24;
    uint32_t CRC_DAT22_25;
    uint32_t CRC_DAT22_26;
    uint32_t CRC_DAT22_27;
    uint32_t CRC_DAT22_28;
    uint32_t CRC_DAT22_29;
    uint32_t CRC_DAT22_30;
    uint32_t CRC_DAT22_31;
} stc_crc_dat22_bit_t;

typedef struct
{
    uint32_t CRC_DAT23_0;
    uint32_t CRC_DAT23_1;
    uint32_t CRC_DAT23_2;
    uint32_t CRC_DAT23_3;
    uint32_t CRC_DAT23_4;
    uint32_t CRC_DAT23_5;
    uint32_t CRC_DAT23_6;
    uint32_t CRC_DAT23_7;
    uint32_t CRC_DAT23_8;
    uint32_t CRC_DAT23_9;
    uint32_t CRC_DAT23_10;
    uint32_t CRC_DAT23_11;
    uint32_t CRC_DAT23_12;
    uint32_t CRC_DAT23_13;
    uint32_t CRC_DAT23_14;
    uint32_t CRC_DAT23_15;
    uint32_t CRC_DAT23_16;
    uint32_t CRC_DAT23_17;
    uint32_t CRC_DAT23_18;
    uint32_t CRC_DAT23_19;
    uint32_t CRC_DAT23_20;
    uint32_t CRC_DAT23_21;
    uint32_t CRC_DAT23_22;
    uint32_t CRC_DAT23_23;
    uint32_t CRC_DAT23_24;
    uint32_t CRC_DAT23_25;
    uint32_t CRC_DAT23_26;
    uint32_t CRC_DAT23_27;
    uint32_t CRC_DAT23_28;
    uint32_t CRC_DAT23_29;
    uint32_t CRC_DAT23_30;
    uint32_t CRC_DAT23_31;
} stc_crc_dat23_bit_t;

