levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
typedef struct
{
    uint32_t CRC_DAT24_0;
    uint32_t CRC_DAT24_1;
    uint32_t CRC_DAT24_2;
    uint32_t CRC_DAT24_3;
    uint32_t CRC_DAT24_4;
    uint32_t CRC_DAT24_5;
    uint32_t CRC_DAT24_6;
    uint32_t CRC_DAT24_7;
    uint32_t CRC_DAT24_8;
    uint32_t CRC_DAT24_9;
    uint32_t CRC_DAT24_10;
    uint32_t CRC_DAT24_11;
    uint32_t CRC_DAT24_12;
    uint32_t CRC_DAT24_13;
    uint32_t CRC_DAT24_14;
    uint32_t CRC_DAT24_15;
    uint32_t CRC_DAT24_16;
    uint32_t CRC_DAT24_17;
    uint32_t CRC_DAT24_18;
    uint32_t CRC_DAT24_19;
    uint32_t CRC_DAT24_20;
    uint32_t CRC_DAT24_21;
    uint32_t CRC_DAT24_22;
    uint32_t CRC_DAT24_23;
    uint32_t CRC_DAT24_24;
    uint32_t CRC_DAT24_25;
    uint32_t CRC_DAT24_26;
    uint32_t CRC_DAT24_27;
    uint32_t CRC_DAT24_28;
    uint32_t CRC_DAT24_29;
    uint32_t CRC_DAT24_30;
    uint32_t CRC_DAT24_31;
} stc_crc_dat24_bit_t;

typedef struct
{
    uint32_t CRC_DAT25_0;
    uint32_t CRC_DAT25_1;
    uint32_t CRC_DAT25_2;
    uint32_t CRC_DAT25_3;
    uint32_t CRC_DAT25_4;
    uint32_t CRC_DAT25_5;
    uint32_t CRC_DAT25_6;
    uint32_t CRC_DAT25_7;
    uint32_t CRC_DAT25_8;
    uint32_t CRC_DAT25_9;
    uint32_t CRC_DAT25_10;
    uint32_t CRC_DAT25_11;
    uint32_t CRC_DAT25_12;
    uint32_t CRC_DAT25_13;
    uint32_t CRC_DAT25_14;
    uint32_t CRC_DAT25_15;
    uint32_t CRC_DAT25_16;
    uint32_t CRC_DAT25_17;
    uint32_t CRC_DAT25_18;
    uint32_t CRC_DAT25_19;
    uint32_t CRC_DAT25_20;
    uint32_t CRC_DAT25_21;
    uint32_t CRC_DAT25_22;
    uint32_t CRC_DAT25_23;
    uint32_t CRC_DAT25_24;
    uint32_t CRC_DAT25_25;
    uint32_t CRC_DAT25_26;
    uint32_t CRC_DAT25_27;
    uint32_t CRC_DAT25_28;
    uint32_t CRC_DAT25_29;
    uint32_t CRC_DAT25_30;
    uint32_t CRC_DAT25_31;
} stc_crc_dat25_bit_t;

typedef struct
{
    uint32_t CRC_DAT26_0;
    uint32_t CRC_DAT26_1;
    uint32_t CRC_DAT26_2;
    uint32_t CRC_DAT26_3;
    uint32_t CRC_DAT26_4;
    uint32_t CRC_DAT26_5;
    uint32_t CRC_DAT26_6;
    uint32_t CRC_DAT26_7;
    uint32_t CRC_DAT26_8;
    uint32_t CRC_DAT26_9;
    uint32_t CRC_DAT26_10;
    uint32_t CRC_DAT26_11;
    uint32_t CRC_DAT26_12;
    uint32_t CRC_DAT26_13;
    uint32_t CRC_DAT26_14;
    uint32_t CRC_DAT26_15;
    uint32_t CRC_DAT26_16;
    uint32_t CRC_DAT26_17;
    uint32_t CRC_DAT26_18;
    uint32_t CRC_DAT26_19;
    uint32_t CRC_DAT26_20;
    uint32_t CRC_DAT26_21;
    uint32_t CRC_DAT26_22;
    uint32_t CRC_DAT26_23;
    uint32_t CRC_DAT26_24;
    uint32_t CRC_DAT26_25;
    uint32_t CRC_DAT26_26;
    uint32_t CRC_DAT26_27;
    uint32_t CRC_DAT26_28;
    uint32_t CRC_DAT26_29;
    uint32_t CRC_DAT26_30;
    uint32_t CRC_DAT26_31;
} stc_crc_dat26_bit_t;

typedef struct
{
    uint32_t CRC_DAT27_0;
    uint32_t CRC_DAT27_1;
    uint32_t CRC_DAT27_2;
    uint32_t CRC_DAT27_3;
    uint32_t CRC_DAT27_4;
    uint32_t CRC_DAT27_5;
    uint32_t CRC_DAT27_6;
    uint32_t CRC_DAT27_7;
    uint32_t CRC_DAT27_8;
    uint32_t CRC_DAT27_9;
    uint32_t CRC_DAT27_10;
    uint32_t CRC_DAT27_11;
    uint32_t CRC_DAT27_12;
    uint32_t CRC_DAT27_13;
    uint32_t CRC_DAT27_14;
    uint32_t CRC_DAT27_15;
    uint32_t CRC_DAT27_16;
    uint32_t CRC_DAT27_17;
    uint32_t CRC_DAT27_18;
    uint32_t CRC_DAT27_19;
    uint32_t CRC_DAT27_20;
    uint32_t CRC_DAT27_21;
    uint32_t CRC_DAT27_22;
    uint32_t CRC_DAT27_23;
    uint32_t CRC_DAT27_24;
    uint32_t CRC_DAT27_25;
    uint32_t CRC_DAT27_26;
    uint32_t CRC_DAT27_27;
    uint32_t CRC_DAT27_28;
    uint32_t CRC_DAT27_29;
    uint32_t CRC_DAT27_30;
    uint32_t CRC_DAT27_31;
} stc_crc_dat27_bit_t;

typedef struct
{
    uint32_t CRC_DAT28_0;
    uint32_t CRC_DAT28_1;
    uint32_t CRC_DAT28_2;
    uint32_t CRC_DAT28_3;
    uint32_t CRC_DAT28_4;
    uint32_t CRC_DAT28_5;
    uint32_t CRC_DAT28_6;
    uint32_t CRC_DAT28_7;
    uint32_t CRC_DAT28_8;
    uint32_t CRC_DAT28_9;
    uint32_t CRC_DAT28_10;
    uint32_t CRC_DAT28_11;
    uint32_t CRC_DAT28_12;
    uint32_t CRC_DAT28_13;
    uint32_t CRC_DAT28_14;
    uint32_t CRC_DAT28_15;
    uint32_t CRC_DAT28_16;
    uint32_t CRC_DAT28_17;
    uint32_t CRC_DAT28_18;
    uint32_t CRC_DAT28_19;
    uint32_t CRC_DAT28_20;
    uint32_t CRC_DAT28_21;
    uint32_t CRC_DAT28_22;
    uint32_t CRC_DAT28_23;
    uint32_t CRC_DAT28_24;
    uint32_t CRC_DAT28_25;
    uint32_t CRC_DAT28_26;
    uint32_t CRC_DAT28_27;
    uint32_t CRC_DAT28_28;
    uint32_t CRC_DAT28_29;
    uint32_t CRC_DAT28_30;
    uint32_t CRC_DAT28_31;
} stc_crc_dat28_bit_t;

typedef struct
{
    uint32_t CRC_DAT29_0;
    uint32_t CRC_DAT29_1;
    uint32_t CRC_DAT29_2;
    uint32_t CRC_DAT29_3;
    uint32_t CRC_DAT29_4;
    uint32_t CRC_DAT29_5;
    uint32_t CRC_DAT29_6;
    uint32_t CRC_DAT29_7;
    uint32_t CRC_DAT29_8;
    uint32_t CRC_DAT29_9;
    uint32_t CRC_DAT29_10;
    uint32_t CRC_DAT29_11;
    uint32_t CRC_DAT29_12;
    uint32_t CRC_DAT29_13;
    uint32_t CRC_DAT29_14;
    uint32_t CRC_DAT29_15;
    uint32_t CRC_DAT29_16;
    uint32_t CRC_DAT29_17;
    uint32_t CRC_DAT29_18;
    uint32_t CRC_DAT29_19;
    uint32_t CRC_DAT29_20;
    uint32_t CRC_DAT29_21;
    uint32_t CRC_DAT29_22;
    uint32_t CRC_DAT29_23;
    uint32_t CRC_DAT29_24;
    uint32_t CRC_DAT29_25;
    uint32_t CRC_DAT29_26;
    uint32_t CRC_DAT29_27;
    uint32_t CRC_DAT29_28;
    uint32_t CRC_DAT29_29;
    uint32_t CRC_DAT29_30;
    uint32_t CRC_DAT29_31;
} stc_crc_dat29_bit_t;

typedef struct
{
    uint32_t CRC_DAT30_0;
    uint32_t CRC_DAT30_1;
    uint32_t CRC_DAT30_2;
    uint32_t CRC_DAT30_3;
    uint32_t CRC_DAT30_4;
    uint32_t CRC_DAT30_5;
    uint32_t CRC_DAT30_6;
    uint32_t CRC_DAT30_7;
    uint32_t CRC_DAT30_8;
    uint32_t CRC_DAT30_9;
    uint32_t CRC_DAT30_10;
    uint32_t CRC_DAT30_11;
    uint32_t CRC_DAT30_12;
    uint32_t CRC_DAT30_13;
    uint32_t CRC_DAT30_14;
    uint32_t CRC_DAT30_15;
    uint32_t CRC_DAT30_16;
    uint32_t CRC_DAT30_17;
    uint32_t CRC_DAT30_18;
    uint32_t CRC_DAT30_19;
    uint32_t CRC_DAT30_20;
    uint32_t CRC_DAT30_21;
    uint32_t CRC_DAT30_22;
    uint32_t CRC_DAT30_23;
    uint32_t CRC_DAT30_24;
    uint32_t CRC_DAT30_25;
    uint32_t CRC_DAT30_26;
    uint32_t CRC_DAT30_27;
    uint32_t CRC_DAT30_28;
    uint32_t CRC_DAT30_29;
    uint32_t CRC_DAT30_30;
    uint32_t CRC_DAT30_31;
} stc_crc_dat30_bit_t;

typedef struct
{
    uint32_t CRC_DAT31_0;
    uint32_t CRC_DAT31_1;
    uint32_t CRC_DAT31_2;
    uint32_t CRC_DAT31_3;
    uint32_t CRC_DAT31_4;
    uint32_t CRC_DAT31_5;
    uint32_t CRC_DAT31_6;
    uint32_t CRC_DAT31_7;
    uint32_t CRC_DAT31_8;
    uint32_t CRC_DAT31_9;
    uint32_t CRC_DAT31_10;
    uint32_t CRC_DAT31_11;
    uint32_t CRC_DAT31_12;
    uint32_t CRC_DAT31_13;
    uint32_t CRC_DAT31_14;
    uint32_t CRC_DAT31_15;
    uint32_t CRC_DAT31_16;
    uint32_t CRC_DAT31_17;
    uint32_t CRC_DAT31_18;
    uint32_t CRC_DAT31_19;
    uint32_t CRC_DAT31_20;
    uint32_t CRC_DAT31_21;
    uint32_t CRC_DAT31_22;
    uint32_t CRC_DAT31_23;
    uint32_t CRC_DAT31_24;
    uint32_t CRC_DAT31_25;
    uint32_t CRC_DAT31_26;
    uint32_t CRC_DAT31_27;
    uint32_t CRC_DAT31_28;
    uint32_t CRC_DAT31_29;
    uint32_t CRC_DAT31_30;
    uint32_t CRC_DAT31_31;
} stc_crc_dat31_bit_t;

typedef struct
{
    __IO uint32_t REFPSC0;
    __IO uint32_t REFPSC1;
    __IO uint32_t REFPSC2;
    uint32_t RESERVED0[1];
    __IO uint32_t REFCKS0;
    __IO uint32_t REFCKS1;
    __IO uint32_t ERRIE;
    __IO uint32_t CTCEN;
    uint32_t RESERVED1[8];
    __IO uint32_t TRMVAL0;
    __IO uint32_t TRMVAL1;
    __IO uint32_t TRMVAL2;
    __IO uint32_t TRMVAL3;
    __IO uint32_t TRMVAL4;
    __IO uint32_t TRMVAL5;
    uint32_t RESERVED2[10];
} stc_ctc_cr1_bit_t;

typedef struct
{
    __IO uint32_t OFSVAL0;
    __IO uint32_t OFSVAL1;
    __IO uint32_t OFSVAL2;
    __IO uint32_t OFSVAL3;
    __IO uint32_t OFSVAL4;
    __IO uint32_t OFSVAL5;
    __IO uint32_t OFSVAL6;
    __IO uint32_t OFSVAL7;
    uint32_t RESERVED0[8];
    __IO uint32_t RLDVAL0;
    __IO uint32_t RLDVAL1;
    __IO uint32_t RLDVAL2;
    __IO uint32_t RLDVAL3;
    __IO uint32_t RLDVAL4;
    __IO uint32_t RLDVAL5;
    __IO uint32_t RLDVAL6;
    __IO uint32_t RLDVAL7;
    __IO uint32_t RLDVAL8;
    __IO uint32_t RLDVAL9;
    __IO uint32_t RLDVAL10;
    __IO uint32_t RLDVAL11;
    __IO uint32_t RLDVAL12;
    __IO uint32_t RLDVAL13;
    __IO uint32_t RLDVAL14;
    __IO uint32_t RLDVAL15;
} stc_ctc_cr2_bit_t;

typedef struct
{
    __IO uint32_t TRIMOK;
    __IO uint32_t TRMOVF;
    __IO uint32_t TRMUDF;
    __IO uint32_t CTCBSY;
    uint32_t RESERVED0[28];
} stc_ctc_str_bit_t;

typedef struct
{
    __IO uint32_t DATA10;
    __IO uint32_t DATA11;
    __IO uint32_t DATA12;
    __IO uint32_t DATA13;
    __IO uint32_t DATA14;
    __IO uint32_t DATA15;
    __IO uint32_t DATA16;
    __IO uint32_t DATA17;
    __IO uint32_t DATA20;
    __IO uint32_t DATA21;
    __IO uint32_t DATA22;
    __IO uint32_t DATA23;
    __IO uint32_t DATA24;
    __IO uint32_t DATA25;
    __IO uint32_t DATA26;
    __IO uint32_t DATA27;
} stc_cmp_dadr1_bit_t;

typedef struct
{
    __IO uint32_t DAEN;
    uint32_t RESERVED0[7];
    __IO uint32_t ALGN;
    uint32_t RESERVED1[7];
} stc_cmp_dacr1_bit_t;

typedef struct
{
    __IO uint32_t DASW;
    uint32_t RESERVED0[7];
    __IO uint32_t WPRT0;
    __IO uint32_t WPRT1;
    __IO uint32_t WPRT2;
    __IO uint32_t WPRT3;
    __IO uint32_t WPRT4;
    __IO uint32_t WPRT5;
    __IO uint32_t WPRT6;
    __IO uint32_t WPRT7;
} stc_cmp_dadc1_bit_t;

typedef struct
{
    uint32_t DBG_AUTHID0_0;
    uint32_t DBG_AUTHID0_1;
    uint32_t DBG_AUTHID0_2;
    uint32_t DBG_AUTHID0_3;
    uint32_t DBG_AUTHID0_4;
    uint32_t DBG_AUTHID0_5;
    uint32_t DBG_AUTHID0_6;
    uint32_t DBG_AUTHID0_7;
    uint32_t DBG_AUTHID0_8;
    uint32_t DBG_AUTHID0_9;
    uint32_t DBG_AUTHID0_10;
    uint32_t DBG_AUTHID0_11;
    uint32_t DBG_AUTHID0_12;
    uint32_t DBG_AUTHID0_13;
    uint32_t DBG_AUTHID0_14;
    uint32_t DBG_AUTHID0_15;
    uint32_t DBG_AUTHID0_16;
    uint32_t DBG_AUTHID0_17;
    uint32_t DBG_AUTHID0_18;
    uint32_t DBG_AUTHID0_19;
    uint32_t DBG_AUTHID0_20;
    uint32_t DBG_AUTHID0_21;
    uint32_t DBG_AUTHID0_22;
    uint32_t DBG_AUTHID0_23;
    uint32_t DBG_AUTHID0_24;
    uint32_t DBG_AUTHID0_25;
    uint32_t DBG_AUTHID0_26;
    uint32_t DBG_AUTHID0_27;
    uint32_t DBG_AUTHID0_28;
    uint32_t DBG_AUTHID0_29;
    uint32_t DBG_AUTHID0_30;
    uint32_t DBG_AUTHID0_31;
} stc_dbg_authid0_bit_t;

typedef struct
{
    uint32_t DBG_AUTHID1_0;
    uint32_t DBG_AUTHID1_1;
    uint32_t DBG_AUTHID1_2;
    uint32_t DBG_AUTHID1_3;
    uint32_t DBG_AUTHID1_4;
    uint32_t DBG_AUTHID1_5;
    uint32_t DBG_AUTHID1_6;
    uint32_t DBG_AUTHID1_7;
    uint32_t DBG_AUTHID1_8;
    uint32_t DBG_AUTHID1_9;
    uint32_t DBG_AUTHID1_10;
    uint32_t DBG_AUTHID1_11;
    uint32_t DBG_AUTHID1_12;
    uint32_t DBG_AUTHID1_13;
    uint32_t DBG_AUTHID1_14;
    uint32_t DBG_AUTHID1_15;
    uint32_t DBG_AUTHID1_16;
    uint32_t DBG_AUTHID1_17;
    uint32_t DBG_AUTHID1_18;
    uint32_t DBG_AUTHID1_19;
    uint32_t DBG_AUTHID1_20;
    uint32_t DBG_AUTHID1_21;
    uint32_t DBG_AUTHID1_22;
    uint32_t DBG_AUTHID1_23;
    uint32_t DBG_AUTHID1_24;
    uint32_t DBG_AUTHID1_25;
    uint32_t DBG_AUTHID1_26;
    uint32_t DBG_AUTHID1_27;
    uint32_t DBG_AUTHID1_28;
    uint32_t DBG_AUTHID1_29;
    uint32_t DBG_AUTHID1_30;
    uint32_t DBG_AUTHID1_31;
} stc_dbg_authid1_bit_t;

typedef struct
{
    uint32_t DBG_AUTHID2_0;
    uint32_t DBG_AUTHID2_1;
    uint32_t DBG_AUTHID2_2;
    uint32_t DBG_AUTHID2_3;
    uint32_t DBG_AUTHID2_4;
    uint32_t DBG_AUTHID2_5;
    uint32_t DBG_AUTHID2_6;
    uint32_t DBG_AUTHID2_7;
    uint32_t DBG_AUTHID2_8;
    uint32_t DBG_AUTHID2_9;
    uint32_t DBG_AUTHID2_10;
    uint32_t DBG_AUTHID2_11;
    uint32_t DBG_AUTHID2_12;
    uint32_t DBG_AUTHID2_13;
    uint32_t DBG_AUTHID2_14;
    uint32_t DBG_AUTHID2_15;
    uint32_t DBG_AUTHID2_16;
    uint32_t DBG_AUTHID2_17;
    uint32_t DBG_AUTHID2_18;
    uint32_t DBG_AUTHID2_19;
    uint32_t DBG_AUTHID2_20;
    uint32_t DBG_AUTHID2_21;
    uint32_t DBG_AUTHID2_22;
    uint32_t DBG_AUTHID2_23;
    uint32_t DBG_AUTHID2_24;
    uint32_t DBG_AUTHID2_25;
    uint32_t DBG_AUTHID2_26;
    uint32_t DBG_AUTHID2_27;
    uint32_t DBG_AUTHID2_28;
    uint32_t DBG_AUTHID2_29;
    uint32_t DBG_AUTHID2_30;
    uint32_t DBG_AUTHID2_31;
} stc_dbg_authid2_bit_t;

typedef struct
{
    uint32_t DBG_RESV0_0;
    uint32_t DBG_RESV0_1;
    uint32_t DBG_RESV0_2;
    uint32_t DBG_RESV0_3;
    uint32_t DBG_RESV0_4;
    uint32_t DBG_RESV0_5;
    uint32_t DBG_RESV0_6;
    uint32_t DBG_RESV0_7;
    uint32_t DBG_RESV0_8;
    uint32_t DBG_RESV0_9;
    uint32_t DBG_RESV0_10;
    uint32_t DBG_RESV0_11;
    uint32_t DBG_RESV0_12;
    uint32_t DBG_RESV0_13;
    uint32_t DBG_RESV0_14;
    uint32_t DBG_RESV0_15;
    uint32_t DBG_RESV0_16;
    uint32_t DBG_RESV0_17;
    uint32_t DBG_RESV0_18;
    uint32_t DBG_RESV0_19;
    uint32_t DBG_RESV0_20;
    uint32_t DBG_RESV0_21;
    uint32_t DBG_RESV0_22;
    uint32_t DBG_RESV0_23;
    uint32_t DBG_RESV0_24;
    uint32_t DBG_RESV0_25;
    uint32_t DBG_RESV0_26;
    uint32_t DBG_RESV0_27;
    uint32_t DBG_RESV0_28;
    uint32_t DBG_RESV0_29;
    uint32_t DBG_RESV0_30;
    uint32_t DBG_RESV0_31;
} stc_dbg_resv0_bit_t;

typedef struct
{
    __IO uint32_t DBG_AUTH;
    __IO uint32_t FMC_REMVLOCK;
    __IO uint32_t FMC_SAFTYLOCK1;
    __IO uint32_t FMC_SAFTYLOCK2;
    uint32_t RESERVED0[4];
    __IO uint32_t MCUSTAT0;
    __IO uint32_t MCUSTAT1;
    uint32_t RESERVED1[22];
} stc_dbg_mcustat_bit_t;

typedef struct
{
    __IO uint32_t EDBGRQ;
    __IO uint32_t RESTART;
    uint32_t RESERVED0[6];
    __IO uint32_t DBG_IRQ;
    uint32_t RESERVED1[23];
} stc_dbg_mcuctl_bit_t;

typedef struct
{
    __IO uint32_t ERASEREQ;
    __IO uint32_t ERASEACK;
    __IO uint32_t ERASEERR;
    uint32_t RESERVED0[29];
} stc_dbg_fmcctl_bit_t;

typedef struct
{
    __IO uint32_t MODE0;
    __IO uint32_t MODE1;
    __IO uint32_t MODE2;
    __IO uint32_t DATASIZE0;
    __IO uint32_t DATASIZE1;
    uint32_t RESERVED0[3];
    __IO uint32_t COMP_TRG;
    uint32_t RESERVED1[22];
    __IO uint32_t INTEN;
} stc_dcu_ctl_bit_t;

typedef struct
{
    __IO uint32_t FLAG_OP;
    __IO uint32_t FLAG_LS2;
    __IO uint32_t FLAG_EQ2;
    __IO uint32_t FLAG_GT2;
    __IO uint32_t FLAG_LS1;
    __IO uint32_t FLAG_EQ1;
    __IO uint32_t FLAG_GT1;
    uint32_t RESERVED0[25];
} stc_dcu_flag_bit_t;

typedef struct
{
    uint32_t DCU_DATA0_0;
    uint32_t DCU_DATA0_1;
    uint32_t DCU_DATA0_2;
    uint32_t DCU_DATA0_3;
    uint32_t DCU_DATA0_4;
    uint32_t DCU_DATA0_5;
    uint32_t DCU_DATA0_6;
    uint32_t DCU_DATA0_7;
    uint32_t DCU_DATA0_8;
    uint32_t DCU_DATA0_9;
    uint32_t DCU_DATA0_10;
    uint32_t DCU_DATA0_11;
    uint32_t DCU_DATA0_12;
    uint32_t DCU_DATA0_13;
    uint32_t DCU_DATA0_14;
    uint32_t DCU_DATA0_15;
    uint32_t DCU_DATA0_16;
    uint32_t DCU_DATA0_17;
    uint32_t DCU_DATA0_18;
    uint32_t DCU_DATA0_19;
    uint32_t DCU_DATA0_20;
    uint32_t DCU_DATA0_21;
    uint32_t DCU_DATA0_22;
    uint32_t DCU_DATA0_23;
    uint32_t DCU_DATA0_24;
    uint32_t DCU_DATA0_25;
    uint32_t DCU_DATA0_26;
    uint32_t DCU_DATA0_27;
    uint32_t DCU_DATA0_28;
    uint32_t DCU_DATA0_29;
    uint32_t DCU_DATA0_30;
    uint32_t DCU_DATA0_31;
} stc_dcu_data0_bit_t;

typedef struct
{
    uint32_t DCU_DATA1_0;
    uint32_t DCU_DATA1_1;
    uint32_t DCU_DATA1_2;
    uint32_t DCU_DATA1_3;
    uint32_t DCU_DATA1_4;
    uint32_t DCU_DATA1_5;
    uint32_t DCU_DATA1_6;
    uint32_t DCU_DATA1_7;
    uint32_t DCU_DATA1_8;
    uint32_t DCU_DATA1_9;
    uint32_t DCU_DATA1_10;
    uint32_t DCU_DATA1_11;
    uint32_t DCU_DATA1_12;
    uint32_t DCU_DATA1_13;
    uint32_t DCU_DATA1_14;
    uint32_t DCU_DATA1_15;
    uint32_t DCU_DATA1_16;
    uint32_t DCU_DATA1_17;
    uint32_t DCU_DATA1_18;
    uint32_t DCU_DATA1_19;
    uint32_t DCU_DATA1_20;
    uint32_t DCU_DATA1_21;
    uint32_t DCU_DATA1_22;
    uint32_t DCU_DATA1_23;
    uint32_t DCU_DATA1_24;
    uint32_t DCU_DATA1_25;
    uint32_t DCU_DATA1_26;
    uint32_t DCU_DATA1_27;
    uint32_t DCU_DATA1_28;
    uint32_t DCU_DATA1_29;
    uint32_t DCU_DATA1_30;
    uint32_t DCU_DATA1_31;
} stc_dcu_data1_bit_t;

typedef struct
{
    uint32_t DCU_DATA2_0;
    uint32_t DCU_DATA2_1;
    uint32_t DCU_DATA2_2;
    uint32_t DCU_DATA2_3;
    uint32_t DCU_DATA2_4;
    uint32_t DCU_DATA2_5;
    uint32_t DCU_DATA2_6;
    uint32_t DCU_DATA2_7;
    uint32_t DCU_DATA2_8;
    uint32_t DCU_DATA2_9;
    uint32_t DCU_DATA2_10;
    uint32_t DCU_DATA2_11;
    uint32_t DCU_DATA2_12;
    uint32_t DCU_DATA2_13;
    uint32_t DCU_DATA2_14;
    uint32_t DCU_DATA2_15;
    uint32_t DCU_DATA2_16;
    uint32_t DCU_DATA2_17;
    uint32_t DCU_DATA2_18;
    uint32_t DCU_DATA2_19;
    uint32_t DCU_DATA2_20;
    uint32_t DCU_DATA2_21;
    uint32_t DCU_DATA2_22;
    uint32_t DCU_DATA2_23;
    uint32_t DCU_DATA2_24;
    uint32_t DCU_DATA2_25;
    uint32_t DCU_DATA2_26;
    uint32_t DCU_DATA2_27;
    uint32_t DCU_DATA2_28;
    uint32_t DCU_DATA2_29;
    uint32_t DCU_DATA2_30;
    uint32_t DCU_DATA2_31;
} stc_dcu_data2_bit_t;

typedef struct
{
    __IO uint32_t CLR_OP;
    __IO uint32_t CLR_LS2;
    __IO uint32_t CLR_EQ2;
    __IO uint32_t CLR_GT2;
    __IO uint32_t CLR_LS1;
    __IO uint32_t CLR_EQ1;
    __IO uint32_t CLR_GT1;
    uint32_t RESERVED0[25];
} stc_dcu_flagclr_bit_t;

typedef struct
{
    __IO uint32_t INT_OP;
    __IO uint32_t INT_LS2;
    __IO uint32_t INT_EQ2;
    __IO uint32_t INT_GT2;
    __IO uint32_t INT_LS1;
    __IO uint32_t INT_EQ1;
    __IO uint32_t INT_GT1;
    __IO uint32_t INT_WIN0;
    __IO uint32_t INT_WIN1;
    uint32_t RESERVED0[23];
} stc_dcu_intsel_bit_t;

typedef struct
{
    __IO uint32_t EN;
    uint32_t RESERVED0[31];
} stc_dma_en_bit_t;

typedef struct
{
    __IO uint32_t TRNERR0;
    __IO uint32_t TRNERR1;
    __IO uint32_t TRNERR2;
    __IO uint32_t TRNERR3;
    uint32_t RESERVED0[12];
    __IO uint32_t REQERR0;
    __IO uint32_t REQERR1;
    __IO uint32_t REQERR2;
    __IO uint32_t REQERR3;
    uint32_t RESERVED1[12];
} stc_dma_intstat0_bit_t;

typedef struct
{
    __IO uint32_t TC0;
    __IO uint32_t TC1;
    __IO uint32_t TC2;
    __IO uint32_t TC3;
    uint32_t RESERVED0[12];
    __IO uint32_t BTC0;
    __IO uint32_t BTC1;
    __IO uint32_t BTC2;
    __IO uint32_t BTC3;
    uint32_t RESERVED1[12];
} stc_dma_intstat1_bit_t;

typedef struct
{
    __IO uint32_t MSKTRNERR0;
    __IO uint32_t MSKTRNERR1;
    __IO uint32_t MSKTRNERR2;
    __IO uint32_t MSKTRNERR3;
    uint32_t RESERVED0[12];
    __IO uint32_t MSKREQERR0;
    __IO uint32_t MSKREQERR1;
    __IO uint32_t MSKREQERR2;
    __IO uint32_t MSKREQERR3;
    uint32_t RESERVED1[12];
} stc_dma_intmask0_bit_t;

typedef struct
{
    __IO uint32_t MSKTC0;
    __IO uint32_t MSKTC1;
    __IO uint32_t MSKTC2;
    __IO uint32_t MSKTC3;
    uint32_t RESERVED0[12];
    __IO uint32_t MSKBTC0;
    __IO uint32_t MSKBTC1;
    __IO uint32_t MSKBTC2;
    __IO uint32_t MSKBTC3;
    uint32_t RESERVED1[12];
} stc_dma_intmask1_bit_t;

typedef struct
{
    __IO uint32_t CLRTRNERR0;
    __IO uint32_t CLRTRNERR1;
    __IO uint32_t CLRTRNERR2;
    __IO uint32_t CLRTRNERR3;
    uint32_t RESERVED0[12];
    __IO uint32_t CLRREQERR0;
    __IO uint32_t CLRREQERR1;
    __IO uint32_t CLRREQERR2;
    __IO uint32_t CLRREQERR3;
    uint32_t RESERVED1[12];
} stc_dma_intclr0_bit_t;

typedef struct
{
    __IO uint32_t CLRTC0;
    __IO uint32_t CLRTC1;
    __IO uint32_t CLRTC2;
    __IO uint32_t CLRTC3;
    uint32_t RESERVED0[12];
    __IO uint32_t CLRBTC0;
    __IO uint32_t CLRBTC1;
    __IO uint32_t CLRBTC2;
    __IO uint32_t CLRBTC3;
    uint32_t RESERVED1[12];
} stc_dma_intclr1_bit_t;

typedef struct
{
    __IO uint32_t CHEN0;
    __IO uint32_t CHEN1;
    __IO uint32_t CHEN2;
    __IO uint32_t CHEN3;
    uint32_t RESERVED0[28];
} stc_dma_chen_bit_t;

typedef struct
{
    __IO uint32_t DMAACT;
    uint32_t RESERVED0[15];
    __IO uint32_t CHACT0;
    __IO uint32_t CHACT1;
    __IO uint32_t CHACT2;
    __IO uint32_t CHACT3;
    uint32_t RESERVED1[12];
} stc_dma_chstat_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLP10;
    __IO uint32_t LLP11;
    __IO uint32_t LLP12;
    __IO uint32_t LLP13;
    __IO uint32_t LLP14;
    __IO uint32_t LLP15;
    __IO uint32_t LLP16;
    __IO uint32_t LLP17;
} stc_dma_ram_llp_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLP10;
    __IO uint32_t LLP11;
    __IO uint32_t LLP12;
    __IO uint32_t LLP13;
    __IO uint32_t LLP14;
    __IO uint32_t LLP15;
    __IO uint32_t LLP16;
    __IO uint32_t LLP17;
} stc_dma_rom_llp_bit_t;

typedef struct
{
    __IO uint32_t CHENCLR0;
    __IO uint32_t CHENCLR1;
    __IO uint32_t CHENCLR2;
    __IO uint32_t CHENCLR3;
    uint32_t RESERVED0[28];
} stc_dma_chenclr_bit_t;

typedef struct
{
    uint32_t DMA_SAR0_0;
    uint32_t DMA_SAR0_1;
    uint32_t DMA_SAR0_2;
    uint32_t DMA_SAR0_3;
    uint32_t DMA_SAR0_4;
    uint32_t DMA_SAR0_5;
    uint32_t DMA_SAR0_6;
    uint32_t DMA_SAR0_7;
    uint32_t DMA_SAR0_8;
    uint32_t DMA_SAR0_9;
    uint32_t DMA_SAR0_10;
    uint32_t DMA_SAR0_11;
    uint32_t DMA_SAR0_12;
    uint32_t DMA_SAR0_13;
    uint32_t DMA_SAR0_14;
    uint32_t DMA_SAR0_15;
    uint32_t DMA_SAR0_16;
    uint32_t DMA_SAR0_17;
    uint32_t DMA_SAR0_18;
    uint32_t DMA_SAR0_19;
    uint32_t DMA_SAR0_20;
    uint32_t DMA_SAR0_21;
    uint32_t DMA_SAR0_22;
    uint32_t DMA_SAR0_23;
    uint32_t DMA_SAR0_24;
    uint32_t DMA_SAR0_25;
    uint32_t DMA_SAR0_26;
    uint32_t DMA_SAR0_27;
    uint32_t DMA_SAR0_28;
    uint32_t DMA_SAR0_29;
    uint32_t DMA_SAR0_30;
    uint32_t DMA_SAR0_31;
} stc_dma_sar0_bit_t;

typedef struct
{
    uint32_t DMA_DAR0_0;
    uint32_t DMA_DAR0_1;
    uint32_t DMA_DAR0_2;
    uint32_t DMA_DAR0_3;
    uint32_t DMA_DAR0_4;
    uint32_t DMA_DAR0_5;
    uint32_t DMA_DAR0_6;
    uint32_t DMA_DAR0_7;
    uint32_t DMA_DAR0_8;
    uint32_t DMA_DAR0_9;
    uint32_t DMA_DAR0_10;
    uint32_t DMA_DAR0_11;
    uint32_t DMA_DAR0_12;
    uint32_t DMA_DAR0_13;
    uint32_t DMA_DAR0_14;
    uint32_t DMA_DAR0_15;
    uint32_t DMA_DAR0_16;
    uint32_t DMA_DAR0_17;
    uint32_t DMA_DAR0_18;
    uint32_t DMA_DAR0_19;
    uint32_t DMA_DAR0_20;
    uint32_t DMA_DAR0_21;
    uint32_t DMA_DAR0_22;
    uint32_t DMA_DAR0_23;
    uint32_t DMA_DAR0_24;
    uint32_t DMA_DAR0_25;
    uint32_t DMA_DAR0_26;
    uint32_t DMA_DAR0_27;
    uint32_t DMA_DAR0_28;
    uint32_t DMA_DAR0_29;
    uint32_t DMA_DAR0_30;
    uint32_t DMA_DAR0_31;
} stc_dma_dar0_bit_t;

typedef struct
{
    __IO uint32_t BLKSIZE0;
    __IO uint32_t BLKSIZE1;
    __IO uint32_t BLKSIZE2;
    __IO uint32_t BLKSIZE3;
    __IO uint32_t BLKSIZE4;
    __IO uint32_t BLKSIZE5;
    __IO uint32_t BLKSIZE6;
    __IO uint32_t BLKSIZE7;
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
} stc_dma_ch0ctl0_bit_t;

