levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
typedef struct
{
    __IO uint32_t OFFSET0;
    __IO uint32_t OFFSET1;
    __IO uint32_t OFFSET2;
    __IO uint32_t OFFSET3;
    __IO uint32_t OFFSET4;
    __IO uint32_t OFFSET5;
    __IO uint32_t OFFSET6;
    __IO uint32_t OFFSET7;
    __IO uint32_t OFFSET8;
    __IO uint32_t OFFSET9;
    __IO uint32_t OFFSET10;
    __IO uint32_t OFFSET11;
    __IO uint32_t OFFSET12;
    __IO uint32_t OFFSET13;
    __IO uint32_t OFFSET14;
    __IO uint32_t OFFSET15;
    __IO uint32_t RPTNSCNT0;
    __IO uint32_t RPTNSCNT1;
    __IO uint32_t RPTNSCNT2;
    __IO uint32_t RPTNSCNT3;
    __IO uint32_t RPTNSCNT4;
    __IO uint32_t RPTNSCNT5;
    __IO uint32_t RPTNSCNT6;
    __IO uint32_t RPTNSCNT7;
    __IO uint32_t RPTNSEN;
    __IO uint32_t RPTNSSEL0;
    __IO uint32_t RPTNSSEL1;
    __IO uint32_t LLPSEL;
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
} stc_dma_ch0ctl1_bit_t;

typedef struct
{
    uint32_t DMA_SAR1_0;
    uint32_t DMA_SAR1_1;
    uint32_t DMA_SAR1_2;
    uint32_t DMA_SAR1_3;
    uint32_t DMA_SAR1_4;
    uint32_t DMA_SAR1_5;
    uint32_t DMA_SAR1_6;
    uint32_t DMA_SAR1_7;
    uint32_t DMA_SAR1_8;
    uint32_t DMA_SAR1_9;
    uint32_t DMA_SAR1_10;
    uint32_t DMA_SAR1_11;
    uint32_t DMA_SAR1_12;
    uint32_t DMA_SAR1_13;
    uint32_t DMA_SAR1_14;
    uint32_t DMA_SAR1_15;
    uint32_t DMA_SAR1_16;
    uint32_t DMA_SAR1_17;
    uint32_t DMA_SAR1_18;
    uint32_t DMA_SAR1_19;
    uint32_t DMA_SAR1_20;
    uint32_t DMA_SAR1_21;
    uint32_t DMA_SAR1_22;
    uint32_t DMA_SAR1_23;
    uint32_t DMA_SAR1_24;
    uint32_t DMA_SAR1_25;
    uint32_t DMA_SAR1_26;
    uint32_t DMA_SAR1_27;
    uint32_t DMA_SAR1_28;
    uint32_t DMA_SAR1_29;
    uint32_t DMA_SAR1_30;
    uint32_t DMA_SAR1_31;
} stc_dma_sar1_bit_t;

typedef struct
{
    uint32_t DMA_DAR1_0;
    uint32_t DMA_DAR1_1;
    uint32_t DMA_DAR1_2;
    uint32_t DMA_DAR1_3;
    uint32_t DMA_DAR1_4;
    uint32_t DMA_DAR1_5;
    uint32_t DMA_DAR1_6;
    uint32_t DMA_DAR1_7;
    uint32_t DMA_DAR1_8;
    uint32_t DMA_DAR1_9;
    uint32_t DMA_DAR1_10;
    uint32_t DMA_DAR1_11;
    uint32_t DMA_DAR1_12;
    uint32_t DMA_DAR1_13;
    uint32_t DMA_DAR1_14;
    uint32_t DMA_DAR1_15;
    uint32_t DMA_DAR1_16;
    uint32_t DMA_DAR1_17;
    uint32_t DMA_DAR1_18;
    uint32_t DMA_DAR1_19;
    uint32_t DMA_DAR1_20;
    uint32_t DMA_DAR1_21;
    uint32_t DMA_DAR1_22;
    uint32_t DMA_DAR1_23;
    uint32_t DMA_DAR1_24;
    uint32_t DMA_DAR1_25;
    uint32_t DMA_DAR1_26;
    uint32_t DMA_DAR1_27;
    uint32_t DMA_DAR1_28;
    uint32_t DMA_DAR1_29;
    uint32_t DMA_DAR1_30;
    uint32_t DMA_DAR1_31;
} stc_dma_dar1_bit_t;

typedef struct
{
    __IO uint32_t BLKSIZE0;
    __IO uint32_t BLKSIZE1;
    __IO uint32_t BLKSIZE2;
    __IO uint32_t BLKSIZE3;
    __IO uint32_t BLKSIZE4;
    __IO uint32_t BLKSIZE5;
    __IO uint32_t BLKSIZE6;
    __IO uint32_t BLKSIZE7;
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
} stc_dma_ch1ctl0_bit_t;

typedef struct
{
    __IO uint32_t OFFSET0;
    __IO uint32_t OFFSET1;
    __IO uint32_t OFFSET2;
    __IO uint32_t OFFSET3;
    __IO uint32_t OFFSET4;
    __IO uint32_t OFFSET5;
    __IO uint32_t OFFSET6;
    __IO uint32_t OFFSET7;
    __IO uint32_t OFFSET8;
    __IO uint32_t OFFSET9;
    __IO uint32_t OFFSET10;
    __IO uint32_t OFFSET11;
    __IO uint32_t OFFSET12;
    __IO uint32_t OFFSET13;
    __IO uint32_t OFFSET14;
    __IO uint32_t OFFSET15;
    __IO uint32_t RPTNSCNT0;
    __IO uint32_t RPTNSCNT1;
    __IO uint32_t RPTNSCNT2;
    __IO uint32_t RPTNSCNT3;
    __IO uint32_t RPTNSCNT4;
    __IO uint32_t RPTNSCNT5;
    __IO uint32_t RPTNSCNT6;
    __IO uint32_t RPTNSCNT7;
    __IO uint32_t RPTNSEN;
    __IO uint32_t RPTNSSEL0;
    __IO uint32_t RPTNSSEL1;
    __IO uint32_t LLPSEL;
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
} stc_dma_ch1ctl1_bit_t;

typedef struct
{
    uint32_t DMA_SAR2_0;
    uint32_t DMA_SAR2_1;
    uint32_t DMA_SAR2_2;
    uint32_t DMA_SAR2_3;
    uint32_t DMA_SAR2_4;
    uint32_t DMA_SAR2_5;
    uint32_t DMA_SAR2_6;
    uint32_t DMA_SAR2_7;
    uint32_t DMA_SAR2_8;
    uint32_t DMA_SAR2_9;
    uint32_t DMA_SAR2_10;
    uint32_t DMA_SAR2_11;
    uint32_t DMA_SAR2_12;
    uint32_t DMA_SAR2_13;
    uint32_t DMA_SAR2_14;
    uint32_t DMA_SAR2_15;
    uint32_t DMA_SAR2_16;
    uint32_t DMA_SAR2_17;
    uint32_t DMA_SAR2_18;
    uint32_t DMA_SAR2_19;
    uint32_t DMA_SAR2_20;
    uint32_t DMA_SAR2_21;
    uint32_t DMA_SAR2_22;
    uint32_t DMA_SAR2_23;
    uint32_t DMA_SAR2_24;
    uint32_t DMA_SAR2_25;
    uint32_t DMA_SAR2_26;
    uint32_t DMA_SAR2_27;
    uint32_t DMA_SAR2_28;
    uint32_t DMA_SAR2_29;
    uint32_t DMA_SAR2_30;
    uint32_t DMA_SAR2_31;
} stc_dma_sar2_bit_t;

typedef struct
{
    uint32_t DMA_DAR2_0;
    uint32_t DMA_DAR2_1;
    uint32_t DMA_DAR2_2;
    uint32_t DMA_DAR2_3;
    uint32_t DMA_DAR2_4;
    uint32_t DMA_DAR2_5;
    uint32_t DMA_DAR2_6;
    uint32_t DMA_DAR2_7;
    uint32_t DMA_DAR2_8;
    uint32_t DMA_DAR2_9;
    uint32_t DMA_DAR2_10;
    uint32_t DMA_DAR2_11;
    uint32_t DMA_DAR2_12;
    uint32_t DMA_DAR2_13;
    uint32_t DMA_DAR2_14;
    uint32_t DMA_DAR2_15;
    uint32_t DMA_DAR2_16;
    uint32_t DMA_DAR2_17;
    uint32_t DMA_DAR2_18;
    uint32_t DMA_DAR2_19;
    uint32_t DMA_DAR2_20;
    uint32_t DMA_DAR2_21;
    uint32_t DMA_DAR2_22;
    uint32_t DMA_DAR2_23;
    uint32_t DMA_DAR2_24;
    uint32_t DMA_DAR2_25;
    uint32_t DMA_DAR2_26;
    uint32_t DMA_DAR2_27;
    uint32_t DMA_DAR2_28;
    uint32_t DMA_DAR2_29;
    uint32_t DMA_DAR2_30;
    uint32_t DMA_DAR2_31;
} stc_dma_dar2_bit_t;

typedef struct
{
    __IO uint32_t BLKSIZE0;
    __IO uint32_t BLKSIZE1;
    __IO uint32_t BLKSIZE2;
    __IO uint32_t BLKSIZE3;
    __IO uint32_t BLKSIZE4;
    __IO uint32_t BLKSIZE5;
    __IO uint32_t BLKSIZE6;
    __IO uint32_t BLKSIZE7;
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
} stc_dma_ch2ctl0_bit_t;

typedef struct
{
    __IO uint32_t OFFSET0;
    __IO uint32_t OFFSET1;
    __IO uint32_t OFFSET2;
    __IO uint32_t OFFSET3;
    __IO uint32_t OFFSET4;
    __IO uint32_t OFFSET5;
    __IO uint32_t OFFSET6;
    __IO uint32_t OFFSET7;
    __IO uint32_t OFFSET8;
    __IO uint32_t OFFSET9;
    __IO uint32_t OFFSET10;
    __IO uint32_t OFFSET11;
    __IO uint32_t OFFSET12;
    __IO uint32_t OFFSET13;
    __IO uint32_t OFFSET14;
    __IO uint32_t OFFSET15;
    __IO uint32_t RPTNSCNT0;
    __IO uint32_t RPTNSCNT1;
    __IO uint32_t RPTNSCNT2;
    __IO uint32_t RPTNSCNT3;
    __IO uint32_t RPTNSCNT4;
    __IO uint32_t RPTNSCNT5;
    __IO uint32_t RPTNSCNT6;
    __IO uint32_t RPTNSCNT7;
    __IO uint32_t RPTNSEN;
    __IO uint32_t RPTNSSEL0;
    __IO uint32_t RPTNSSEL1;
    __IO uint32_t LLPSEL;
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
} stc_dma_ch2ctl1_bit_t;

typedef struct
{
    uint32_t DMA_SAR3_0;
    uint32_t DMA_SAR3_1;
    uint32_t DMA_SAR3_2;
    uint32_t DMA_SAR3_3;
    uint32_t DMA_SAR3_4;
    uint32_t DMA_SAR3_5;
    uint32_t DMA_SAR3_6;
    uint32_t DMA_SAR3_7;
    uint32_t DMA_SAR3_8;
    uint32_t DMA_SAR3_9;
    uint32_t DMA_SAR3_10;
    uint32_t DMA_SAR3_11;
    uint32_t DMA_SAR3_12;
    uint32_t DMA_SAR3_13;
    uint32_t DMA_SAR3_14;
    uint32_t DMA_SAR3_15;
    uint32_t DMA_SAR3_16;
    uint32_t DMA_SAR3_17;
    uint32_t DMA_SAR3_18;
    uint32_t DMA_SAR3_19;
    uint32_t DMA_SAR3_20;
    uint32_t DMA_SAR3_21;
    uint32_t DMA_SAR3_22;
    uint32_t DMA_SAR3_23;
    uint32_t DMA_SAR3_24;
    uint32_t DMA_SAR3_25;
    uint32_t DMA_SAR3_26;
    uint32_t DMA_SAR3_27;
    uint32_t DMA_SAR3_28;
    uint32_t DMA_SAR3_29;
    uint32_t DMA_SAR3_30;
    uint32_t DMA_SAR3_31;
} stc_dma_sar3_bit_t;

typedef struct
{
    uint32_t DMA_DAR3_0;
    uint32_t DMA_DAR3_1;
    uint32_t DMA_DAR3_2;
    uint32_t DMA_DAR3_3;
    uint32_t DMA_DAR3_4;
    uint32_t DMA_DAR3_5;
    uint32_t DMA_DAR3_6;
    uint32_t DMA_DAR3_7;
    uint32_t DMA_DAR3_8;
    uint32_t DMA_DAR3_9;
    uint32_t DMA_DAR3_10;
    uint32_t DMA_DAR3_11;
    uint32_t DMA_DAR3_12;
    uint32_t DMA_DAR3_13;
    uint32_t DMA_DAR3_14;
    uint32_t DMA_DAR3_15;
    uint32_t DMA_DAR3_16;
    uint32_t DMA_DAR3_17;
    uint32_t DMA_DAR3_18;
    uint32_t DMA_DAR3_19;
    uint32_t DMA_DAR3_20;
    uint32_t DMA_DAR3_21;
    uint32_t DMA_DAR3_22;
    uint32_t DMA_DAR3_23;
    uint32_t DMA_DAR3_24;
    uint32_t DMA_DAR3_25;
    uint32_t DMA_DAR3_26;
    uint32_t DMA_DAR3_27;
    uint32_t DMA_DAR3_28;
    uint32_t DMA_DAR3_29;
    uint32_t DMA_DAR3_30;
    uint32_t DMA_DAR3_31;
} stc_dma_dar3_bit_t;

typedef struct
{
    __IO uint32_t BLKSIZE0;
    __IO uint32_t BLKSIZE1;
    __IO uint32_t BLKSIZE2;
    __IO uint32_t BLKSIZE3;
    __IO uint32_t BLKSIZE4;
    __IO uint32_t BLKSIZE5;
    __IO uint32_t BLKSIZE6;
    __IO uint32_t BLKSIZE7;
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t LLP0;
    __IO uint32_t LLP1;
    __IO uint32_t LLP2;
    __IO uint32_t LLP3;
    __IO uint32_t LLP4;
    __IO uint32_t LLP5;
    __IO uint32_t LLP6;
    __IO uint32_t LLP7;
    __IO uint32_t LLP8;
    __IO uint32_t LLP9;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
} stc_dma_ch3ctl0_bit_t;

typedef struct
{
    __IO uint32_t OFFSET0;
    __IO uint32_t OFFSET1;
    __IO uint32_t OFFSET2;
    __IO uint32_t OFFSET3;
    __IO uint32_t OFFSET4;
    __IO uint32_t OFFSET5;
    __IO uint32_t OFFSET6;
    __IO uint32_t OFFSET7;
    __IO uint32_t OFFSET8;
    __IO uint32_t OFFSET9;
    __IO uint32_t OFFSET10;
    __IO uint32_t OFFSET11;
    __IO uint32_t OFFSET12;
    __IO uint32_t OFFSET13;
    __IO uint32_t OFFSET14;
    __IO uint32_t OFFSET15;
    __IO uint32_t RPTNSCNT0;
    __IO uint32_t RPTNSCNT1;
    __IO uint32_t RPTNSCNT2;
    __IO uint32_t RPTNSCNT3;
    __IO uint32_t RPTNSCNT4;
    __IO uint32_t RPTNSCNT5;
    __IO uint32_t RPTNSCNT6;
    __IO uint32_t RPTNSCNT7;
    __IO uint32_t RPTNSEN;
    __IO uint32_t RPTNSSEL0;
    __IO uint32_t RPTNSSEL1;
    __IO uint32_t LLPSEL;
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
} stc_dma_ch3ctl1_bit_t;

typedef struct
{
    __IO uint32_t FAPRT0;
    __IO uint32_t FAPRT1;
    __IO uint32_t FAPRT2;
    __IO uint32_t FAPRT3;
    __IO uint32_t FAPRT4;
    __IO uint32_t FAPRT5;
    __IO uint32_t FAPRT6;
    __IO uint32_t FAPRT7;
    __IO uint32_t FAPRT8;
    __IO uint32_t FAPRT9;
    __IO uint32_t FAPRT10;
    __IO uint32_t FAPRT11;
    __IO uint32_t FAPRT12;
    __IO uint32_t FAPRT13;
    __IO uint32_t FAPRT14;
    __IO uint32_t FAPRT15;
    uint32_t RESERVED0[16];
} stc_efm_faprt_bit_t;

typedef struct
{
    __IO uint32_t FSTP;
    uint32_t RESERVED0[31];
} stc_efm_fstp_bit_t;

typedef struct
{
    __IO uint32_t FLWT0;
    __IO uint32_t FLWT1;
    __IO uint32_t FLWT2;
    uint32_t RESERVED0[13];
    __IO uint32_t ICHE;
    __IO uint32_t DCHE;
    uint32_t RESERVED1[1];
    __IO uint32_t CRST;
    uint32_t RESERVED2[12];
} stc_efm_frmc_bit_t;

typedef struct
{
    __IO uint32_t PEMODE;
    uint32_t RESERVED0[3];
    __IO uint32_t PEMOD0;
    __IO uint32_t PEMOD1;
    __IO uint32_t PEMOD2;
    uint32_t RESERVED1[1];
    __IO uint32_t BUSHLDCTL;
    uint32_t RESERVED2[23];
} stc_efm_fwmc_bit_t;

typedef struct
{
    __IO uint32_t PEWERR;
    __IO uint32_t PEPRTERR;
    uint32_t RESERVED0[1];
    __IO uint32_t PGMISMTCH;
    __IO uint32_t OPTEND;
    __IO uint32_t RDCOLERR;
    uint32_t RESERVED1[2];
    __IO uint32_t RDY;
    uint32_t RESERVED2[23];
} stc_efm_fsr_bit_t;

typedef struct
{
    __IO uint32_t PEWERRCLR;
    __IO uint32_t PEPRTERRCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t PGMISMTCHCLR;
    __IO uint32_t OPTENDCLR;
    __IO uint32_t RDCOLERRCLR;
    uint32_t RESERVED1[26];
} stc_efm_fsclr_bit_t;

typedef struct
{
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t RDCOLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

typedef struct
{
    __IO uint32_t FPMTSW0;
    __IO uint32_t FPMTSW1;
    __IO uint32_t FPMTSW2;
    __IO uint32_t FPMTSW3;
    __IO uint32_t FPMTSW4;
    __IO uint32_t FPMTSW5;
    __IO uint32_t FPMTSW6;
    __IO uint32_t FPMTSW7;
    __IO uint32_t FPMTSW8;
    __IO uint32_t FPMTSW9;
    __IO uint32_t FPMTSW10;
    __IO uint32_t FPMTSW11;
    __IO uint32_t FPMTSW12;
    __IO uint32_t FPMTSW13;
    __IO uint32_t FPMTSW14;
    __IO uint32_t FPMTSW15;
    __IO uint32_t FPMTSW16;
    uint32_t RESERVED0[15];
} stc_efm_fpmtsw_bit_t;

typedef struct
{
    __IO uint32_t FPMTEW0;
    __IO uint32_t FPMTEW1;
    __IO uint32_t FPMTEW2;
    __IO uint32_t FPMTEW3;
    __IO uint32_t FPMTEW4;
    __IO uint32_t FPMTEW5;
    __IO uint32_t FPMTEW6;
    __IO uint32_t FPMTEW7;
    __IO uint32_t FPMTEW8;
    __IO uint32_t FPMTEW9;
    __IO uint32_t FPMTEW10;
    __IO uint32_t FPMTEW11;
    __IO uint32_t FPMTEW12;
    __IO uint32_t FPMTEW13;
    __IO uint32_t FPMTEW14;
    __IO uint32_t FPMTEW15;
    __IO uint32_t FPMTEW16;
    uint32_t RESERVED0[15];
} stc_efm_fpmtew_bit_t;

typedef struct
{
    uint32_t EFM_UQID0_0;
    uint32_t EFM_UQID0_1;
    uint32_t EFM_UQID0_2;
    uint32_t EFM_UQID0_3;
    uint32_t EFM_UQID0_4;
    uint32_t EFM_UQID0_5;
    uint32_t EFM_UQID0_6;
    uint32_t EFM_UQID0_7;
    uint32_t EFM_UQID0_8;
    uint32_t EFM_UQID0_9;
    uint32_t EFM_UQID0_10;
    uint32_t EFM_UQID0_11;
    uint32_t EFM_UQID0_12;
    uint32_t EFM_UQID0_13;
    uint32_t EFM_UQID0_14;
    uint32_t EFM_UQID0_15;
    uint32_t EFM_UQID0_16;
    uint32_t EFM_UQID0_17;
    uint32_t EFM_UQID0_18;
    uint32_t EFM_UQID0_19;
    uint32_t EFM_UQID0_20;
    uint32_t EFM_UQID0_21;
    uint32_t EFM_UQID0_22;
    uint32_t EFM_UQID0_23;
    uint32_t EFM_UQID0_24;
    uint32_t EFM_UQID0_25;
    uint32_t EFM_UQID0_26;
    uint32_t EFM_UQID0_27;
    uint32_t EFM_UQID0_28;
    uint32_t EFM_UQID0_29;
    uint32_t EFM_UQID0_30;
    uint32_t EFM_UQID0_31;
} stc_efm_uqid0_bit_t;

typedef struct
{
    uint32_t EFM_UQID1_0;
    uint32_t EFM_UQID1_1;
    uint32_t EFM_UQID1_2;
    uint32_t EFM_UQID1_3;
    uint32_t EFM_UQID1_4;
    uint32_t EFM_UQID1_5;
    uint32_t EFM_UQID1_6;
    uint32_t EFM_UQID1_7;
    uint32_t EFM_UQID1_8;
    uint32_t EFM_UQID1_9;
    uint32_t EFM_UQID1_10;
    uint32_t EFM_UQID1_11;
    uint32_t EFM_UQID1_12;
    uint32_t EFM_UQID1_13;
    uint32_t EFM_UQID1_14;
    uint32_t EFM_UQID1_15;
    uint32_t EFM_UQID1_16;
    uint32_t EFM_UQID1_17;
    uint32_t EFM_UQID1_18;
    uint32_t EFM_UQID1_19;
    uint32_t EFM_UQID1_20;
    uint32_t EFM_UQID1_21;
    uint32_t EFM_UQID1_22;
    uint32_t EFM_UQID1_23;
    uint32_t EFM_UQID1_24;
    uint32_t EFM_UQID1_25;
    uint32_t EFM_UQID1_26;
    uint32_t EFM_UQID1_27;
    uint32_t EFM_UQID1_28;
    uint32_t EFM_UQID1_29;
    uint32_t EFM_UQID1_30;
    uint32_t EFM_UQID1_31;
} stc_efm_uqid1_bit_t;

typedef struct
{
    uint32_t EFM_UQID2_0;
    uint32_t EFM_UQID2_1;
    uint32_t EFM_UQID2_2;
    uint32_t EFM_UQID2_3;
    uint32_t EFM_UQID2_4;
    uint32_t EFM_UQID2_5;
    uint32_t EFM_UQID2_6;
    uint32_t EFM_UQID2_7;
    uint32_t EFM_UQID2_8;
    uint32_t EFM_UQID2_9;
    uint32_t EFM_UQID2_10;
    uint32_t EFM_UQID2_11;
    uint32_t EFM_UQID2_12;
    uint32_t EFM_UQID2_13;
    uint32_t EFM_UQID2_14;
    uint32_t EFM_UQID2_15;
    uint32_t EFM_UQID2_16;
    uint32_t EFM_UQID2_17;
    uint32_t EFM_UQID2_18;
    uint32_t EFM_UQID2_19;
    uint32_t EFM_UQID2_20;
    uint32_t EFM_UQID2_21;
    uint32_t EFM_UQID2_22;
    uint32_t EFM_UQID2_23;
    uint32_t EFM_UQID2_24;
    uint32_t EFM_UQID2_25;
    uint32_t EFM_UQID2_26;
    uint32_t EFM_UQID2_27;
    uint32_t EFM_UQID2_28;
    uint32_t EFM_UQID2_29;
    uint32_t EFM_UQID2_30;
    uint32_t EFM_UQID2_31;
} stc_efm_uqid2_bit_t;

typedef struct
{
    uint32_t EFM_UQID3_0;
    uint32_t EFM_UQID3_1;
    uint32_t EFM_UQID3_2;
    uint32_t EFM_UQID3_3;
    uint32_t EFM_UQID3_4;
    uint32_t EFM_UQID3_5;
    uint32_t EFM_UQID3_6;
    uint32_t EFM_UQID3_7;
    uint32_t EFM_UQID3_8;
    uint32_t EFM_UQID3_9;
    uint32_t EFM_UQID3_10;
    uint32_t EFM_UQID3_11;
    uint32_t EFM_UQID3_12;
    uint32_t EFM_UQID3_13;
    uint32_t EFM_UQID3_14;
    uint32_t EFM_UQID3_15;
    uint32_t EFM_UQID3_16;
    uint32_t EFM_UQID3_17;
    uint32_t EFM_UQID3_18;
    uint32_t EFM_UQID3_19;
    uint32_t EFM_UQID3_20;
    uint32_t EFM_UQID3_21;
    uint32_t EFM_UQID3_22;
    uint32_t EFM_UQID3_23;
    uint32_t EFM_UQID3_24;
    uint32_t EFM_UQID3_25;
    uint32_t EFM_UQID3_26;
    uint32_t EFM_UQID3_27;
    uint32_t EFM_UQID3_28;
    uint32_t EFM_UQID3_29;
    uint32_t EFM_UQID3_30;
    uint32_t EFM_UQID3_31;
} stc_efm_uqid3_bit_t;

typedef struct
{
    __IO uint32_t HRCFREQS0;
    __IO uint32_t HRCFREQS1;
    __IO uint32_t HRCFREQS2;
    __IO uint32_t HRCFREQS3;
    uint32_t RESERVED0[4];
} stc_efm_hrccfgr_bit_t;

typedef struct
{
    __IO uint32_t CMPEN0;
    __IO uint32_t CMPEN1;
    __IO uint32_t CMPEN2;
    uint32_t RESERVED0[1];
    __IO uint32_t OSCSTPEN;
    __IO uint32_t PWMSEN0;
    __IO uint32_t PWMSEN1;
    __IO uint32_t PWMSEN2;
    __IO uint32_t PORTINEN0;
    __IO uint32_t PORTINEN1;
    __IO uint32_t PORTINEN2;
    uint32_t RESERVED1[5];
    __IO uint32_t NFSEL00;
    __IO uint32_t NFSEL01;
    __IO uint32_t NFEN0;
    __IO uint32_t INVSEL0;
    __IO uint32_t NFSEL10;
    __IO uint32_t NFSEL11;
    __IO uint32_t NFEN1;
    __IO uint32_t INVSEL1;
    __IO uint32_t NFSEL20;
    __IO uint32_t NFSEL21;
    __IO uint32_t NFEN2;
    __IO uint32_t INVSEL2;
    uint32_t RESERVED2[4];
} stc_emb_ctl0_bit_t;

typedef struct
{
    __IO uint32_t PWMLV0;
    __IO uint32_t PWMLV1;
    __IO uint32_t PWMLV2;
    uint32_t RESERVED0[29];
} stc_emb_pwmlv0_bit_t;

typedef struct
{
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe0_bit_t;

typedef struct
{
    __IO uint32_t PWMSF;
    __IO uint32_t CMPF;
    __IO uint32_t OSF;
    __IO uint32_t PWMST;
    uint32_t RESERVED0[4];
    __IO uint32_t PORTINF0;
    __IO uint32_t PORTINF1;
    __IO uint32_t PORTINF2;
    uint32_t RESERVED1[1];
    __IO uint32_t PORTINST0;
    __IO uint32_t PORTINST1;
    __IO uint32_t PORTINST2;
    uint32_t RESERVED2[17];
} stc_emb_stat0_bit_t;

typedef struct
{
    __IO uint32_t PWMSFCLR;
    __IO uint32_t CMPFCLR;
    __IO uint32_t OSFCLR;
    uint32_t RESERVED0[5];
    __IO uint32_t PORTINFCLR0;
    __IO uint32_t PORTINFCLR1;
    __IO uint32_t PORTINFCLR2;
    uint32_t RESERVED1[21];
} stc_emb_statclr0_bit_t;

typedef struct
{
    __IO uint32_t PWMINTEN;
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED0[5];
    __IO uint32_t PORTININTEN0;
    __IO uint32_t PORTININTEN1;
    __IO uint32_t PORTININTEN2;
    uint32_t RESERVED1[21];
} stc_emb_inten0_bit_t;

typedef struct
{
    __IO uint32_t CMPEN0;
    __IO uint32_t CMPEN1;
    __IO uint32_t CMPEN2;
    uint32_t RESERVED0[1];
    __IO uint32_t OSCSTPEN;
    uint32_t RESERVED1[3];
    __IO uint32_t PORTINEN0;
    __IO uint32_t PORTINEN1;
    __IO uint32_t PORTINEN2;
    uint32_t RESERVED2[5];
    __IO uint32_t NFSEL00;
    __IO uint32_t NFSEL01;
    __IO uint32_t NFEN0;
    __IO uint32_t INVSEL0;
    __IO uint32_t NFSEL10;
    __IO uint32_t NFSEL11;
    __IO uint32_t NFEN1;
    __IO uint32_t INVSEL1;
    __IO uint32_t NFSEL20;
    __IO uint32_t NFSEL21;
    __IO uint32_t NFEN2;
    __IO uint32_t INVSEL2;
    uint32_t RESERVED3[4];
} stc_emb_ctl1_bit_t;

typedef struct
{
    __IO uint32_t SOE;
    uint32_t RESERVED0[31];
} stc_emb_soe1_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t CMPF;
    __IO uint32_t OSF;
    uint32_t RESERVED1[5];
    __IO uint32_t PORTINF0;
    __IO uint32_t PORTINF1;
    __IO uint32_t PORTINF2;
    uint32_t RESERVED2[1];
    __IO uint32_t PORTINST0;
    __IO uint32_t PORTINST1;
    __IO uint32_t PORTINST2;
    uint32_t RESERVED3[17];
} stc_emb_stat1_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t CMPFCLR;
    __IO uint32_t OSFCLR;
    uint32_t RESERVED1[5];
    __IO uint32_t PORTINFCLR0;
    __IO uint32_t PORTINFCLR1;
    __IO uint32_t PORTINFCLR2;
    uint32_t RESERVED2[21];
} stc_emb_statclr1_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t CMPINTEN;
    __IO uint32_t OSINTEN;
    uint32_t RESERVED1[5];
    __IO uint32_t PORTININTEN0;
    __IO uint32_t PORTININTEN1;
    __IO uint32_t PORTININTEN2;
    uint32_t RESERVED2[21];
} stc_emb_inten1_bit_t;

typedef struct
{
    __IO uint32_t EMBVAL0;
    __IO uint32_t EMBVAL1;
    uint32_t RESERVED0[30];
} stc_emb_ecsr_bit_t;

typedef struct
{
    __IO uint32_t LVR0;
    __IO uint32_t LVR1;
    __IO uint32_t LVR2;
    __IO uint32_t LVR3;
    __IO uint32_t LVR4;
    __IO uint32_t LVR5;
    __IO uint32_t LVR6;
    __IO uint32_t LVR7;
    __IO uint32_t LVR8;
    __IO uint32_t LVR9;
    __IO uint32_t LVR10;
    __IO uint32_t LVR11;
    __IO uint32_t LVR12;
    __IO uint32_t LVR13;
    __IO uint32_t LVR14;
    __IO uint32_t LVR15;
    uint32_t RESERVED0[16];
} stc_fcm_lvr_bit_t;

typedef struct
{
    __IO uint32_t UVR0;
    __IO uint32_t UVR1;
    __IO uint32_t UVR2;
    __IO uint32_t UVR3;
    __IO uint32_t UVR4;
    __IO uint32_t UVR5;
    __IO uint32_t UVR6;
    __IO uint32_t UVR7;
    __IO uint32_t UVR8;
    __IO uint32_t UVR9;
    __IO uint32_t UVR10;
    __IO uint32_t UVR11;
    __IO uint32_t UVR12;
    __IO uint32_t UVR13;
    __IO uint32_t UVR14;
    __IO uint32_t UVR15;
    uint32_t RESERVED0[16];
} stc_fcm_uvr_bit_t;

typedef struct
{
    __IO uint32_t CNTR0;
    __IO uint32_t CNTR1;
    __IO uint32_t CNTR2;
    __IO uint32_t CNTR3;
    __IO uint32_t CNTR4;
    __IO uint32_t CNTR5;
    __IO uint32_t CNTR6;
    __IO uint32_t CNTR7;
    __IO uint32_t CNTR8;
    __IO uint32_t CNTR9;
    __IO uint32_t CNTR10;
    __IO uint32_t CNTR11;
    __IO uint32_t CNTR12;
    __IO uint32_t CNTR13;
    __IO uint32_t CNTR14;
    __IO uint32_t CNTR15;
    uint32_t RESERVED0[16];
} stc_fcm_cntr_bit_t;

typedef struct
{
    __IO uint32_t START;
    uint32_t RESERVED0[31];
} stc_fcm_str_bit_t;

typedef struct
{
    __IO uint32_t MDIVS0;
    __IO uint32_t MDIVS1;
    uint32_t RESERVED0[2];
    __IO uint32_t MCKS0;
    __IO uint32_t MCKS1;
    __IO uint32_t MCKS2;
    __IO uint32_t MCKS3;
    uint32_t RESERVED1[24];
} stc_fcm_mccr_bit_t;

typedef struct
{
    __IO uint32_t RDIVS0;
    __IO uint32_t RDIVS1;
    uint32_t RESERVED0[1];
    __IO uint32_t RCKS0;
    __IO uint32_t RCKS1;
    __IO uint32_t RCKS2;
    __IO uint32_t RCKS3;
    __IO uint32_t INEXS;
    __IO uint32_t DNFS0;
    __IO uint32_t DNFS1;
    uint32_t RESERVED1[2];
    __IO uint32_t EDGES0;
    __IO uint32_t EDGES1;
    uint32_t RESERVED2[1];
    __IO uint32_t EXREFE;
    uint32_t RESERVED3[16];
} stc_fcm_rccr_bit_t;

