levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
typedef struct
{
    __IO uint32_t ERRIE;
    __IO uint32_t MENDIE;
    __IO uint32_t OVFIE;
    uint32_t RESERVED0[1];
    __IO uint32_t ERRINTRS;
    uint32_t RESERVED1[2];
    __IO uint32_t ERRE;
    uint32_t RESERVED2[24];
} stc_fcm_rier_bit_t;

typedef struct
{
    __IO uint32_t ERRF;
    __IO uint32_t MENDF;
    __IO uint32_t OVF;
    uint32_t RESERVED0[29];
} stc_fcm_sr_bit_t;

typedef struct
{
    __IO uint32_t ERRFCLR;
    __IO uint32_t MENDFCLR;
    __IO uint32_t OVFCLR;
    uint32_t RESERVED0[29];
} stc_fcm_clr_bit_t;

typedef struct
{
    __IO uint32_t PIN0;
    __IO uint32_t PIN1;
    __IO uint32_t PIN2;
    __IO uint32_t PIN3;
    __IO uint32_t PIN4;
    __IO uint32_t PIN5;
    __IO uint32_t PIN6;
    __IO uint32_t PIN7;
} stc_gpio_pidr_bit_t;

typedef struct
{
    __IO uint32_t POUT0;
    __IO uint32_t POUT1;
    __IO uint32_t POUT2;
    __IO uint32_t POUT3;
    __IO uint32_t POUT4;
    __IO uint32_t POUT5;
    __IO uint32_t POUT6;
    __IO uint32_t POUT7;
} stc_gpio_podr_bit_t;

typedef struct
{
    __IO uint32_t POUTE0;
    __IO uint32_t POUTE1;
    __IO uint32_t POUTE2;
    __IO uint32_t POUTE3;
    __IO uint32_t POUTE4;
    __IO uint32_t POUTE5;
    __IO uint32_t POUTE6;
    __IO uint32_t POUTE7;
} stc_gpio_poer_bit_t;

typedef struct
{
    __IO uint32_t POS0;
    __IO uint32_t POS1;
    __IO uint32_t POS2;
    __IO uint32_t POS3;
    __IO uint32_t POS4;
    __IO uint32_t POS5;
    __IO uint32_t POS6;
    __IO uint32_t POS7;
} stc_gpio_posr_bit_t;

typedef struct
{
    __IO uint32_t POR0;
    __IO uint32_t POR1;
    __IO uint32_t POR2;
    __IO uint32_t POR3;
    __IO uint32_t POR4;
    __IO uint32_t POR5;
    __IO uint32_t POR6;
    __IO uint32_t POR7;
} stc_gpio_porr_bit_t;

typedef struct
{
    __IO uint32_t POT0;
    __IO uint32_t POT1;
    __IO uint32_t POT2;
    __IO uint32_t POT3;
    __IO uint32_t POT4;
    __IO uint32_t POT5;
    __IO uint32_t POT6;
    __IO uint32_t POT7;
} stc_gpio_potr_bit_t;

typedef struct
{
    __IO uint32_t SPFE0;
    __IO uint32_t SPFE1;
    __IO uint32_t SPFE2;
    __IO uint32_t SPFE3;
    __IO uint32_t SPFE4;
    uint32_t RESERVED0[11];
} stc_gpio_pspcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[14];
    __IO uint32_t RDWT0;
    __IO uint32_t RDWT1;
} stc_gpio_pccr_bit_t;

typedef struct
{
    __IO uint32_t PINAE0;
    __IO uint32_t PINAE1;
    __IO uint32_t PINAE2;
    __IO uint32_t PINAE3;
    __IO uint32_t PINAE4;
    __IO uint32_t PINAE5;
    uint32_t RESERVED0[1];
    __IO uint32_t PINAE7;
    uint32_t RESERVED1[1];
    __IO uint32_t PINAE9;
    __IO uint32_t PINAE10;
    __IO uint32_t PINAE11;
    uint32_t RESERVED2[1];
    __IO uint32_t PINAE13;
    __IO uint32_t PINAE14;
    uint32_t RESERVED3[1];
} stc_gpio_pinaer_bit_t;

typedef struct
{
    __IO uint32_t WE;
    uint32_t RESERVED0[7];
    __IO uint32_t WP0;
    __IO uint32_t WP1;
    __IO uint32_t WP2;
    __IO uint32_t WP3;
    __IO uint32_t WP4;
    __IO uint32_t WP5;
    __IO uint32_t WP6;
    __IO uint32_t WP7;
} stc_gpio_pwpr_bit_t;

typedef struct
{
    __IO uint32_t POUT;
    __IO uint32_t POUTE;
    __IO uint32_t NOD;
    uint32_t RESERVED0[1];
    __IO uint32_t DRV;
    __IO uint32_t LTE;
    __IO uint32_t PUU;
    uint32_t RESERVED1[1];
    __IO uint32_t PIN;
    __IO uint32_t INVE;
    __IO uint32_t CINSEL;
    __IO uint32_t INTE;
    uint32_t RESERVED2[4];
} stc_gpio_pcr_bit_t;

typedef struct
{
    __IO uint32_t FSEL0;
    __IO uint32_t FSEL1;
    __IO uint32_t FSEL2;
    uint32_t RESERVED0[13];
} stc_gpio_pfsr_bit_t;

typedef struct
{
    __IO uint32_t PE;
    __IO uint32_t SMBUS;
    __IO uint32_t SMBALRTEN;
    __IO uint32_t SMBDEFAULTEN;
    __IO uint32_t SMBHOSTEN;
    __IO uint32_t FACKEN;
    __IO uint32_t GCEN;
    __IO uint32_t RESTART;
    __IO uint32_t START;
    __IO uint32_t STOP;
    __IO uint32_t ACK;
    uint32_t RESERVED0[4];
    __IO uint32_t SWRST;
    uint32_t RESERVED1[16];
} stc_i2c_cr1_bit_t;

typedef struct
{
    __IO uint32_t STARTIE;
    __IO uint32_t SLADDR0IE;
    __IO uint32_t SLADDR1IE;
    __IO uint32_t TENDIE;
    __IO uint32_t STOPIE;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLIE;
    __IO uint32_t TEMPTYIE;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOIE;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKIE;
    uint32_t RESERVED3[7];
    __IO uint32_t GENCALLIE;
    __IO uint32_t SMBDEFAULTIE;
    __IO uint32_t SMBHOSTIE;
    __IO uint32_t SMBALRTIE;
    uint32_t RESERVED4[8];
} stc_i2c_cr2_bit_t;

typedef struct
{
    __IO uint32_t SLADDR00;
    __IO uint32_t SLADDR01;
    __IO uint32_t SLADDR02;
    __IO uint32_t SLADDR03;
    __IO uint32_t SLADDR04;
    __IO uint32_t SLADDR05;
    __IO uint32_t SLADDR06;
    __IO uint32_t SLADDR07;
    __IO uint32_t SLADDR08;
    __IO uint32_t SLADDR09;
    uint32_t RESERVED0[2];
    __IO uint32_t SLADDR0EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD0;
    uint32_t RESERVED2[16];
} stc_i2c_slr0_bit_t;

typedef struct
{
    __IO uint32_t SLADDR10;
    __IO uint32_t SLADDR11;
    __IO uint32_t SLADDR12;
    __IO uint32_t SLADDR13;
    __IO uint32_t SLADDR14;
    __IO uint32_t SLADDR15;
    __IO uint32_t SLADDR16;
    __IO uint32_t SLADDR17;
    __IO uint32_t SLADDR18;
    __IO uint32_t SLADDR19;
    uint32_t RESERVED0[2];
    __IO uint32_t SLADDR1EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD1;
    uint32_t RESERVED2[16];
} stc_i2c_slr1_bit_t;

typedef struct
{
    __IO uint32_t STARTF;
    __IO uint32_t SLADDR0F;
    __IO uint32_t SLADDR1F;
    __IO uint32_t TENDF;
    __IO uint32_t STOPF;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLF;
    __IO uint32_t TEMPTYF;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOF;
    __IO uint32_t ACKRF;
    uint32_t RESERVED2[1];
    __IO uint32_t NACKF;
    uint32_t RESERVED3[3];
    __IO uint32_t MSL;
    __IO uint32_t BUSY;
    __IO uint32_t TRA;
    uint32_t RESERVED4[1];
    __IO uint32_t GENCALLF;
    __IO uint32_t SMBDEFAULTF;
    __IO uint32_t SMBHOSTF;
    __IO uint32_t SMBALRTF;
    uint32_t RESERVED5[8];
} stc_i2c_sr_bit_t;

typedef struct
{
    __IO uint32_t STARTFCLR;
    __IO uint32_t SLADDR0FCLR;
    __IO uint32_t SLADDR1FCLR;
    __IO uint32_t TENDFCLR;
    __IO uint32_t STOPFCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLFCLR;
    __IO uint32_t TEMPTYFCLR;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOFCLR;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKFCLR;
    uint32_t RESERVED3[7];
    __IO uint32_t GENCALLFCLR;
    __IO uint32_t SMBDEFAULTF;
    __IO uint32_t SMBHOSTFCL;
    __IO uint32_t SMBALRTFCLR;
    uint32_t RESERVED4[8];
} stc_i2c_clr_bit_t;

typedef struct
{
    __IO uint32_t DT0;
    __IO uint32_t DT1;
    __IO uint32_t DT2;
    __IO uint32_t DT3;
    __IO uint32_t DT4;
    __IO uint32_t DT5;
    __IO uint32_t DT6;
    __IO uint32_t DT7;
    uint32_t RESERVED0[24];
} stc_i2c_dtr_bit_t;

typedef struct
{
    __IO uint32_t DR0;
    __IO uint32_t DR1;
    __IO uint32_t DR2;
    __IO uint32_t DR3;
    __IO uint32_t DR4;
    __IO uint32_t DR5;
    __IO uint32_t DR6;
    __IO uint32_t DR7;
    uint32_t RESERVED0[24];
} stc_i2c_drr_bit_t;

typedef struct
{
    __IO uint32_t SLOWW0;
    __IO uint32_t SLOWW1;
    __IO uint32_t SLOWW2;
    __IO uint32_t SLOWW3;
    __IO uint32_t SLOWW4;
    uint32_t RESERVED0[3];
    __IO uint32_t SHIGHW0;
    __IO uint32_t SHIGHW1;
    __IO uint32_t SHIGHW2;
    __IO uint32_t SHIGHW3;
    __IO uint32_t SHIGHW4;
    uint32_t RESERVED1[3];
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    uint32_t RESERVED2[4];
    __IO uint32_t FMPE;
    uint32_t RESERVED3[8];
} stc_i2c_ccr_bit_t;

typedef struct
{
    __IO uint32_t DNF0;
    __IO uint32_t DNF1;
    uint32_t RESERVED0[2];
    __IO uint32_t DNFEN;
    __IO uint32_t ANFEN;
    uint32_t RESERVED1[26];
} stc_i2c_fltr_bit_t;

typedef struct
{
    __IO uint32_t SWDTAUTST;
    __IO uint32_t SWDTITS;
    __IO uint32_t SWDTPERI0;
    __IO uint32_t SWDTPERI1;
    __IO uint32_t SWDTCKS0;
    __IO uint32_t SWDTCKS1;
    __IO uint32_t SWDTCKS2;
    __IO uint32_t SWDTCKS3;
    __IO uint32_t SWDTWDPT0;
    __IO uint32_t SWDTWDPT1;
    __IO uint32_t SWDTWDPT2;
    __IO uint32_t SWDTWDPT3;
    __IO uint32_t SWDTSLPOFF;
    uint32_t RESERVED0[3];
    __IO uint32_t HRCREQS0;
    __IO uint32_t HRCREQS1;
    __IO uint32_t HRCREQS2;
    __IO uint32_t HRCREQS3;
    __IO uint32_t HRCSTOP;
    uint32_t RESERVED1[5];
    __IO uint32_t NMIFCLK0;
    __IO uint32_t NMIFCLK1;
    __IO uint32_t NMIFEN;
    __IO uint32_t NMITRG;
    __IO uint32_t NMIEN;
    __IO uint32_t NMIICGNE;
} stc_icg_icg0_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t LKUPDIS;
    uint32_t RESERVED1[3];
    __IO uint32_t LVD0LVL0;
    __IO uint32_t LVD0LVL1;
    __IO uint32_t LVD0LVL2;
    __IO uint32_t LVDDIS;
    uint32_t RESERVED2[16];
} stc_icg_icg1_bit_t;

typedef struct
{
    uint32_t ICG_ICG2_0;
    uint32_t ICG_ICG2_1;
    uint32_t ICG_ICG2_2;
    uint32_t ICG_ICG2_3;
    uint32_t ICG_ICG2_4;
    uint32_t ICG_ICG2_5;
    uint32_t ICG_ICG2_6;
    uint32_t ICG_ICG2_7;
    uint32_t ICG_ICG2_8;
    uint32_t ICG_ICG2_9;
    uint32_t ICG_ICG2_10;
    uint32_t ICG_ICG2_11;
    uint32_t ICG_ICG2_12;
    uint32_t ICG_ICG2_13;
    uint32_t ICG_ICG2_14;
    uint32_t ICG_ICG2_15;
    uint32_t ICG_ICG2_16;
    uint32_t ICG_ICG2_17;
    uint32_t ICG_ICG2_18;
    uint32_t ICG_ICG2_19;
    uint32_t ICG_ICG2_20;
    uint32_t ICG_ICG2_21;
    uint32_t ICG_ICG2_22;
    uint32_t ICG_ICG2_23;
    uint32_t ICG_ICG2_24;
    uint32_t ICG_ICG2_25;
    uint32_t ICG_ICG2_26;
    uint32_t ICG_ICG2_27;
    uint32_t ICG_ICG2_28;
    uint32_t ICG_ICG2_29;
    uint32_t ICG_ICG2_30;
    uint32_t ICG_ICG2_31;
} stc_icg_icg2_bit_t;

typedef struct
{
    uint32_t ICG_ICG3_0;
    uint32_t ICG_ICG3_1;
    uint32_t ICG_ICG3_2;
    uint32_t ICG_ICG3_3;
    uint32_t ICG_ICG3_4;
    uint32_t ICG_ICG3_5;
    uint32_t ICG_ICG3_6;
    uint32_t ICG_ICG3_7;
    uint32_t ICG_ICG3_8;
    uint32_t ICG_ICG3_9;
    uint32_t ICG_ICG3_10;
    uint32_t ICG_ICG3_11;
    uint32_t ICG_ICG3_12;
    uint32_t ICG_ICG3_13;
    uint32_t ICG_ICG3_14;
    uint32_t ICG_ICG3_15;
    uint32_t ICG_ICG3_16;
    uint32_t ICG_ICG3_17;
    uint32_t ICG_ICG3_18;
    uint32_t ICG_ICG3_19;
    uint32_t ICG_ICG3_20;
    uint32_t ICG_ICG3_21;
    uint32_t ICG_ICG3_22;
    uint32_t ICG_ICG3_23;
    uint32_t ICG_ICG3_24;
    uint32_t ICG_ICG3_25;
    uint32_t ICG_ICG3_26;
    uint32_t ICG_ICG3_27;
    uint32_t ICG_ICG3_28;
    uint32_t ICG_ICG3_29;
    uint32_t ICG_ICG3_30;
    uint32_t ICG_ICG3_31;
} stc_icg_icg3_bit_t;

typedef struct
{
    uint32_t ICG_ICG4_0;
    uint32_t ICG_ICG4_1;
    uint32_t ICG_ICG4_2;
    uint32_t ICG_ICG4_3;
    uint32_t ICG_ICG4_4;
    uint32_t ICG_ICG4_5;
    uint32_t ICG_ICG4_6;
    uint32_t ICG_ICG4_7;
    uint32_t ICG_ICG4_8;
    uint32_t ICG_ICG4_9;
    uint32_t ICG_ICG4_10;
    uint32_t ICG_ICG4_11;
    uint32_t ICG_ICG4_12;
    uint32_t ICG_ICG4_13;
    uint32_t ICG_ICG4_14;
    uint32_t ICG_ICG4_15;
    uint32_t ICG_ICG4_16;
    uint32_t ICG_ICG4_17;
    uint32_t ICG_ICG4_18;
    uint32_t ICG_ICG4_19;
    uint32_t ICG_ICG4_20;
    uint32_t ICG_ICG4_21;
    uint32_t ICG_ICG4_22;
    uint32_t ICG_ICG4_23;
    uint32_t ICG_ICG4_24;
    uint32_t ICG_ICG4_25;
    uint32_t ICG_ICG4_26;
    uint32_t ICG_ICG4_27;
    uint32_t ICG_ICG4_28;
    uint32_t ICG_ICG4_29;
    uint32_t ICG_ICG4_30;
    uint32_t ICG_ICG4_31;
} stc_icg_icg4_bit_t;

typedef struct
{
    uint32_t ICG_ICG5_0;
    uint32_t ICG_ICG5_1;
    uint32_t ICG_ICG5_2;
    uint32_t ICG_ICG5_3;
    uint32_t ICG_ICG5_4;
    uint32_t ICG_ICG5_5;
    uint32_t ICG_ICG5_6;
    uint32_t ICG_ICG5_7;
    uint32_t ICG_ICG5_8;
    uint32_t ICG_ICG5_9;
    uint32_t ICG_ICG5_10;
    uint32_t ICG_ICG5_11;
    uint32_t ICG_ICG5_12;
    uint32_t ICG_ICG5_13;
    uint32_t ICG_ICG5_14;
    uint32_t ICG_ICG5_15;
    uint32_t ICG_ICG5_16;
    uint32_t ICG_ICG5_17;
    uint32_t ICG_ICG5_18;
    uint32_t ICG_ICG5_19;
    uint32_t ICG_ICG5_20;
    uint32_t ICG_ICG5_21;
    uint32_t ICG_ICG5_22;
    uint32_t ICG_ICG5_23;
    uint32_t ICG_ICG5_24;
    uint32_t ICG_ICG5_25;
    uint32_t ICG_ICG5_26;
    uint32_t ICG_ICG5_27;
    uint32_t ICG_ICG5_28;
    uint32_t ICG_ICG5_29;
    uint32_t ICG_ICG5_30;
    uint32_t ICG_ICG5_31;
} stc_icg_icg5_bit_t;

typedef struct
{
    uint32_t ICG_ICG6_0;
    uint32_t ICG_ICG6_1;
    uint32_t ICG_ICG6_2;
    uint32_t ICG_ICG6_3;
    uint32_t ICG_ICG6_4;
    uint32_t ICG_ICG6_5;
    uint32_t ICG_ICG6_6;
    uint32_t ICG_ICG6_7;
    uint32_t ICG_ICG6_8;
    uint32_t ICG_ICG6_9;
    uint32_t ICG_ICG6_10;
    uint32_t ICG_ICG6_11;
    uint32_t ICG_ICG6_12;
    uint32_t ICG_ICG6_13;
    uint32_t ICG_ICG6_14;
    uint32_t ICG_ICG6_15;
    uint32_t ICG_ICG6_16;
    uint32_t ICG_ICG6_17;
    uint32_t ICG_ICG6_18;
    uint32_t ICG_ICG6_19;
    uint32_t ICG_ICG6_20;
    uint32_t ICG_ICG6_21;
    uint32_t ICG_ICG6_22;
    uint32_t ICG_ICG6_23;
    uint32_t ICG_ICG6_24;
    uint32_t ICG_ICG6_25;
    uint32_t ICG_ICG6_26;
    uint32_t ICG_ICG6_27;
    uint32_t ICG_ICG6_28;
    uint32_t ICG_ICG6_29;
    uint32_t ICG_ICG6_30;
    uint32_t ICG_ICG6_31;
} stc_icg_icg6_bit_t;

typedef struct
{
    __IO uint32_t WDTAUTST;
    __IO uint32_t WDTITS;
    __IO uint32_t WDTPERI0;
    __IO uint32_t WDTPERI1;
    __IO uint32_t WDTCKS0;
    __IO uint32_t WDTCKS1;
    __IO uint32_t WDTCKS2;
    __IO uint32_t WDTCKS3;
    __IO uint32_t WDTWDPT0;
    __IO uint32_t WDTWDPT1;
    __IO uint32_t WDTWDPT2;
    __IO uint32_t WDTWDPT3;
    __IO uint32_t WDTSLPOFF;
    uint32_t RESERVED0[19];
} stc_icg_icg7_bit_t;

typedef struct
{
    __IO uint32_t NMITRG;
    uint32_t RESERVED0[3];
    __IO uint32_t NMIFCLK0;
    __IO uint32_t NMIFCLK1;
    uint32_t RESERVED1[1];
    __IO uint32_t NMIFEN;
    uint32_t RESERVED2[4];
    __IO uint32_t NOCSEL0;
    __IO uint32_t NOCSEL1;
    uint32_t RESERVED3[1];
    __IO uint32_t NOCEN;
    uint32_t RESERVED4[16];
} stc_intc_nmicr_bit_t;

typedef struct
{
    __IO uint32_t NMIENR;
    __IO uint32_t SWDTENR;
    __IO uint32_t PVD1ENR;
    __IO uint32_t PVD2ENR;
    uint32_t RESERVED0[1];
    __IO uint32_t XTALSTPENR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPENR;
    uint32_t RESERVED2[2];
    __IO uint32_t WDTENR;
    uint32_t RESERVED3[20];
} stc_intc_nmier_bit_t;

typedef struct
{
    __IO uint32_t NMIFR;
    __IO uint32_t SWDTFR;
    __IO uint32_t PVD1FR;
    __IO uint32_t PVD2FR;
    uint32_t RESERVED0[1];
    __IO uint32_t XTALSTPFR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPFR;
    uint32_t RESERVED2[2];
    __IO uint32_t WDTFR;
    uint32_t RESERVED3[20];
} stc_intc_nmifr_bit_t;

typedef struct
{
    __IO uint32_t NMICFR;
    __IO uint32_t SWDTCFR;
    __IO uint32_t PVD1CFR;
    __IO uint32_t PVD2CFR;
    uint32_t RESERVED0[1];
    __IO uint32_t XTALSTPCFR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPCFR;
    uint32_t RESERVED2[2];
    __IO uint32_t WDTCFR;
    uint32_t RESERVED3[20];
} stc_intc_nmicfr_bit_t;

typedef struct
{
    __IO uint32_t EIRQTRG0;
    __IO uint32_t EIRQTRG1;
    uint32_t RESERVED0[2];
    __IO uint32_t EISMPCLK0;
    __IO uint32_t EISMPCLK1;
    uint32_t RESERVED1[1];
    __IO uint32_t EFEN;
    uint32_t RESERVED2[7];
    __IO uint32_t NOCEN;
    uint32_t RESERVED3[16];
} stc_intc_eirqcr_bit_t;

typedef struct
{
    __IO uint32_t EIRQWUEN0;
    __IO uint32_t EIRQWUEN1;
    __IO uint32_t EIRQWUEN2;
    __IO uint32_t EIRQWUEN3;
    __IO uint32_t EIRQWUEN4;
    __IO uint32_t EIRQWUEN5;
    __IO uint32_t EIRQWUEN6;
    __IO uint32_t EIRQWUEN7;
    uint32_t RESERVED0[8];
    __IO uint32_t SWDTWUEN;
    __IO uint32_t PVD1WUEN;
    __IO uint32_t PVD2WUEN;
    __IO uint32_t CMPI0WUEN;
    uint32_t RESERVED1[3];
    __IO uint32_t TMR0WUEN;
    uint32_t RESERVED2[1];
    __IO uint32_t RXWUEN;
    uint32_t RESERVED3[6];
} stc_intc_wupen_bit_t;

typedef struct
{
    __IO uint32_t EIRQFR0;
    __IO uint32_t EIRQFR1;
    __IO uint32_t EIRQFR2;
    __IO uint32_t EIRQFR3;
    __IO uint32_t EIRQFR4;
    __IO uint32_t EIRQFR5;
    __IO uint32_t EIRQFR6;
    __IO uint32_t EIRQFR7;
    uint32_t RESERVED0[24];
} stc_intc_eirqfr_bit_t;

typedef struct
{
    __IO uint32_t EIRQCFR0;
    __IO uint32_t EIRQCFR1;
    __IO uint32_t EIRQCFR2;
    __IO uint32_t EIRQCFR3;
    __IO uint32_t EIRQCFR4;
    __IO uint32_t EIRQCFR5;
    __IO uint32_t EIRQCFR6;
    __IO uint32_t EIRQCFR7;
    uint32_t RESERVED0[24];
} stc_intc_eirqcfr_bit_t;

typedef struct
{
    __IO uint32_t ISEL0;
    __IO uint32_t ISEL1;
    __IO uint32_t ISEL2;
    __IO uint32_t ISEL3;
    __IO uint32_t ISEL4;
    __IO uint32_t ISEL5;
    __IO uint32_t ISEL6;
    __IO uint32_t ISEL7;
    __IO uint32_t ISEL8;
    uint32_t RESERVED0[23];
} stc_intc_sel_bit_t;

typedef struct
{
    __IO uint32_t SWIE0;
    __IO uint32_t SWIE1;
    __IO uint32_t SWIE2;
    __IO uint32_t SWIE3;
    __IO uint32_t SWIE4;
    __IO uint32_t SWIE5;
    __IO uint32_t SWIE6;
    __IO uint32_t SWIE7;
    __IO uint32_t SWIE8;
    __IO uint32_t SWIE9;
    __IO uint32_t SWIE10;
    __IO uint32_t SWIE11;
    __IO uint32_t SWIE12;
    __IO uint32_t SWIE13;
    __IO uint32_t SWIE14;
    __IO uint32_t SWIE15;
    uint32_t RESERVED0[16];
} stc_intc_swier_bit_t;

typedef struct
{
    __IO uint32_t EVTE0;
    __IO uint32_t EVTE1;
    __IO uint32_t EVTE2;
    __IO uint32_t EVTE3;
    __IO uint32_t EVTE4;
    __IO uint32_t EVTE5;
    __IO uint32_t EVTE6;
    __IO uint32_t EVTE7;
    __IO uint32_t EVTE8;
    __IO uint32_t EVTE9;
    __IO uint32_t EVTE10;
    __IO uint32_t EVTE11;
    __IO uint32_t EVTE12;
    __IO uint32_t EVTE13;
    __IO uint32_t EVTE14;
    __IO uint32_t EVTE15;
    uint32_t RESERVED0[16];
} stc_intc_evter_bit_t;

typedef struct
{
    __IO uint32_t IER0;
    __IO uint32_t IER1;
    __IO uint32_t IER2;
    __IO uint32_t IER3;
    __IO uint32_t IER4;
    __IO uint32_t IER5;
    __IO uint32_t IER6;
    __IO uint32_t IER7;
    __IO uint32_t IER8;
    __IO uint32_t IER9;
    __IO uint32_t IER10;
    __IO uint32_t IER11;
    __IO uint32_t IER12;
    __IO uint32_t IER13;
    __IO uint32_t IER14;
    __IO uint32_t IER15;
    uint32_t RESERVED0[16];
} stc_intc_ier_bit_t;

typedef struct
{
    __IO uint32_t FLNWT;
    __IO uint32_t CKSMRC;
    uint32_t RESERVED0[1];
    __IO uint32_t HAPORDIS;
    uint32_t RESERVED1[2];
    __IO uint32_t STPDAS;
    __IO uint32_t STOP;
} stc_pwc_stpmcr_bit_t;

typedef struct
{
    __IO uint32_t PWDRV0;
    __IO uint32_t PWDRV1;
    __IO uint32_t PWDRV2;
    __IO uint32_t PWDRV3;
    __IO uint32_t PWDRV4;
    __IO uint32_t PWDRV5;
    __IO uint32_t ACTV;
    __IO uint32_t DVS;
    __IO uint32_t VHRCE;
    __IO uint32_t VPLLE;
    __IO uint32_t HCHDTDIS;
    __IO uint32_t PLHDTDIS;
    __IO uint32_t HDTDIS;
    __IO uint32_t HRCPWRDY;
    __IO uint32_t PLLPWRDY;
    uint32_t RESERVED0[1];
} stc_pwc_pwrc_bit_t;

typedef struct
{
    __IO uint32_t PWMONSEL;
    __IO uint32_t PWMONE;
    uint32_t RESERVED0[6];
} stc_pwc_pwrmonr_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t RPERDIS;
    __IO uint32_t SRPEF;
    __IO uint32_t HRPEF;
    __IO uint32_t CRPEF;
} stc_pwc_ramcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[2];
    __IO uint32_t L1IEGS0;
    __IO uint32_t L1IEGS1;
    __IO uint32_t L1LVL0;
    __IO uint32_t L1LVL1;
    __IO uint32_t L1LVL2;
    __IO uint32_t L1LVL3;
    __IO uint32_t L1NFS0;
    __IO uint32_t L1NFS1;
    __IO uint32_t L1NFDIS;
    __IO uint32_t L1NMIS;
    __IO uint32_t L1IRS;
    __IO uint32_t L1IRE;
    __IO uint32_t L1CMPOE;
    __IO uint32_t L1EN;
    __IO uint32_t EXVCCINEN;
    uint32_t RESERVED1[1];
    __IO uint32_t L2IEGS0;
    __IO uint32_t L2IEGS1;
    __IO uint32_t L2LVL0;
    __IO uint32_t L2LVL1;
    __IO uint32_t L2LVL2;
    __IO uint32_t L2LVL3;
    __IO uint32_t L2NFS0;
    __IO uint32_t L2NFS1;
    __IO uint32_t L2NFDIS;
    __IO uint32_t L2NMIS;
    __IO uint32_t L2IRS;
    __IO uint32_t L2IRE;
    __IO uint32_t L2CMPOE;
    __IO uint32_t L2EN;
} stc_pwc_lvdcr0_bit_t;

typedef struct
{
    __IO uint32_t L1MON;
    __IO uint32_t L2MON;
    __IO uint32_t L1DETF;
    __IO uint32_t L2DETF;
    __IO uint32_t L0MON;
    uint32_t RESERVED0[2];
    __IO uint32_t L0CMPOE;
} stc_pwc_lvdcsr1_bit_t;

typedef struct
{
    __IO uint32_t CKRWE;
    __IO uint32_t PWRWE;
    __IO uint32_t FPRCB2;
    __IO uint32_t LVRWE;
    __IO uint32_t FPRCB4;
    __IO uint32_t FPRCB5;
    __IO uint32_t FPRCB6;
    __IO uint32_t FPRCB7;
    __IO uint32_t FPRCWE0;
    __IO uint32_t FPRCWE1;
    __IO uint32_t FPRCWE2;
    __IO uint32_t FPRCWE3;
    __IO uint32_t FPRCWE4;
    __IO uint32_t FPRCWE5;
    __IO uint32_t FPRCWE6;
    __IO uint32_t FPRCWE7;
} stc_pwc_fprc_bit_t;

typedef struct
{
    __IO uint32_t DBGEN;
    uint32_t RESERVED0[14];
    __IO uint32_t TRSTF;
} stc_pwc_dbgc_bit_t;

typedef struct
{
    __IO uint32_t PORF;
    __IO uint32_t PINRF;
    __IO uint32_t LV0RF;
    __IO uint32_t LV1RF;
    __IO uint32_t LV2RF;
    __IO uint32_t SWDRF;
    __IO uint32_t WDRF;
    __IO uint32_t CKFERF;
    __IO uint32_t SWRF;
    uint32_t RESERVED0[1];
    __IO uint32_t RAMPERF;
    uint32_t RESERVED1[1];
    __IO uint32_t CPULKUPRF;
    __IO uint32_t XTALERF;
    __IO uint32_t MULTIRF;
    __IO uint32_t CLRF;
} stc_pwc_rstf0_bit_t;

typedef struct
{
    __IO uint32_t PORF;
    __IO uint32_t PINRF;
    __IO uint32_t LV0RF;
    __IO uint32_t LV1RF;
    __IO uint32_t LV2RF;
    __IO uint32_t SWDRF;
    __IO uint32_t WDRF;
    __IO uint32_t CKFERF;
    __IO uint32_t SWRF;
    uint32_t RESERVED0[1];
    __IO uint32_t RAMPERF;
    uint32_t RESERVED1[1];
    __IO uint32_t CPULKUPRF;
    __IO uint32_t XTALERF;
    __IO uint32_t MULTIRF;
    __IO uint32_t CLRF;
} stc_rmu_rstf0_bit_t;

typedef struct
{
    __IO uint32_t SPD0;
    __IO uint32_t SPD1;
    __IO uint32_t SPD2;
    __IO uint32_t SPD3;
    __IO uint32_t SPD4;
    __IO uint32_t SPD5;
    __IO uint32_t SPD6;
    __IO uint32_t SPD7;
    __IO uint32_t SPD8;
    __IO uint32_t SPD9;
    __IO uint32_t SPD10;
    __IO uint32_t SPD11;
    __IO uint32_t SPD12;
    __IO uint32_t SPD13;
    __IO uint32_t SPD14;
    __IO uint32_t SPD15;
    uint32_t RESERVED0[16];
} stc_spi_dr_bit_t;

typedef struct
{
    __IO uint32_t SPIMDS;
    __IO uint32_t TXMDS;
    uint32_t RESERVED0[1];
    __IO uint32_t MSTR;
    __IO uint32_t SPLPBK;
    __IO uint32_t SPLPBK2;
    __IO uint32_t SPE;
    uint32_t RESERVED1[1];
    __IO uint32_t EIE;
    __IO uint32_t TXIE;
    __IO uint32_t RXIE;
    __IO uint32_t IDIE;
    __IO uint32_t MODFE;
    __IO uint32_t PATE;
    __IO uint32_t PAOE;
    __IO uint32_t PAE;
    uint32_t RESERVED2[16];
} stc_spi_cr1_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t SS0PV;
    uint32_t RESERVED1[23];
} stc_spi_cfg1_bit_t;

typedef struct
{
    __IO uint32_t OVRERF;
    __IO uint32_t IDLNF;
    __IO uint32_t MODFERF;
    __IO uint32_t PERF;
    __IO uint32_t UDRERF;
    __IO uint32_t TDEF;
    uint32_t RESERVED0[1];
    __IO uint32_t RDFF;
    uint32_t RESERVED1[24];
} stc_spi_sr_bit_t;

typedef struct
{
    __IO uint32_t CPHA;
    __IO uint32_t CPOL;
    __IO uint32_t MBR0;
    __IO uint32_t MBR1;
    __IO uint32_t MBR2;
    uint32_t RESERVED0[3];
    __IO uint32_t DSIZE;
    uint32_t RESERVED1[3];
    __IO uint32_t LSBF;
    uint32_t RESERVED2[19];
} stc_spi_cfg2_bit_t;

typedef struct
{
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t CNT10;
    __IO uint32_t CNT11;
    __IO uint32_t CNT12;
    __IO uint32_t CNT13;
    __IO uint32_t CNT14;
    __IO uint32_t CNT15;
    __IO uint32_t UDF;
    __IO uint32_t REF;
    uint32_t RESERVED0[14];
} stc_swdt_sr_bit_t;

