levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
typedef struct
{
    __IO uint32_t RF0;
    __IO uint32_t RF1;
    __IO uint32_t RF2;
    __IO uint32_t RF3;
    __IO uint32_t RF4;
    __IO uint32_t RF5;
    __IO uint32_t RF6;
    __IO uint32_t RF7;
    __IO uint32_t RF8;
    __IO uint32_t RF9;
    __IO uint32_t RF10;
    __IO uint32_t RF11;
    __IO uint32_t RF12;
    __IO uint32_t RF13;
    __IO uint32_t RF14;
    __IO uint32_t RF15;
    uint32_t RESERVED0[16];
} stc_swdt_rr_bit_t;

typedef struct
{
    __IO uint32_t CNTA0;
    __IO uint32_t CNTA1;
    __IO uint32_t CNTA2;
    __IO uint32_t CNTA3;
    __IO uint32_t CNTA4;
    __IO uint32_t CNTA5;
    __IO uint32_t CNTA6;
    __IO uint32_t CNTA7;
    __IO uint32_t CNTA8;
    __IO uint32_t CNTA9;
    __IO uint32_t CNTA10;
    __IO uint32_t CNTA11;
    __IO uint32_t CNTA12;
    __IO uint32_t CNTA13;
    __IO uint32_t CNTA14;
    __IO uint32_t CNTA15;
    uint32_t RESERVED0[16];
} stc_tmr0_cntar_bit_t;

typedef struct
{
    __IO uint32_t CNTB0;
    __IO uint32_t CNTB1;
    __IO uint32_t CNTB2;
    __IO uint32_t CNTB3;
    __IO uint32_t CNTB4;
    __IO uint32_t CNTB5;
    __IO uint32_t CNTB6;
    __IO uint32_t CNTB7;
    __IO uint32_t CNTB8;
    __IO uint32_t CNTB9;
    __IO uint32_t CNTB10;
    __IO uint32_t CNTB11;
    __IO uint32_t CNTB12;
    __IO uint32_t CNTB13;
    __IO uint32_t CNTB14;
    __IO uint32_t CNTB15;
    uint32_t RESERVED0[16];
} stc_tmr0_cntbr_bit_t;

typedef struct
{
    __IO uint32_t CMPA0;
    __IO uint32_t CMPA1;
    __IO uint32_t CMPA2;
    __IO uint32_t CMPA3;
    __IO uint32_t CMPA4;
    __IO uint32_t CMPA5;
    __IO uint32_t CMPA6;
    __IO uint32_t CMPA7;
    __IO uint32_t CMPA8;
    __IO uint32_t CMPA9;
    __IO uint32_t CMPA10;
    __IO uint32_t CMPA11;
    __IO uint32_t CMPA12;
    __IO uint32_t CMPA13;
    __IO uint32_t CMPA14;
    __IO uint32_t CMPA15;
    uint32_t RESERVED0[16];
} stc_tmr0_cmpar_bit_t;

typedef struct
{
    __IO uint32_t CMPB0;
    __IO uint32_t CMPB1;
    __IO uint32_t CMPB2;
    __IO uint32_t CMPB3;
    __IO uint32_t CMPB4;
    __IO uint32_t CMPB5;
    __IO uint32_t CMPB6;
    __IO uint32_t CMPB7;
    __IO uint32_t CMPB8;
    __IO uint32_t CMPB9;
    __IO uint32_t CMPB10;
    __IO uint32_t CMPB11;
    __IO uint32_t CMPB12;
    __IO uint32_t CMPB13;
    __IO uint32_t CMPB14;
    __IO uint32_t CMPB15;
    uint32_t RESERVED0[16];
} stc_tmr0_cmpbr_bit_t;

typedef struct
{
    __IO uint32_t CSTA;
    __IO uint32_t CAPMDA;
    __IO uint32_t INTENA;
    uint32_t RESERVED0[1];
    __IO uint32_t CKDIVA0;
    __IO uint32_t CKDIVA1;
    __IO uint32_t CKDIVA2;
    __IO uint32_t CKDIVA3;
    __IO uint32_t SYNSA;
    __IO uint32_t SYNCLKA;
    __IO uint32_t ASYNCLKA;
    uint32_t RESERVED1[1];
    __IO uint32_t HSTAA;
    __IO uint32_t HSTPA;
    __IO uint32_t HCLEA;
    __IO uint32_t HICPA;
    __IO uint32_t CSTB;
    __IO uint32_t CAPMDB;
    __IO uint32_t INTENB;
    uint32_t RESERVED2[1];
    __IO uint32_t CKDIVB0;
    __IO uint32_t CKDIVB1;
    __IO uint32_t CKDIVB2;
    __IO uint32_t CKDIVB3;
    __IO uint32_t SYNSB;
    __IO uint32_t SYNCLKB;
    __IO uint32_t ASYNCLKB;
    uint32_t RESERVED3[1];
    __IO uint32_t HSTAB;
    __IO uint32_t HSTPB;
    __IO uint32_t HCLEB;
    __IO uint32_t HICPB;
} stc_tmr0_bconr_bit_t;

typedef struct
{
    __IO uint32_t CMFA;
    uint32_t RESERVED0[15];
    __IO uint32_t CMFB;
    uint32_t RESERVED1[15];
} stc_tmr0_stflr_bit_t;

typedef struct
{
    uint32_t TMR4_OCCRUH_0;
    uint32_t TMR4_OCCRUH_1;
    uint32_t TMR4_OCCRUH_2;
    uint32_t TMR4_OCCRUH_3;
    uint32_t TMR4_OCCRUH_4;
    uint32_t TMR4_OCCRUH_5;
    uint32_t TMR4_OCCRUH_6;
    uint32_t TMR4_OCCRUH_7;
    uint32_t TMR4_OCCRUH_8;
    uint32_t TMR4_OCCRUH_9;
    uint32_t TMR4_OCCRUH_10;
    uint32_t TMR4_OCCRUH_11;
    uint32_t TMR4_OCCRUH_12;
    uint32_t TMR4_OCCRUH_13;
    uint32_t TMR4_OCCRUH_14;
    uint32_t TMR4_OCCRUH_15;
} stc_tmr4_occruh_bit_t;

typedef struct
{
    uint32_t TMR4_OCCRUL_0;
    uint32_t TMR4_OCCRUL_1;
    uint32_t TMR4_OCCRUL_2;
    uint32_t TMR4_OCCRUL_3;
    uint32_t TMR4_OCCRUL_4;
    uint32_t TMR4_OCCRUL_5;
    uint32_t TMR4_OCCRUL_6;
    uint32_t TMR4_OCCRUL_7;
    uint32_t TMR4_OCCRUL_8;
    uint32_t TMR4_OCCRUL_9;
    uint32_t TMR4_OCCRUL_10;
    uint32_t TMR4_OCCRUL_11;
    uint32_t TMR4_OCCRUL_12;
    uint32_t TMR4_OCCRUL_13;
    uint32_t TMR4_OCCRUL_14;
    uint32_t TMR4_OCCRUL_15;
} stc_tmr4_occrul_bit_t;

typedef struct
{
    uint32_t TMR4_OCCRVH_0;
    uint32_t TMR4_OCCRVH_1;
    uint32_t TMR4_OCCRVH_2;
    uint32_t TMR4_OCCRVH_3;
    uint32_t TMR4_OCCRVH_4;
    uint32_t TMR4_OCCRVH_5;
    uint32_t TMR4_OCCRVH_6;
    uint32_t TMR4_OCCRVH_7;
    uint32_t TMR4_OCCRVH_8;
    uint32_t TMR4_OCCRVH_9;
    uint32_t TMR4_OCCRVH_10;
    uint32_t TMR4_OCCRVH_11;
    uint32_t TMR4_OCCRVH_12;
    uint32_t TMR4_OCCRVH_13;
    uint32_t TMR4_OCCRVH_14;
    uint32_t TMR4_OCCRVH_15;
} stc_tmr4_occrvh_bit_t;

typedef struct
{
    uint32_t TMR4_OCCRVL_0;
    uint32_t TMR4_OCCRVL_1;
    uint32_t TMR4_OCCRVL_2;
    uint32_t TMR4_OCCRVL_3;
    uint32_t TMR4_OCCRVL_4;
    uint32_t TMR4_OCCRVL_5;
    uint32_t TMR4_OCCRVL_6;
    uint32_t TMR4_OCCRVL_7;
    uint32_t TMR4_OCCRVL_8;
    uint32_t TMR4_OCCRVL_9;
    uint32_t TMR4_OCCRVL_10;
    uint32_t TMR4_OCCRVL_11;
    uint32_t TMR4_OCCRVL_12;
    uint32_t TMR4_OCCRVL_13;
    uint32_t TMR4_OCCRVL_14;
    uint32_t TMR4_OCCRVL_15;
} stc_tmr4_occrvl_bit_t;

typedef struct
{
    uint32_t TMR4_OCCRWH_0;
    uint32_t TMR4_OCCRWH_1;
    uint32_t TMR4_OCCRWH_2;
    uint32_t TMR4_OCCRWH_3;
    uint32_t TMR4_OCCRWH_4;
    uint32_t TMR4_OCCRWH_5;
    uint32_t TMR4_OCCRWH_6;
    uint32_t TMR4_OCCRWH_7;
    uint32_t TMR4_OCCRWH_8;
    uint32_t TMR4_OCCRWH_9;
    uint32_t TMR4_OCCRWH_10;
    uint32_t TMR4_OCCRWH_11;
    uint32_t TMR4_OCCRWH_12;
    uint32_t TMR4_OCCRWH_13;
    uint32_t TMR4_OCCRWH_14;
    uint32_t TMR4_OCCRWH_15;
} stc_tmr4_occrwh_bit_t;

typedef struct
{
    uint32_t TMR4_OCCRWL_0;
    uint32_t TMR4_OCCRWL_1;
    uint32_t TMR4_OCCRWL_2;
    uint32_t TMR4_OCCRWL_3;
    uint32_t TMR4_OCCRWL_4;
    uint32_t TMR4_OCCRWL_5;
    uint32_t TMR4_OCCRWL_6;
    uint32_t TMR4_OCCRWL_7;
    uint32_t TMR4_OCCRWL_8;
    uint32_t TMR4_OCCRWL_9;
    uint32_t TMR4_OCCRWL_10;
    uint32_t TMR4_OCCRWL_11;
    uint32_t TMR4_OCCRWL_12;
    uint32_t TMR4_OCCRWL_13;
    uint32_t TMR4_OCCRWL_14;
    uint32_t TMR4_OCCRWL_15;
} stc_tmr4_occrwl_bit_t;

typedef struct
{
    __IO uint32_t OCEH;
    __IO uint32_t OCEL;
    __IO uint32_t OCPH;
    __IO uint32_t OCPL;
    __IO uint32_t OCIEH;
    __IO uint32_t OCIEL;
    __IO uint32_t OCFH;
    __IO uint32_t OCFL;
    uint32_t RESERVED0[8];
} stc_tmr4_ocsr_bit_t;

typedef struct
{
    __IO uint32_t CHBUFEN0;
    __IO uint32_t CHBUFEN1;
    __IO uint32_t CLBUFEN0;
    __IO uint32_t CLBUFEN1;
    __IO uint32_t MHBUFEN0;
    __IO uint32_t MHBUFEN1;
    __IO uint32_t MLBUFEN0;
    __IO uint32_t MLBUFEN1;
    __IO uint32_t LMCH;
    __IO uint32_t LMCL;
    __IO uint32_t LMMH;
    __IO uint32_t LMML;
    __IO uint32_t MCECH;
    __IO uint32_t MCECL;
    uint32_t RESERVED0[2];
} stc_tmr4_ocer_bit_t;

typedef struct
{
    __IO uint32_t OCFDCH;
    __IO uint32_t OCFPKH;
    __IO uint32_t OCFUCH;
    __IO uint32_t OCFZRH;
    __IO uint32_t OPDCH0;
    __IO uint32_t OPDCH1;
    __IO uint32_t OPPKH0;
    __IO uint32_t OPPKH1;
    __IO uint32_t OPUCH0;
    __IO uint32_t OPUCH1;
    __IO uint32_t OPZRH0;
    __IO uint32_t OPZRH1;
    __IO uint32_t OPNPKH0;
    __IO uint32_t OPNPKH1;
    __IO uint32_t OPNZRH0;
    __IO uint32_t OPNZRH1;
} stc_tmr4_ocmrh_bit_t;

typedef struct
{
    __IO uint32_t OCFDCL;
    __IO uint32_t OCFPKL;
    __IO uint32_t OCFUCL;
    __IO uint32_t OCFZRL;
    __IO uint32_t OPDCL0;
    __IO uint32_t OPDCL1;
    __IO uint32_t OPPKL0;
    __IO uint32_t OPPKL1;
    __IO uint32_t OPUCL0;
    __IO uint32_t OPUCL1;
    __IO uint32_t OPZRL0;
    __IO uint32_t OPZRL1;
    __IO uint32_t OPNPKL0;
    __IO uint32_t OPNPKL1;
    __IO uint32_t OPNZRL0;
    __IO uint32_t OPNZRL1;
    __IO uint32_t EOPNDCL0;
    __IO uint32_t EOPNDCL1;
    __IO uint32_t EOPNUCL0;
    __IO uint32_t EOPNUCL1;
    __IO uint32_t EOPDCL0;
    __IO uint32_t EOPDCL1;
    __IO uint32_t EOPPKL0;
    __IO uint32_t EOPPKL1;
    __IO uint32_t EOPUCL0;
    __IO uint32_t EOPUCL1;
    __IO uint32_t EOPZRL0;
    __IO uint32_t EOPZRL1;
    __IO uint32_t EOPNPKL0;
    __IO uint32_t EOPNPKL1;
    __IO uint32_t EOPNZRL0;
    __IO uint32_t EOPNZRL1;
} stc_tmr4_ocmrl_bit_t;

typedef struct
{
    uint32_t TMR4_CPSR_0;
    uint32_t TMR4_CPSR_1;
    uint32_t TMR4_CPSR_2;
    uint32_t TMR4_CPSR_3;
    uint32_t TMR4_CPSR_4;
    uint32_t TMR4_CPSR_5;
    uint32_t TMR4_CPSR_6;
    uint32_t TMR4_CPSR_7;
    uint32_t TMR4_CPSR_8;
    uint32_t TMR4_CPSR_9;
    uint32_t TMR4_CPSR_10;
    uint32_t TMR4_CPSR_11;
    uint32_t TMR4_CPSR_12;
    uint32_t TMR4_CPSR_13;
    uint32_t TMR4_CPSR_14;
    uint32_t TMR4_CPSR_15;
} stc_tmr4_cpsr_bit_t;

typedef struct
{
    uint32_t TMR4_CNTR_0;
    uint32_t TMR4_CNTR_1;
    uint32_t TMR4_CNTR_2;
    uint32_t TMR4_CNTR_3;
    uint32_t TMR4_CNTR_4;
    uint32_t TMR4_CNTR_5;
    uint32_t TMR4_CNTR_6;
    uint32_t TMR4_CNTR_7;
    uint32_t TMR4_CNTR_8;
    uint32_t TMR4_CNTR_9;
    uint32_t TMR4_CNTR_10;
    uint32_t TMR4_CNTR_11;
    uint32_t TMR4_CNTR_12;
    uint32_t TMR4_CNTR_13;
    uint32_t TMR4_CNTR_14;
    uint32_t TMR4_CNTR_15;
} stc_tmr4_cntr_bit_t;

typedef struct
{
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t CLEAR;
    __IO uint32_t MODE;
    __IO uint32_t STOP;
    __IO uint32_t BUFEN;
    __IO uint32_t IRQPEN;
    __IO uint32_t IRQPF;
    uint32_t RESERVED0[3];
    __IO uint32_t IRQZEN;
    __IO uint32_t IRQZF;
    __IO uint32_t ECKEN;
} stc_tmr4_ccsr_bit_t;

typedef struct
{
    __IO uint32_t ZIM0;
    __IO uint32_t ZIM1;
    __IO uint32_t ZIM2;
    __IO uint32_t ZIM3;
    __IO uint32_t PIM0;
    __IO uint32_t PIM1;
    __IO uint32_t PIM2;
    __IO uint32_t PIM3;
    __IO uint32_t ZIC0;
    __IO uint32_t ZIC1;
    __IO uint32_t ZIC2;
    __IO uint32_t ZIC3;
    __IO uint32_t PIC0;
    __IO uint32_t PIC1;
    __IO uint32_t PIC2;
    __IO uint32_t PIC3;
} stc_tmr4_cvpr_bit_t;

typedef struct
{
    uint32_t TMR4_PFSRU_0;
    uint32_t TMR4_PFSRU_1;
    uint32_t TMR4_PFSRU_2;
    uint32_t TMR4_PFSRU_3;
    uint32_t TMR4_PFSRU_4;
    uint32_t TMR4_PFSRU_5;
    uint32_t TMR4_PFSRU_6;
    uint32_t TMR4_PFSRU_7;
    uint32_t TMR4_PFSRU_8;
    uint32_t TMR4_PFSRU_9;
    uint32_t TMR4_PFSRU_10;
    uint32_t TMR4_PFSRU_11;
    uint32_t TMR4_PFSRU_12;
    uint32_t TMR4_PFSRU_13;
    uint32_t TMR4_PFSRU_14;
    uint32_t TMR4_PFSRU_15;
} stc_tmr4_pfsru_bit_t;

typedef struct
{
    uint32_t TMR4_PDARU_0;
    uint32_t TMR4_PDARU_1;
    uint32_t TMR4_PDARU_2;
    uint32_t TMR4_PDARU_3;
    uint32_t TMR4_PDARU_4;
    uint32_t TMR4_PDARU_5;
    uint32_t TMR4_PDARU_6;
    uint32_t TMR4_PDARU_7;
    uint32_t TMR4_PDARU_8;
    uint32_t TMR4_PDARU_9;
    uint32_t TMR4_PDARU_10;
    uint32_t TMR4_PDARU_11;
    uint32_t TMR4_PDARU_12;
    uint32_t TMR4_PDARU_13;
    uint32_t TMR4_PDARU_14;
    uint32_t TMR4_PDARU_15;
} stc_tmr4_pdaru_bit_t;

typedef struct
{
    uint32_t TMR4_PDBRU_0;
    uint32_t TMR4_PDBRU_1;
    uint32_t TMR4_PDBRU_2;
    uint32_t TMR4_PDBRU_3;
    uint32_t TMR4_PDBRU_4;
    uint32_t TMR4_PDBRU_5;
    uint32_t TMR4_PDBRU_6;
    uint32_t TMR4_PDBRU_7;
    uint32_t TMR4_PDBRU_8;
    uint32_t TMR4_PDBRU_9;
    uint32_t TMR4_PDBRU_10;
    uint32_t TMR4_PDBRU_11;
    uint32_t TMR4_PDBRU_12;
    uint32_t TMR4_PDBRU_13;
    uint32_t TMR4_PDBRU_14;
    uint32_t TMR4_PDBRU_15;
} stc_tmr4_pdbru_bit_t;

typedef struct
{
    uint32_t TMR4_PFSRV_0;
    uint32_t TMR4_PFSRV_1;
    uint32_t TMR4_PFSRV_2;
    uint32_t TMR4_PFSRV_3;
    uint32_t TMR4_PFSRV_4;
    uint32_t TMR4_PFSRV_5;
    uint32_t TMR4_PFSRV_6;
    uint32_t TMR4_PFSRV_7;
    uint32_t TMR4_PFSRV_8;
    uint32_t TMR4_PFSRV_9;
    uint32_t TMR4_PFSRV_10;
    uint32_t TMR4_PFSRV_11;
    uint32_t TMR4_PFSRV_12;
    uint32_t TMR4_PFSRV_13;
    uint32_t TMR4_PFSRV_14;
    uint32_t TMR4_PFSRV_15;
} stc_tmr4_pfsrv_bit_t;

typedef struct
{
    uint32_t TMR4_PDARV_0;
    uint32_t TMR4_PDARV_1;
    uint32_t TMR4_PDARV_2;
    uint32_t TMR4_PDARV_3;
    uint32_t TMR4_PDARV_4;
    uint32_t TMR4_PDARV_5;
    uint32_t TMR4_PDARV_6;
    uint32_t TMR4_PDARV_7;
    uint32_t TMR4_PDARV_8;
    uint32_t TMR4_PDARV_9;
    uint32_t TMR4_PDARV_10;
    uint32_t TMR4_PDARV_11;
    uint32_t TMR4_PDARV_12;
    uint32_t TMR4_PDARV_13;
    uint32_t TMR4_PDARV_14;
    uint32_t TMR4_PDARV_15;
} stc_tmr4_pdarv_bit_t;

typedef struct
{
    uint32_t TMR4_PDBRV_0;
    uint32_t TMR4_PDBRV_1;
    uint32_t TMR4_PDBRV_2;
    uint32_t TMR4_PDBRV_3;
    uint32_t TMR4_PDBRV_4;
    uint32_t TMR4_PDBRV_5;
    uint32_t TMR4_PDBRV_6;
    uint32_t TMR4_PDBRV_7;
    uint32_t TMR4_PDBRV_8;
    uint32_t TMR4_PDBRV_9;
    uint32_t TMR4_PDBRV_10;
    uint32_t TMR4_PDBRV_11;
    uint32_t TMR4_PDBRV_12;
    uint32_t TMR4_PDBRV_13;
    uint32_t TMR4_PDBRV_14;
    uint32_t TMR4_PDBRV_15;
} stc_tmr4_pdbrv_bit_t;

typedef struct
{
    uint32_t TMR4_PFSRW_0;
    uint32_t TMR4_PFSRW_1;
    uint32_t TMR4_PFSRW_2;
    uint32_t TMR4_PFSRW_3;
    uint32_t TMR4_PFSRW_4;
    uint32_t TMR4_PFSRW_5;
    uint32_t TMR4_PFSRW_6;
    uint32_t TMR4_PFSRW_7;
    uint32_t TMR4_PFSRW_8;
    uint32_t TMR4_PFSRW_9;
    uint32_t TMR4_PFSRW_10;
    uint32_t TMR4_PFSRW_11;
    uint32_t TMR4_PFSRW_12;
    uint32_t TMR4_PFSRW_13;
    uint32_t TMR4_PFSRW_14;
    uint32_t TMR4_PFSRW_15;
} stc_tmr4_pfsrw_bit_t;

typedef struct
{
    uint32_t TMR4_PDARW_0;
    uint32_t TMR4_PDARW_1;
    uint32_t TMR4_PDARW_2;
    uint32_t TMR4_PDARW_3;
    uint32_t TMR4_PDARW_4;
    uint32_t TMR4_PDARW_5;
    uint32_t TMR4_PDARW_6;
    uint32_t TMR4_PDARW_7;
    uint32_t TMR4_PDARW_8;
    uint32_t TMR4_PDARW_9;
    uint32_t TMR4_PDARW_10;
    uint32_t TMR4_PDARW_11;
    uint32_t TMR4_PDARW_12;
    uint32_t TMR4_PDARW_13;
    uint32_t TMR4_PDARW_14;
    uint32_t TMR4_PDARW_15;
} stc_tmr4_pdarw_bit_t;

typedef struct
{
    uint32_t TMR4_PDBRW_0;
    uint32_t TMR4_PDBRW_1;
    uint32_t TMR4_PDBRW_2;
    uint32_t TMR4_PDBRW_3;
    uint32_t TMR4_PDBRW_4;
    uint32_t TMR4_PDBRW_5;
    uint32_t TMR4_PDBRW_6;
    uint32_t TMR4_PDBRW_7;
    uint32_t TMR4_PDBRW_8;
    uint32_t TMR4_PDBRW_9;
    uint32_t TMR4_PDBRW_10;
    uint32_t TMR4_PDBRW_11;
    uint32_t TMR4_PDBRW_12;
    uint32_t TMR4_PDBRW_13;
    uint32_t TMR4_PDBRW_14;
    uint32_t TMR4_PDBRW_15;
} stc_tmr4_pdbrw_bit_t;

typedef struct
{
    __IO uint32_t DIVCK0;
    __IO uint32_t DIVCK1;
    __IO uint32_t DIVCK2;
    uint32_t RESERVED0[1];
    __IO uint32_t PWMMD0;
    __IO uint32_t PWMMD1;
    __IO uint32_t LVLS0;
    __IO uint32_t LVLS1;
    uint32_t RESERVED1[8];
} stc_tmr4_pocr_bit_t;

typedef struct
{
    __IO uint32_t RTIDU;
    __IO uint32_t RTIDV;
    __IO uint32_t RTIDW;
    uint32_t RESERVED0[1];
    __IO uint32_t RTIFU;
    __IO uint32_t RTICU;
    __IO uint32_t RTEU;
    __IO uint32_t RTSU;
    __IO uint32_t RTIFV;
    __IO uint32_t RTICV;
    __IO uint32_t RTEV;
    __IO uint32_t RTSV;
    __IO uint32_t RTIFW;
    __IO uint32_t RTICW;
    __IO uint32_t RTEW;
    __IO uint32_t RTSW;
} stc_tmr4_rcsr_bit_t;

typedef struct
{
    uint32_t TMR4_SCCRUH_0;
    uint32_t TMR4_SCCRUH_1;
    uint32_t TMR4_SCCRUH_2;
    uint32_t TMR4_SCCRUH_3;
    uint32_t TMR4_SCCRUH_4;
    uint32_t TMR4_SCCRUH_5;
    uint32_t TMR4_SCCRUH_6;
    uint32_t TMR4_SCCRUH_7;
    uint32_t TMR4_SCCRUH_8;
    uint32_t TMR4_SCCRUH_9;
    uint32_t TMR4_SCCRUH_10;
    uint32_t TMR4_SCCRUH_11;
    uint32_t TMR4_SCCRUH_12;
    uint32_t TMR4_SCCRUH_13;
    uint32_t TMR4_SCCRUH_14;
    uint32_t TMR4_SCCRUH_15;
} stc_tmr4_sccruh_bit_t;

typedef struct
{
    uint32_t TMR4_SCCRUL_0;
    uint32_t TMR4_SCCRUL_1;
    uint32_t TMR4_SCCRUL_2;
    uint32_t TMR4_SCCRUL_3;
    uint32_t TMR4_SCCRUL_4;
    uint32_t TMR4_SCCRUL_5;
    uint32_t TMR4_SCCRUL_6;
    uint32_t TMR4_SCCRUL_7;
    uint32_t TMR4_SCCRUL_8;
    uint32_t TMR4_SCCRUL_9;
    uint32_t TMR4_SCCRUL_10;
    uint32_t TMR4_SCCRUL_11;
    uint32_t TMR4_SCCRUL_12;
    uint32_t TMR4_SCCRUL_13;
    uint32_t TMR4_SCCRUL_14;
    uint32_t TMR4_SCCRUL_15;
} stc_tmr4_sccrul_bit_t;

typedef struct
{
    uint32_t TMR4_SCCRVH_0;
    uint32_t TMR4_SCCRVH_1;
    uint32_t TMR4_SCCRVH_2;
    uint32_t TMR4_SCCRVH_3;
    uint32_t TMR4_SCCRVH_4;
    uint32_t TMR4_SCCRVH_5;
    uint32_t TMR4_SCCRVH_6;
    uint32_t TMR4_SCCRVH_7;
    uint32_t TMR4_SCCRVH_8;
    uint32_t TMR4_SCCRVH_9;
    uint32_t TMR4_SCCRVH_10;
    uint32_t TMR4_SCCRVH_11;
    uint32_t TMR4_SCCRVH_12;
    uint32_t TMR4_SCCRVH_13;
    uint32_t TMR4_SCCRVH_14;
    uint32_t TMR4_SCCRVH_15;
} stc_tmr4_sccrvh_bit_t;

typedef struct
{
    uint32_t TMR4_SCCRVL_0;
    uint32_t TMR4_SCCRVL_1;
    uint32_t TMR4_SCCRVL_2;
    uint32_t TMR4_SCCRVL_3;
    uint32_t TMR4_SCCRVL_4;
    uint32_t TMR4_SCCRVL_5;
    uint32_t TMR4_SCCRVL_6;
    uint32_t TMR4_SCCRVL_7;
    uint32_t TMR4_SCCRVL_8;
    uint32_t TMR4_SCCRVL_9;
    uint32_t TMR4_SCCRVL_10;
    uint32_t TMR4_SCCRVL_11;
    uint32_t TMR4_SCCRVL_12;
    uint32_t TMR4_SCCRVL_13;
    uint32_t TMR4_SCCRVL_14;
    uint32_t TMR4_SCCRVL_15;
} stc_tmr4_sccrvl_bit_t;

typedef struct
{
    uint32_t TMR4_SCCRWH_0;
    uint32_t TMR4_SCCRWH_1;
    uint32_t TMR4_SCCRWH_2;
    uint32_t TMR4_SCCRWH_3;
    uint32_t TMR4_SCCRWH_4;
    uint32_t TMR4_SCCRWH_5;
    uint32_t TMR4_SCCRWH_6;
    uint32_t TMR4_SCCRWH_7;
    uint32_t TMR4_SCCRWH_8;
    uint32_t TMR4_SCCRWH_9;
    uint32_t TMR4_SCCRWH_10;
    uint32_t TMR4_SCCRWH_11;
    uint32_t TMR4_SCCRWH_12;
    uint32_t TMR4_SCCRWH_13;
    uint32_t TMR4_SCCRWH_14;
    uint32_t TMR4_SCCRWH_15;
} stc_tmr4_sccrwh_bit_t;

typedef struct
{
    uint32_t TMR4_SCCRWL_0;
    uint32_t TMR4_SCCRWL_1;
    uint32_t TMR4_SCCRWL_2;
    uint32_t TMR4_SCCRWL_3;
    uint32_t TMR4_SCCRWL_4;
    uint32_t TMR4_SCCRWL_5;
    uint32_t TMR4_SCCRWL_6;
    uint32_t TMR4_SCCRWL_7;
    uint32_t TMR4_SCCRWL_8;
    uint32_t TMR4_SCCRWL_9;
    uint32_t TMR4_SCCRWL_10;
    uint32_t TMR4_SCCRWL_11;
    uint32_t TMR4_SCCRWL_12;
    uint32_t TMR4_SCCRWL_13;
    uint32_t TMR4_SCCRWL_14;
    uint32_t TMR4_SCCRWL_15;
} stc_tmr4_sccrwl_bit_t;

typedef struct
{
    __IO uint32_t BUFEN0;
    __IO uint32_t BUFEN1;
    __IO uint32_t EVTOS0;
    __IO uint32_t EVTOS1;
    __IO uint32_t EVTOS2;
    __IO uint32_t LMC;
    uint32_t RESERVED0[2];
    __IO uint32_t EVTMS;
    __IO uint32_t EVTDS;
    uint32_t RESERVED1[2];
    __IO uint32_t DEN;
    __IO uint32_t PEN;
    __IO uint32_t UEN;
    __IO uint32_t ZEN;
} stc_tmr4_scsr_bit_t;

typedef struct
{
    __IO uint32_t AMC0;
    __IO uint32_t AMC1;
    __IO uint32_t AMC2;
    __IO uint32_t AMC3;
    uint32_t RESERVED0[2];
    __IO uint32_t MZCE;
    __IO uint32_t MPCE;
    uint32_t RESERVED1[8];
} stc_tmr4_scmr_bit_t;

typedef struct
{
    __IO uint32_t OEUH;
    __IO uint32_t OEUL;
    __IO uint32_t OEVH;
    __IO uint32_t OEVL;
    __IO uint32_t OEWH;
    __IO uint32_t OEWL;
    __IO uint32_t ODT0;
    __IO uint32_t ODT1;
    __IO uint32_t MOE;
    __IO uint32_t AOE;
    uint32_t RESERVED0[6];
    __IO uint32_t OSUH0;
    __IO uint32_t OSUH1;
    __IO uint32_t OSUL0;
    __IO uint32_t OSUL1;
    __IO uint32_t OSVH0;
    __IO uint32_t OSVH1;
    __IO uint32_t OSVL0;
    __IO uint32_t OSVL1;
    __IO uint32_t OSWH0;
    __IO uint32_t OSWH1;
    __IO uint32_t OSWL0;
    __IO uint32_t OSWL1;
    uint32_t RESERVED1[4];
} stc_tmr4_pscr_bit_t;

typedef struct
{
    __IO uint32_t EVTRS0;
    __IO uint32_t EVTRS1;
    __IO uint32_t EVTRS2;
    __IO uint32_t PCTS;
    uint32_t RESERVED0[12];
} stc_tmr4_scer_bit_t;

typedef struct
{
    __IO uint32_t CNT0;
    __IO uint32_t CNT1;
    __IO uint32_t CNT2;
    __IO uint32_t CNT3;
    __IO uint32_t CNT4;
    __IO uint32_t CNT5;
    __IO uint32_t CNT6;
    __IO uint32_t CNT7;
    __IO uint32_t CNT8;
    __IO uint32_t CNT9;
    __IO uint32_t CNT10;
    __IO uint32_t CNT11;
    __IO uint32_t CNT12;
    __IO uint32_t CNT13;
    __IO uint32_t CNT14;
    __IO uint32_t CNT15;
} stc_tmra_cnter_bit_t;

typedef struct
{
    __IO uint32_t PER0;
    __IO uint32_t PER1;
    __IO uint32_t PER2;
    __IO uint32_t PER3;
    __IO uint32_t PER4;
    __IO uint32_t PER5;
    __IO uint32_t PER6;
    __IO uint32_t PER7;
    __IO uint32_t PER8;
    __IO uint32_t PER9;
    __IO uint32_t PER10;
    __IO uint32_t PER11;
    __IO uint32_t PER12;
    __IO uint32_t PER13;
    __IO uint32_t PER14;
    __IO uint32_t PER15;
} stc_tmra_perar_bit_t;

typedef struct
{
    __IO uint32_t CMP0;
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    __IO uint32_t CMP3;
    __IO uint32_t CMP4;
    __IO uint32_t CMP5;
    __IO uint32_t CMP6;
    __IO uint32_t CMP7;
    __IO uint32_t CMP8;
    __IO uint32_t CMP9;
    __IO uint32_t CMP10;
    __IO uint32_t CMP11;
    __IO uint32_t CMP12;
    __IO uint32_t CMP13;
    __IO uint32_t CMP14;
    __IO uint32_t CMP15;
} stc_tmra_cmpar_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t DIR;
    __IO uint32_t MODE;
    __IO uint32_t SYNST;
    __IO uint32_t CKDIV0;
    __IO uint32_t CKDIV1;
    __IO uint32_t CKDIV2;
    __IO uint32_t CKDIV3;
    __IO uint32_t OVSTP;
    uint32_t RESERVED0[3];
    __IO uint32_t INENOVF;
    __IO uint32_t INENUDF;
    __IO uint32_t OVFF;
    __IO uint32_t UDFF;
} stc_tmra_bcstr_bit_t;

typedef struct
{
    __IO uint32_t HSTA0;
    __IO uint32_t HSTA1;
    __IO uint32_t HSTA2;
    uint32_t RESERVED0[1];
    __IO uint32_t HSTP0;
    __IO uint32_t HSTP1;
    __IO uint32_t HSTP2;
    uint32_t RESERVED1[1];
    __IO uint32_t HCLE0;
    __IO uint32_t HCLE1;
    __IO uint32_t HCLE2;
    uint32_t RESERVED2[1];
    __IO uint32_t HCLE3;
    __IO uint32_t HCLE4;
    uint32_t RESERVED3[2];
} stc_tmra_hconr_bit_t;

typedef struct
{
    __IO uint32_t HCUP0;
    __IO uint32_t HCUP1;
    __IO uint32_t HCUP2;
    __IO uint32_t HCUP3;
    __IO uint32_t HCUP4;
    __IO uint32_t HCUP5;
    __IO uint32_t HCUP6;
    __IO uint32_t HCUP7;
    __IO uint32_t HCUP8;
    __IO uint32_t HCUP9;
    __IO uint32_t HCUP10;
    __IO uint32_t HCUP11;
    __IO uint32_t HCUP12;
    uint32_t RESERVED0[3];
} stc_tmra_hcupr_bit_t;

typedef struct
{
    __IO uint32_t HCDO0;
    __IO uint32_t HCDO1;
    __IO uint32_t HCDO2;
    __IO uint32_t HCDO3;
    __IO uint32_t HCDO4;
    __IO uint32_t HCDO5;
    __IO uint32_t HCDO6;
    __IO uint32_t HCDO7;
    __IO uint32_t HCDO8;
    __IO uint32_t HCDO9;
    __IO uint32_t HCDO10;
    __IO uint32_t HCDO11;
    __IO uint32_t HCDO12;
    uint32_t RESERVED0[3];
} stc_tmra_hcdor_bit_t;

typedef struct
{
    __IO uint32_t ITEN1;
    __IO uint32_t ITEN2;
    uint32_t RESERVED0[14];
} stc_tmra_iconr_bit_t;

typedef struct
{
    __IO uint32_t ETEN1;
    __IO uint32_t ETEN2;
    uint32_t RESERVED0[14];
} stc_tmra_econr_bit_t;

typedef struct
{
    __IO uint32_t NOFIENTG;
    __IO uint32_t NOFICKTG0;
    __IO uint32_t NOFICKTG1;
    uint32_t RESERVED0[5];
    __IO uint32_t NOFIENCA;
    __IO uint32_t NOFICKCA0;
    __IO uint32_t NOFICKCA1;
    uint32_t RESERVED1[1];
    __IO uint32_t NOFIENCB;
    __IO uint32_t NOFICKCB0;
    __IO uint32_t NOFICKCB1;
    uint32_t RESERVED2[1];
} stc_tmra_fconr_bit_t;

typedef struct
{
    __IO uint32_t CMPF1;
    __IO uint32_t CMPF2;
    uint32_t RESERVED0[14];
} stc_tmra_stflr_bit_t;

typedef struct
{
    __IO uint32_t BEN;
    __IO uint32_t BSE0;
    __IO uint32_t BSE1;
    uint32_t RESERVED0[13];
} stc_tmra_bconr_bit_t;

typedef struct
{
    __IO uint32_t CAPMD;
    uint32_t RESERVED0[3];
    __IO uint32_t HICP0;
    __IO uint32_t HICP1;
    __IO uint32_t HICP2;
    uint32_t RESERVED1[5];
    __IO uint32_t NOFIENCP;
    __IO uint32_t NOFICKCP0;
    __IO uint32_t NOFICKCP1;
    uint32_t RESERVED2[1];
} stc_tmra_cconr_bit_t;

