levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
typedef struct
{
    stc_gpio_pidr_bit_t                      PIDR0_b;
    stc_gpio_pidr_bit_t                      PIDR1_b;
    stc_gpio_pidr_bit_t                      PIDR2_b;
    stc_gpio_pidr_bit_t                      PIDR3_b;
    stc_gpio_pidr_bit_t                      PIDR4_b;
    stc_gpio_pidr_bit_t                      PIDR5_b;
    uint32_t                                 RESERVED0[8];
    stc_gpio_pidr_bit_t                      PIDR7_b;
    uint32_t                                 RESERVED1[8];
    stc_gpio_pidr_bit_t                      PIDR9_b;
    stc_gpio_pidr_bit_t                      PIDRA_b;
    stc_gpio_pidr_bit_t                      PIDRB_b;
    uint32_t                                 RESERVED2[8];
    stc_gpio_pidr_bit_t                      PIDRD_b;
    stc_gpio_pidr_bit_t                      PIDRE_b;
    uint32_t                                 RESERVED3[8];
    stc_gpio_podr_bit_t                      PODR0_b;
    stc_gpio_podr_bit_t                      PODR1_b;
    stc_gpio_podr_bit_t                      PODR2_b;
    stc_gpio_podr_bit_t                      PODR3_b;
    stc_gpio_podr_bit_t                      PODR4_b;
    stc_gpio_podr_bit_t                      PODR5_b;
    uint32_t                                 RESERVED4[8];
    stc_gpio_podr_bit_t                      PODR7_b;
    uint32_t                                 RESERVED5[8];
    stc_gpio_podr_bit_t                      PODR9_b;
    stc_gpio_podr_bit_t                      PODRA_b;
    stc_gpio_podr_bit_t                      PODRB_b;
    uint32_t                                 RESERVED6[8];
    stc_gpio_podr_bit_t                      PODRD_b;
    stc_gpio_podr_bit_t                      PODRE_b;
    uint32_t                                 RESERVED7[8];
    stc_gpio_poer_bit_t                      POER0_b;
    stc_gpio_poer_bit_t                      POER1_b;
    stc_gpio_poer_bit_t                      POER2_b;
    stc_gpio_poer_bit_t                      POER3_b;
    stc_gpio_poer_bit_t                      POER4_b;
    stc_gpio_poer_bit_t                      POER5_b;
    uint32_t                                 RESERVED8[8];
    stc_gpio_poer_bit_t                      POER7_b;
    uint32_t                                 RESERVED9[8];
    stc_gpio_poer_bit_t                      POER9_b;
    stc_gpio_poer_bit_t                      POERA_b;
    stc_gpio_poer_bit_t                      POERB_b;
    uint32_t                                 RESERVED10[8];
    stc_gpio_poer_bit_t                      POERD_b;
    stc_gpio_poer_bit_t                      POERE_b;
    uint32_t                                 RESERVED11[8];
    stc_gpio_posr_bit_t                      POSR0_b;
    stc_gpio_posr_bit_t                      POSR1_b;
    stc_gpio_posr_bit_t                      POSR2_b;
    stc_gpio_posr_bit_t                      POSR3_b;
    stc_gpio_posr_bit_t                      POSR4_b;
    stc_gpio_posr_bit_t                      POSR5_b;
    uint32_t                                 RESERVED12[8];
    stc_gpio_posr_bit_t                      POSR7_b;
    uint32_t                                 RESERVED13[8];
    stc_gpio_posr_bit_t                      POSR9_b;
    stc_gpio_posr_bit_t                      POSRA_b;
    stc_gpio_posr_bit_t                      POSRB_b;
    uint32_t                                 RESERVED14[8];
    stc_gpio_posr_bit_t                      POSRD_b;
    stc_gpio_posr_bit_t                      POSRE_b;
    uint32_t                                 RESERVED15[8];
    stc_gpio_porr_bit_t                      PORR0_b;
    stc_gpio_porr_bit_t                      PORR1_b;
    stc_gpio_porr_bit_t                      PORR2_b;
    stc_gpio_porr_bit_t                      PORR3_b;
    stc_gpio_porr_bit_t                      PORR4_b;
    stc_gpio_porr_bit_t                      PORR5_b;
    uint32_t                                 RESERVED16[8];
    stc_gpio_porr_bit_t                      PORR7_b;
    uint32_t                                 RESERVED17[8];
    stc_gpio_porr_bit_t                      PORR9_b;
    stc_gpio_porr_bit_t                      PORRA_b;
    stc_gpio_porr_bit_t                      PORRB_b;
    uint32_t                                 RESERVED18[8];
    stc_gpio_porr_bit_t                      PORRD_b;
    stc_gpio_porr_bit_t                      PORRE_b;
    uint32_t                                 RESERVED19[8];
    stc_gpio_potr_bit_t                      POTR0_b;
    stc_gpio_potr_bit_t                      POTR1_b;
    stc_gpio_potr_bit_t                      POTR2_b;
    stc_gpio_potr_bit_t                      POTR3_b;
    stc_gpio_potr_bit_t                      POTR4_b;
    stc_gpio_potr_bit_t                      POTR5_b;
    uint32_t                                 RESERVED20[8];
    stc_gpio_potr_bit_t                      POTR7_b;
    uint32_t                                 RESERVED21[8];
    stc_gpio_potr_bit_t                      POTR9_b;
    stc_gpio_potr_bit_t                      POTRA_b;
    stc_gpio_potr_bit_t                      POTRB_b;
    uint32_t                                 RESERVED22[8];
    stc_gpio_potr_bit_t                      POTRD_b;
    stc_gpio_potr_bit_t                      POTRE_b;
    uint32_t                                 RESERVED23[5384];
    stc_gpio_pspcr_bit_t                     PSPCR_b;
    uint32_t                                 RESERVED24[16];
    stc_gpio_pccr_bit_t                      PCCR_b;
    stc_gpio_pinaer_bit_t                    PINAER_b;
    stc_gpio_pwpr_bit_t                      PWPR_b;
    uint32_t                                 RESERVED25[1968];
    stc_gpio_pcr_bit_t                       PCR00_b;
    stc_gpio_pfsr_bit_t                      PFSR00_b;
    stc_gpio_pcr_bit_t                       PCR01_b;
    stc_gpio_pfsr_bit_t                      PFSR01_b;
    stc_gpio_pcr_bit_t                       PCR02_b;
    stc_gpio_pfsr_bit_t                      PFSR02_b;
    uint32_t                                 RESERVED26[160];
    stc_gpio_pcr_bit_t                       PCR10_b;
    stc_gpio_pfsr_bit_t                      PFSR10_b;
    stc_gpio_pcr_bit_t                       PCR11_b;
    stc_gpio_pfsr_bit_t                      PFSR11_b;
    uint32_t                                 RESERVED27[256];
    stc_gpio_pcr_bit_t                       PCR22_b;
    stc_gpio_pfsr_bit_t                      PFSR22_b;
    stc_gpio_pcr_bit_t                       PCR23_b;
    stc_gpio_pfsr_bit_t                      PFSR23_b;
    stc_gpio_pcr_bit_t                       PCR24_b;
    stc_gpio_pfsr_bit_t                      PFSR24_b;
    uint32_t                                 RESERVED28[96];
    stc_gpio_pcr_bit_t                       PCR30_b;
    stc_gpio_pfsr_bit_t                      PFSR30_b;
    stc_gpio_pcr_bit_t                       PCR31_b;
    stc_gpio_pfsr_bit_t                      PFSR31_b;
    stc_gpio_pcr_bit_t                       PCR32_b;
    stc_gpio_pfsr_bit_t                      PFSR32_b;
    stc_gpio_pcr_bit_t                       PCR33_b;
    stc_gpio_pfsr_bit_t                      PFSR33_b;
    uint32_t                                 RESERVED29[64];
    stc_gpio_pcr_bit_t                       PCR36_b;
    stc_gpio_pfsr_bit_t                      PFSR36_b;
    stc_gpio_pcr_bit_t                       PCR37_b;
    stc_gpio_pfsr_bit_t                      PFSR37_b;
    stc_gpio_pcr_bit_t                       PCR40_b;
    stc_gpio_pfsr_bit_t                      PFSR40_b;
    stc_gpio_pcr_bit_t                       PCR41_b;
    stc_gpio_pfsr_bit_t                      PFSR41_b;
    stc_gpio_pcr_bit_t                       PCR42_b;
    stc_gpio_pfsr_bit_t                      PFSR42_b;
    stc_gpio_pcr_bit_t                       PCR43_b;
    stc_gpio_pfsr_bit_t                      PFSR43_b;
    stc_gpio_pcr_bit_t                       PCR44_b;
    stc_gpio_pfsr_bit_t                      PFSR44_b;
    stc_gpio_pcr_bit_t                       PCR45_b;
    stc_gpio_pfsr_bit_t                      PFSR45_b;
    stc_gpio_pcr_bit_t                       PCR46_b;
    stc_gpio_pfsr_bit_t                      PFSR46_b;
    stc_gpio_pcr_bit_t                       PCR47_b;
    stc_gpio_pfsr_bit_t                      PFSR47_b;
    stc_gpio_pcr_bit_t                       PCR50_b;
    stc_gpio_pfsr_bit_t                      PFSR50_b;
    uint32_t                                 RESERVED30[480];
    stc_gpio_pcr_bit_t                       PCR70_b;
    stc_gpio_pfsr_bit_t                      PFSR70_b;
    stc_gpio_pcr_bit_t                       PCR71_b;
    stc_gpio_pfsr_bit_t                      PFSR71_b;
    stc_gpio_pcr_bit_t                       PCR72_b;
    stc_gpio_pfsr_bit_t                      PFSR72_b;
    stc_gpio_pcr_bit_t                       PCR73_b;
    stc_gpio_pfsr_bit_t                      PFSR73_b;
    stc_gpio_pcr_bit_t                       PCR74_b;
    stc_gpio_pfsr_bit_t                      PFSR74_b;
    stc_gpio_pcr_bit_t                       PCR75_b;
    stc_gpio_pfsr_bit_t                      PFSR75_b;
    stc_gpio_pcr_bit_t                       PCR76_b;
    stc_gpio_pfsr_bit_t                      PFSR76_b;
    uint32_t                                 RESERVED31[320];
    stc_gpio_pcr_bit_t                       PCR91_b;
    stc_gpio_pfsr_bit_t                      PFSR91_b;
    stc_gpio_pcr_bit_t                       PCR92_b;
    stc_gpio_pfsr_bit_t                      PFSR92_b;
    stc_gpio_pcr_bit_t                       PCR93_b;
    stc_gpio_pfsr_bit_t                      PFSR93_b;
    stc_gpio_pcr_bit_t                       PCR94_b;
    stc_gpio_pfsr_bit_t                      PFSR94_b;
    uint32_t                                 RESERVED32[160];
    stc_gpio_pcr_bit_t                       PCRA2_b;
    stc_gpio_pfsr_bit_t                      PFSRA2_b;
    stc_gpio_pcr_bit_t                       PCRA3_b;
    stc_gpio_pfsr_bit_t                      PFSRA3_b;
    stc_gpio_pcr_bit_t                       PCRA4_b;
    stc_gpio_pfsr_bit_t                      PFSRA4_b;
    stc_gpio_pcr_bit_t                       PCRA5_b;
    stc_gpio_pfsr_bit_t                      PFSRA5_b;
    uint32_t                                 RESERVED33[64];
    stc_gpio_pcr_bit_t                       PCRB0_b;
    stc_gpio_pfsr_bit_t                      PFSRB0_b;
    stc_gpio_pcr_bit_t                       PCRB1_b;
    stc_gpio_pfsr_bit_t                      PFSRB1_b;
    stc_gpio_pcr_bit_t                       PCRB2_b;
    stc_gpio_pfsr_bit_t                      PFSRB2_b;
    stc_gpio_pcr_bit_t                       PCRB3_b;
    stc_gpio_pfsr_bit_t                      PFSRB3_b;
    stc_gpio_pcr_bit_t                       PCRB4_b;
    stc_gpio_pfsr_bit_t                      PFSRB4_b;
    stc_gpio_pcr_bit_t                       PCRB5_b;
    stc_gpio_pfsr_bit_t                      PFSRB5_b;
    stc_gpio_pcr_bit_t                       PCRB6_b;
    stc_gpio_pfsr_bit_t                      PFSRB6_b;
    stc_gpio_pcr_bit_t                       PCRB7_b;
    stc_gpio_pfsr_bit_t                      PFSRB7_b;
    uint32_t                                 RESERVED34[352];
    stc_gpio_pcr_bit_t                       PCRD3_b;
    stc_gpio_pfsr_bit_t                      PFSRD3_b;
    stc_gpio_pcr_bit_t                       PCRD4_b;
    stc_gpio_pfsr_bit_t                      PFSRD4_b;
    stc_gpio_pcr_bit_t                       PCRD5_b;
    stc_gpio_pfsr_bit_t                      PFSRD5_b;
    stc_gpio_pcr_bit_t                       PCRD6_b;
    stc_gpio_pfsr_bit_t                      PFSRD6_b;
    stc_gpio_pcr_bit_t                       PCRD7_b;
    stc_gpio_pfsr_bit_t                      PFSRD7_b;
    uint32_t                                 RESERVED35[64];
    stc_gpio_pcr_bit_t                       PCRE2_b;
    stc_gpio_pfsr_bit_t                      PFSRE2_b;
} bM4_GPIO_TypeDef;

typedef struct
{
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    uint32_t                                 RESERVED0[64];
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED1[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    stc_i2c_dtr_bit_t                        DTR_b;
    stc_i2c_drr_bit_t                        DRR_b;
    stc_i2c_ccr_bit_t                        CCR_b;
    stc_i2c_fltr_bit_t                       FLTR_b;
} bM4_I2C_TypeDef;

typedef struct
{
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
    stc_icg_icg2_bit_t                       ICG2_b;
    stc_icg_icg3_bit_t                       ICG3_b;
    stc_icg_icg4_bit_t                       ICG4_b;
    stc_icg_icg5_bit_t                       ICG5_b;
    stc_icg_icg6_bit_t                       ICG6_b;
    stc_icg_icg7_bit_t                       ICG7_b;
} bM4_ICG_TypeDef;

typedef struct
{
    stc_intc_nmicr_bit_t                     NMICR_b;
    stc_intc_nmier_bit_t                     NMIER_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmicfr_bit_t                    NMICFR_b;
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    uint32_t                                 RESERVED0[256];
    stc_intc_wupen_bit_t                     WUPEN_b;
    stc_intc_eirqfr_bit_t                    EIRQFR_b;
    stc_intc_eirqcfr_bit_t                   EIRQCFR_b;
    stc_intc_sel_bit_t                       SEL0_b;
    stc_intc_sel_bit_t                       SEL1_b;
    stc_intc_sel_bit_t                       SEL2_b;
    stc_intc_sel_bit_t                       SEL3_b;
    stc_intc_sel_bit_t                       SEL4_b;
    stc_intc_sel_bit_t                       SEL5_b;
    stc_intc_sel_bit_t                       SEL6_b;
    stc_intc_sel_bit_t                       SEL7_b;
    stc_intc_sel_bit_t                       SEL8_b;
    stc_intc_sel_bit_t                       SEL9_b;
    stc_intc_sel_bit_t                       SEL10_b;
    stc_intc_sel_bit_t                       SEL11_b;
    stc_intc_sel_bit_t                       SEL12_b;
    stc_intc_sel_bit_t                       SEL13_b;
    stc_intc_sel_bit_t                       SEL14_b;
    stc_intc_sel_bit_t                       SEL15_b;
    stc_intc_sel_bit_t                       SEL16_b;
    stc_intc_sel_bit_t                       SEL17_b;
    stc_intc_sel_bit_t                       SEL18_b;
    stc_intc_sel_bit_t                       SEL19_b;
    stc_intc_sel_bit_t                       SEL20_b;
    stc_intc_sel_bit_t                       SEL21_b;
    stc_intc_sel_bit_t                       SEL22_b;
    stc_intc_sel_bit_t                       SEL23_b;
    stc_intc_sel_bit_t                       SEL24_b;
    stc_intc_sel_bit_t                       SEL25_b;
    stc_intc_sel_bit_t                       SEL26_b;
    stc_intc_sel_bit_t                       SEL27_b;
    stc_intc_sel_bit_t                       SEL28_b;
    stc_intc_sel_bit_t                       SEL29_b;
    stc_intc_sel_bit_t                       SEL30_b;
    stc_intc_sel_bit_t                       SEL31_b;
    stc_intc_sel_bit_t                       SEL32_b;
    stc_intc_sel_bit_t                       SEL33_b;
    stc_intc_sel_bit_t                       SEL34_b;
    stc_intc_sel_bit_t                       SEL35_b;
    stc_intc_sel_bit_t                       SEL36_b;
    stc_intc_sel_bit_t                       SEL37_b;
    stc_intc_sel_bit_t                       SEL38_b;
    stc_intc_sel_bit_t                       SEL39_b;
    stc_intc_sel_bit_t                       SEL40_b;
    stc_intc_sel_bit_t                       SEL41_b;
    stc_intc_sel_bit_t                       SEL42_b;
    stc_intc_sel_bit_t                       SEL43_b;
    stc_intc_sel_bit_t                       SEL44_b;
    stc_intc_sel_bit_t                       SEL45_b;
    stc_intc_sel_bit_t                       SEL46_b;
    stc_intc_sel_bit_t                       SEL47_b;
    stc_intc_sel_bit_t                       SEL48_b;
    stc_intc_sel_bit_t                       SEL49_b;
    stc_intc_sel_bit_t                       SEL50_b;
    stc_intc_sel_bit_t                       SEL51_b;
    stc_intc_sel_bit_t                       SEL52_b;
    stc_intc_sel_bit_t                       SEL53_b;
    stc_intc_sel_bit_t                       SEL54_b;
    stc_intc_sel_bit_t                       SEL55_b;
    stc_intc_sel_bit_t                       SEL56_b;
    stc_intc_sel_bit_t                       SEL57_b;
    stc_intc_sel_bit_t                       SEL58_b;
    stc_intc_sel_bit_t                       SEL59_b;
    stc_intc_sel_bit_t                       SEL60_b;
    stc_intc_sel_bit_t                       SEL61_b;
    stc_intc_sel_bit_t                       SEL62_b;
    stc_intc_sel_bit_t                       SEL63_b;
    stc_intc_sel_bit_t                       SEL64_b;
    stc_intc_sel_bit_t                       SEL65_b;
    stc_intc_sel_bit_t                       SEL66_b;
    stc_intc_sel_bit_t                       SEL67_b;
    stc_intc_sel_bit_t                       SEL68_b;
    stc_intc_sel_bit_t                       SEL69_b;
    stc_intc_sel_bit_t                       SEL70_b;
    stc_intc_sel_bit_t                       SEL71_b;
    stc_intc_sel_bit_t                       SEL72_b;
    stc_intc_sel_bit_t                       SEL73_b;
    stc_intc_sel_bit_t                       SEL74_b;
    stc_intc_sel_bit_t                       SEL75_b;
    stc_intc_sel_bit_t                       SEL76_b;
    stc_intc_sel_bit_t                       SEL77_b;
    stc_intc_sel_bit_t                       SEL78_b;
    stc_intc_sel_bit_t                       SEL79_b;
    stc_intc_sel_bit_t                       SEL80_b;
    stc_intc_sel_bit_t                       SEL81_b;
    stc_intc_sel_bit_t                       SEL82_b;
    stc_intc_sel_bit_t                       SEL83_b;
    stc_intc_sel_bit_t                       SEL84_b;
    stc_intc_sel_bit_t                       SEL85_b;
    stc_intc_sel_bit_t                       SEL86_b;
    stc_intc_sel_bit_t                       SEL87_b;
    stc_intc_sel_bit_t                       SEL88_b;
    stc_intc_sel_bit_t                       SEL89_b;
    stc_intc_sel_bit_t                       SEL90_b;
    stc_intc_sel_bit_t                       SEL91_b;
    stc_intc_sel_bit_t                       SEL92_b;
    stc_intc_sel_bit_t                       SEL93_b;
    stc_intc_sel_bit_t                       SEL94_b;
    stc_intc_sel_bit_t                       SEL95_b;
    stc_intc_sel_bit_t                       SEL96_b;
    stc_intc_sel_bit_t                       SEL97_b;
    stc_intc_sel_bit_t                       SEL98_b;
    stc_intc_sel_bit_t                       SEL99_b;
    stc_intc_sel_bit_t                       SEL100_b;
    uint32_t                                 RESERVED1[1376];
    stc_intc_swier_bit_t                     SWIER_b;
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ier_bit_t                       IER_b;
} bM4_INTC_TypeDef;

typedef struct
{
    stc_pwc_stpmcr_bit_t                     STPMCR_b;
    uint32_t                                 RESERVED0[24];
    stc_pwc_pwrc_bit_t                       PWRC_b;
    uint32_t                                 RESERVED1[16];
    stc_pwc_pwrmonr_bit_t                    PWRMONR_b;
    uint32_t                                 RESERVED2[24];
    stc_pwc_ramcr_bit_t                      RAMCR_b;
    uint32_t                                 RESERVED3[24];
    stc_pwc_lvdcr0_bit_t                     LVDCR0_b;
    stc_pwc_lvdcsr1_bit_t                    LVDCSR1_b;
    uint32_t                                 RESERVED4[88];
    stc_pwc_fprc_bit_t                       FPRC_b;
    uint32_t                                 RESERVED5[240];
    stc_pwc_dbgc_bit_t                       DBGC_b;
    uint32_t                                 RESERVED6[1520];
    stc_pwc_rstf0_bit_t                      RSTF0_b;
} bM4_PWC_TypeDef;

typedef struct
{
    stc_rmu_rstf0_bit_t                      RSTF0_b;
} bM4_RMU_TypeDef;

typedef struct
{
    stc_spi_dr_bit_t                         DR_b;
    stc_spi_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED0[32];
    stc_spi_cfg1_bit_t                       CFG1_b;
    uint32_t                                 RESERVED1[32];
    stc_spi_sr_bit_t                         SR_b;
    stc_spi_cfg2_bit_t                       CFG2_b;
} bM4_SPI_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[32];
    stc_swdt_sr_bit_t                        SR_b;
    stc_swdt_rr_bit_t                        RR_b;
} bM4_SWDT_TypeDef;

typedef struct
{
    stc_tmr0_cntar_bit_t                     CNTAR_b;
    stc_tmr0_cntbr_bit_t                     CNTBR_b;
    stc_tmr0_cmpar_bit_t                     CMPAR_b;
    stc_tmr0_cmpbr_bit_t                     CMPBR_b;
    stc_tmr0_bconr_bit_t                     BCONR_b;
    stc_tmr0_stflr_bit_t                     STFLR_b;
} bM4_TMR0_TypeDef;

