levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
typedef struct
{
    uint32_t                                 RESERVED0[16];
    stc_tmr4_occruh_bit_t                    OCCRUH_b;
    uint32_t                                 RESERVED1[16];
    stc_tmr4_occrul_bit_t                    OCCRUL_b;
    uint32_t                                 RESERVED2[16];
    stc_tmr4_occrvh_bit_t                    OCCRVH_b;
    uint32_t                                 RESERVED3[16];
    stc_tmr4_occrvl_bit_t                    OCCRVL_b;
    uint32_t                                 RESERVED4[16];
    stc_tmr4_occrwh_bit_t                    OCCRWH_b;
    uint32_t                                 RESERVED5[16];
    stc_tmr4_occrwl_bit_t                    OCCRWL_b;
    stc_tmr4_ocsr_bit_t                      OCSRU_b;
    stc_tmr4_ocer_bit_t                      OCERU_b;
    stc_tmr4_ocsr_bit_t                      OCSRV_b;
    stc_tmr4_ocer_bit_t                      OCERV_b;
    stc_tmr4_ocsr_bit_t                      OCSRW_b;
    stc_tmr4_ocer_bit_t                      OCERW_b;
    stc_tmr4_ocmrh_bit_t                     OCMRHUH_b;
    uint32_t                                 RESERVED6[16];
    stc_tmr4_ocmrl_bit_t                     OCMRLUL_b;
    stc_tmr4_ocmrh_bit_t                     OCMRHVH_b;
    uint32_t                                 RESERVED7[16];
    stc_tmr4_ocmrl_bit_t                     OCMRLVL_b;
    stc_tmr4_ocmrh_bit_t                     OCMRHWH_b;
    uint32_t                                 RESERVED8[16];
    stc_tmr4_ocmrl_bit_t                     OCMRLWL_b;
    uint32_t                                 RESERVED9[48];
    stc_tmr4_cpsr_bit_t                      CPSR_b;
    uint32_t                                 RESERVED10[16];
    stc_tmr4_cntr_bit_t                      CNTR_b;
    stc_tmr4_ccsr_bit_t                      CCSR_b;
    stc_tmr4_cvpr_bit_t                      CVPR_b;
    uint32_t                                 RESERVED11[432];
    stc_tmr4_pfsru_bit_t                     PFSRU_b;
    stc_tmr4_pdaru_bit_t                     PDARU_b;
    stc_tmr4_pdbru_bit_t                     PDBRU_b;
    uint32_t                                 RESERVED12[16];
    stc_tmr4_pfsrv_bit_t                     PFSRV_b;
    stc_tmr4_pdarv_bit_t                     PDARV_b;
    stc_tmr4_pdbrv_bit_t                     PDBRV_b;
    uint32_t                                 RESERVED13[16];
    stc_tmr4_pfsrw_bit_t                     PFSRW_b;
    stc_tmr4_pdarw_bit_t                     PDARW_b;
    stc_tmr4_pdbrw_bit_t                     PDBRW_b;
    stc_tmr4_pocr_bit_t                      POCRU_b;
    uint32_t                                 RESERVED14[16];
    stc_tmr4_pocr_bit_t                      POCRV_b;
    uint32_t                                 RESERVED15[16];
    stc_tmr4_pocr_bit_t                      POCRW_b;
    uint32_t                                 RESERVED16[16];
    stc_tmr4_rcsr_bit_t                      RCSR_b;
    uint32_t                                 RESERVED17[96];
    stc_tmr4_sccruh_bit_t                    SCCRUH_b;
    uint32_t                                 RESERVED18[16];
    stc_tmr4_sccrul_bit_t                    SCCRUL_b;
    uint32_t                                 RESERVED19[16];
    stc_tmr4_sccrvh_bit_t                    SCCRVH_b;
    uint32_t                                 RESERVED20[16];
    stc_tmr4_sccrvl_bit_t                    SCCRVL_b;
    uint32_t                                 RESERVED21[16];
    stc_tmr4_sccrwh_bit_t                    SCCRWH_b;
    uint32_t                                 RESERVED22[16];
    stc_tmr4_sccrwl_bit_t                    SCCRWL_b;
    stc_tmr4_scsr_bit_t                      SCSRUH_b;
    stc_tmr4_scmr_bit_t                      SCMRUH_b;
    stc_tmr4_scsr_bit_t                      SCSRUL_b;
    stc_tmr4_scmr_bit_t                      SCMRUL_b;
    stc_tmr4_scsr_bit_t                      SCSRVH_b;
    stc_tmr4_scmr_bit_t                      SCMRVH_b;
    stc_tmr4_scsr_bit_t                      SCSRVL_b;
    stc_tmr4_scmr_bit_t                      SCMRVL_b;
    stc_tmr4_scsr_bit_t                      SCSRWH_b;
    stc_tmr4_scmr_bit_t                      SCMRWH_b;
    stc_tmr4_scsr_bit_t                      SCSRWL_b;
    stc_tmr4_scmr_bit_t                      SCMRWL_b;
    stc_tmr4_pscr_bit_t                      PSCR_b;
    stc_tmr4_scer_bit_t                      SCER_b;
} bM4_TMR4_TypeDef;

typedef struct
{
    stc_tmra_cnter_bit_t                     CNTER_b;
    uint32_t                                 RESERVED0[16];
    stc_tmra_perar_bit_t                     PERAR_b;
    uint32_t                                 RESERVED1[464];
    stc_tmra_cmpar_bit_t                     CMPAR1_b;
    uint32_t                                 RESERVED2[16];
    stc_tmra_cmpar_bit_t                     CMPAR2_b;
    uint32_t                                 RESERVED3[464];
    stc_tmra_bcstr_bit_t                     BCSTR_b;
    uint32_t                                 RESERVED4[16];
    stc_tmra_hconr_bit_t                     HCONR_b;
    uint32_t                                 RESERVED5[16];
    stc_tmra_hcupr_bit_t                     HCUPR_b;
    uint32_t                                 RESERVED6[16];
    stc_tmra_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED7[16];
    stc_tmra_iconr_bit_t                     ICONR_b;
    uint32_t                                 RESERVED8[16];
    stc_tmra_econr_bit_t                     ECONR_b;
    uint32_t                                 RESERVED9[16];
    stc_tmra_fconr_bit_t                     FCONR_b;
    uint32_t                                 RESERVED10[16];
    stc_tmra_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED11[272];
    stc_tmra_bconr_bit_t                     BCONR_b;
    uint32_t                                 RESERVED12[496];
    stc_tmra_cconr_bit_t                     CCONR1_b;
    uint32_t                                 RESERVED13[16];
    stc_tmra_cconr_bit_t                     CCONR2_b;
    uint32_t                                 RESERVED14[464];
    stc_tmra_pconr_bit_t                     PCONR1_b;
    uint32_t                                 RESERVED15[16];
    stc_tmra_pconr_bit_t                     PCONR2_b;
} bM4_TMRA_TypeDef;

typedef struct
{
    stc_tmrb_cnter_bit_t                     CNTER_b;
    uint32_t                                 RESERVED0[16];
    stc_tmrb_perar_bit_t                     PERAR_b;
    uint32_t                                 RESERVED1[464];
    stc_tmrb_cmpar_bit_t                     CMPAR1_b;
    uint32_t                                 RESERVED2[16];
    stc_tmrb_cmpar_bit_t                     CMPAR2_b;
    uint32_t                                 RESERVED3[16];
    stc_tmrb_cmpar_bit_t                     CMPAR3_b;
    uint32_t                                 RESERVED4[16];
    stc_tmrb_cmpar_bit_t                     CMPAR4_b;
    uint32_t                                 RESERVED5[16];
    stc_tmrb_cmpar_bit_t                     CMPAR5_b;
    uint32_t                                 RESERVED6[16];
    stc_tmrb_cmpar_bit_t                     CMPAR6_b;
    uint32_t                                 RESERVED7[336];
    stc_tmrb_bcstr_bit_t                     BCSTR_b;
    uint32_t                                 RESERVED8[16];
    stc_tmrb_hconr_bit_t                     HCONR_b;
    uint32_t                                 RESERVED9[16];
    stc_tmrb_hcupr_bit_t                     HCUPR_b;
    uint32_t                                 RESERVED10[16];
    stc_tmrb_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED11[16];
    stc_tmrb_iconr_bit_t                     ICONR_b;
    uint32_t                                 RESERVED12[16];
    stc_tmrb_econr_bit_t                     ECONR_b;
    uint32_t                                 RESERVED13[48];
    stc_tmrb_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED14[272];
    stc_tmrb_bconr_bit_t                     BCONR1_b;
    uint32_t                                 RESERVED15[48];
    stc_tmrb_bconr_bit_t                     BCONR2_b;
    uint32_t                                 RESERVED16[48];
    stc_tmrb_bconr_bit_t                     BCONR3_b;
    uint32_t                                 RESERVED17[368];
    stc_tmrb_cconr_bit_t                     CCONR1_b;
    uint32_t                                 RESERVED18[16];
    stc_tmrb_cconr_bit_t                     CCONR2_b;
    uint32_t                                 RESERVED19[16];
    stc_tmrb_cconr_bit_t                     CCONR3_b;
    uint32_t                                 RESERVED20[16];
    stc_tmrb_cconr_bit_t                     CCONR4_b;
    uint32_t                                 RESERVED21[400];
    stc_tmrb_pconr_bit_t                     PCONR1_b;
    uint32_t                                 RESERVED22[16];
    stc_tmrb_pconr_bit_t                     PCONR2_b;
    uint32_t                                 RESERVED23[16];
    stc_tmrb_pconr_bit_t                     PCONR3_b;
    uint32_t                                 RESERVED24[16];
    stc_tmrb_pconr_bit_t                     PCONR4_b;
} bM4_TMRB_TypeDef;

typedef struct
{
    stc_usart_sr_bit_t                       SR_b;
    stc_usart_dr_bit_t                       DR_b;
    stc_usart_brr_bit_t                      BRR_b;
    stc_usart_cr1_bit_t                      CR1_b;
    stc_usart_cr2_bit_t                      CR2_b;
    stc_usart_cr3_bit_t                      CR3_b;
    stc_usart_pr_bit_t                       PR_b;
} bM4_USART_TypeDef;

typedef struct
{
    stc_wdt_cr_bit_t                         CR_b;
    stc_wdt_sr_bit_t                         SR_b;
    stc_wdt_rr_bit_t                         RR_b;
} bM4_WDT_TypeDef;



/******************************************************************************/
/*      Device Specific Peripheral bit_band declaration & memory map          */
/******************************************************************************/

