levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/mcu/common/hc32m423.h
#define bM4_ADC                              ((bM4_ADC_TypeDef *)0x42600000UL)
#define bM4_AOS                              ((bM4_AOS_TypeDef *)0x42210000UL)
#define bM4_CMP1                             ((bM4_CMP_TypeDef *)0x42940000UL)
#define bM4_CMP2                             ((bM4_CMP_TypeDef *)0x42940200UL)
#define bM4_CMP3                             ((bM4_CMP_TypeDef *)0x42940400UL)
#define bM4_CMU                              ((bM4_CMU_TypeDef *)0x42A88000UL)
#define bM4_CRC                              ((bM4_CRC_TypeDef *)0x42A08000UL)
#define bM4_CTC                              ((bM4_CTC_TypeDef *)0x42200000UL)
#define bM4_DAC                              ((bM4_DAC_TypeDef *)0x42942000UL)
#define bM4_DCU                              ((bM4_DCU_TypeDef *)0x42A40000UL)
#define bM4_DMA                              ((bM4_DMA_TypeDef *)0x42A60000UL)
#define bM4_EFM                              ((bM4_EFM_TypeDef *)0x42208000UL)
#define bM4_EMB                              ((bM4_EMB_TypeDef *)0x422F8000UL)
#define bM4_FCM                              ((bM4_FCM_TypeDef *)0x42908000UL)
#define bM4_GPIO                             ((bM4_GPIO_TypeDef *)0x42A70000UL)
#define bM4_I2C                              ((bM4_I2C_TypeDef *)0x429C0000UL)
#define bM4_INTC                             ((bM4_INTC_TypeDef *)0x42A20000UL)
#define bM4_PWC                              ((bM4_PWC_TypeDef *)0x42A80000UL)
#define bM4_RMU                              ((bM4_RMU_TypeDef *)0x42A82000UL)
#define bM4_SPI                              ((bM4_SPI_TypeDef *)0x42380000UL)
#define bM4_SWDT                             ((bM4_SWDT_TypeDef *)0x42928000UL)
#define bM4_TMR01                            ((bM4_TMR0_TypeDef *)0x42480000UL)
#define bM4_TMR02                            ((bM4_TMR0_TypeDef *)0x42488000UL)
#define bM4_TMR4                             ((bM4_TMR4_TypeDef *)0x422E0000UL)
#define bM4_TMRA1                            ((bM4_TMRA_TypeDef *)0x422A0000UL)
#define bM4_TMRA2                            ((bM4_TMRA_TypeDef *)0x422A8000UL)
#define bM4_TMRA3                            ((bM4_TMRA_TypeDef *)0x422B0000UL)
#define bM4_TMRA4                            ((bM4_TMRA_TypeDef *)0x422B8000UL)
#define bM4_TMRB                             ((bM4_TMRB_TypeDef *)0x424A0000UL)
#define bM4_USART1                           ((bM4_USART_TypeDef *)0x423A0000UL)
#define bM4_USART2                           ((bM4_USART_TypeDef *)0x423A8000UL)
#define bM4_USART3                           ((bM4_USART_TypeDef *)0x42420000UL)
#define bM4_USART4                           ((bM4_USART_TypeDef *)0x42428000UL)
#define bM4_WDT                              ((bM4_WDT_TypeDef *)0x42920000UL)


#ifdef __cplusplus
}
#endif

#endif /* __HC32M423_H__ */

